MarlinFirmware/Marlin/Marlin/lib/h32_core/main/hdsc32core/common/hc32f46x.h
/*******************************************************************************
 * Copyright (C) 2017, Huada Semiconductor Co.,Ltd All rights reserved.
 *
 * This software is owned and published by:
 * Huada Semiconductor Co.,Ltd. ("HDSC").
 *
 * BY DOWNLOADING, INSTALLING OR USING THIS SOFTWARE, YOU AGREE TO BE BOUND
 * BY ALL THE TERMS AND CONDITIONS OF THIS AGREEMENT.
 *
 * This software contains source code for use with HDSC
 * components. This software is licensed by HDSC to be adapted only
 * for use in systems utilizing HDSC components. HDSC shall not be
 * responsible for misuse or illegal use of this software for devices not
 * supported herein. HDSC is providing this software "AS IS" and will
 * not be responsible for issues arising from incorrect user implementation
 * of the software.
 *
 * Disclaimer:
 * HDSC MAKES NO WARRANTY, EXPRESS OR IMPLIED, ARISING BY LAW OR OTHERWISE,
 * REGARDING THE SOFTWARE (INCLUDING ANY ACCOMPANYING WRITTEN MATERIALS),
 * ITS PERFORMANCE OR SUITABILITY FOR YOUR INTENDED USE, INCLUDING,
 * WITHOUT LIMITATION, THE IMPLIED WARRANTY OF MERCHANTABILITY, THE IMPLIED
 * WARRANTY OF FITNESS FOR A PARTICULAR PURPOSE OR USE, AND THE IMPLIED
 * WARRANTY OF NONINFRINGEMENT.
 * HDSC SHALL HAVE NO LIABILITY (WHETHER IN CONTRACT, WARRANTY, TORT,
 * NEGLIGENCE OR OTHERWISE) FOR ANY DAMAGES WHATSOEVER (INCLUDING, WITHOUT
 * LIMITATION, DAMAGES FOR LOSS OF BUSINESS PROFITS, BUSINESS INTERRUPTION,
 * LOSS OF BUSINESS INFORMATION, OR OTHER PECUNIARY LOSS) ARISING FROM USE OR
 * INABILITY TO USE THE SOFTWARE, INCLUDING, WITHOUT LIMITATION, ANY DIRECT,
 * INDIRECT, INCIDENTAL, SPECIAL OR CONSEQUENTIAL DAMAGES OR LOSS OF DATA,
 * SAVINGS OR PROFITS,
 * EVEN IF Disclaimer HAS BEEN ADVISED OF THE POSSIBILITY OF SUCH DAMAGES.
 * YOU ASSUME ALL RESPONSIBILITIES FOR SELECTION OF THE SOFTWARE TO ACHIEVE YOUR
 * INTENDED RESULTS, AND FOR THE INSTALLATION OF, USE OF, AND RESULTS OBTAINED
 * FROM, THE SOFTWARE.
 *
 * This software may be replicated in part or whole for the licensed use,
 * with the restriction that this Disclaimer and Copyright notice must be
 * included with each copy of this software, whether used in part or whole,
 * at all times.
 */
/******************************************************************************/
/** \file HC32F46x.h
 **
 ** Auto generate.
 ** Headerfile for HC32F46x series MCU
 **
 ** History:
 **
 **   - 2019-08-22  1.03   First version for Device Driver Library of HC32F46x series MCU.
 **
 ******************************************************************************/

#ifndef __HC32F46x_H__
#define __HC32F46x_H__

#ifdef __cplusplus
extern "C"
{
#endif

/*******************************************************************************
 * Configuration of the Cortex-M4 Processor and Core Peripherals
 ******************************************************************************/
#define __CM4_REV 0x0001         /*!< Core revision r0p1                                   */
#define __MPU_PRESENT 1          /*!< HC32F46x provides an MPU                             */
#define __NVIC_PRIO_BITS 4       /*!< HC32F46x uses 4 Bits for the Priority Levels         */
#define __Vendor_SysTickConfig 0 /*!< Set to 1 if different SysTick Config is used         */
#define __FPU_PRESENT 1          /*!< FPU present                                          */

    /*******************************************************************************
     * Interrupt Number Definition
     ******************************************************************************/
    typedef enum IRQn
    {
        NMI_IRQn = -14,            /*  2 Non Maskable                            */
        HardFault_IRQn = -13,      /*  3 Hard Fault                              */
        MemManageFault_IRQn = -12, /*  4 MemManage Fault                         */
        BusFault_IRQn = -11,       /*  5 Bus Fault                               */
        UsageFault_IRQn = -10,     /*  6 Usage Fault                             */
        SVC_IRQn = -5,             /* 11 SV Call                                 */
        DM_IRQn = -4,              /* 12 Debug Monitor                           */
        PendSV_IRQn = -2,          /* 14 Pend SV                                 */
        SysTick_IRQn = -1,         /* 15 System Tick                             */
        Int000_IRQn = 0,
        Int001_IRQn = 1,
        Int002_IRQn = 2,
        Int003_IRQn = 3,
        Int004_IRQn = 4,
        Int005_IRQn = 5,
        Int006_IRQn = 6,
        Int007_IRQn = 7,
        Int008_IRQn = 8,
        Int009_IRQn = 9,
        Int010_IRQn = 10,
        Int011_IRQn = 11,
        Int012_IRQn = 12,
        Int013_IRQn = 13,
        Int014_IRQn = 14,
        Int015_IRQn = 15,
        Int016_IRQn = 16,
        Int017_IRQn = 17,
        Int018_IRQn = 18,
        Int019_IRQn = 19,
        Int020_IRQn = 20,
        Int021_IRQn = 21,
        Int022_IRQn = 22,
        Int023_IRQn = 23,
        Int024_IRQn = 24,
        Int025_IRQn = 25,
        Int026_IRQn = 26,
        Int027_IRQn = 27,
        Int028_IRQn = 28,
        Int029_IRQn = 29,
        Int030_IRQn = 30,
        Int031_IRQn = 31,
        Int032_IRQn = 32,
        Int033_IRQn = 33,
        Int034_IRQn = 34,
        Int035_IRQn = 35,
        Int036_IRQn = 36,
        Int037_IRQn = 37,
        Int038_IRQn = 38,
        Int039_IRQn = 39,
        Int040_IRQn = 40,
        Int041_IRQn = 41,
        Int042_IRQn = 42,
        Int043_IRQn = 43,
        Int044_IRQn = 44,
        Int045_IRQn = 45,
        Int046_IRQn = 46,
        Int047_IRQn = 47,
        Int048_IRQn = 48,
        Int049_IRQn = 49,
        Int050_IRQn = 50,
        Int051_IRQn = 51,
        Int052_IRQn = 52,
        Int053_IRQn = 53,
        Int054_IRQn = 54,
        Int055_IRQn = 55,
        Int056_IRQn = 56,
        Int057_IRQn = 57,
        Int058_IRQn = 58,
        Int059_IRQn = 59,
        Int060_IRQn = 60,
        Int061_IRQn = 61,
        Int062_IRQn = 62,
        Int063_IRQn = 63,
        Int064_IRQn = 64,
        Int065_IRQn = 65,
        Int066_IRQn = 66,
        Int067_IRQn = 67,
        Int068_IRQn = 68,
        Int069_IRQn = 69,
        Int070_IRQn = 70,
        Int071_IRQn = 71,
        Int072_IRQn = 72,
        Int073_IRQn = 73,
        Int074_IRQn = 74,
        Int075_IRQn = 75,
        Int076_IRQn = 76,
        Int077_IRQn = 77,
        Int078_IRQn = 78,
        Int079_IRQn = 79,
        Int080_IRQn = 80,
        Int081_IRQn = 81,
        Int082_IRQn = 82,
        Int083_IRQn = 83,
        Int084_IRQn = 84,
        Int085_IRQn = 85,
        Int086_IRQn = 86,
        Int087_IRQn = 87,
        Int088_IRQn = 88,
        Int089_IRQn = 89,
        Int090_IRQn = 90,
        Int091_IRQn = 91,
        Int092_IRQn = 92,
        Int093_IRQn = 93,
        Int094_IRQn = 94,
        Int095_IRQn = 95,
        Int096_IRQn = 96,
        Int097_IRQn = 97,
        Int098_IRQn = 98,
        Int099_IRQn = 99,
        Int100_IRQn = 100,
        Int101_IRQn = 101,
        Int102_IRQn = 102,
        Int103_IRQn = 103,
        Int104_IRQn = 104,
        Int105_IRQn = 105,
        Int106_IRQn = 106,
        Int107_IRQn = 107,
        Int108_IRQn = 108,
        Int109_IRQn = 109,
        Int110_IRQn = 110,
        Int111_IRQn = 111,
        Int112_IRQn = 112,
        Int113_IRQn = 113,
        Int114_IRQn = 114,
        Int115_IRQn = 115,
        Int116_IRQn = 116,
        Int117_IRQn = 117,
        Int118_IRQn = 118,
        Int119_IRQn = 119,
        Int120_IRQn = 120,
        Int121_IRQn = 121,
        Int122_IRQn = 122,
        Int123_IRQn = 123,
        Int124_IRQn = 124,
        Int125_IRQn = 125,
        Int126_IRQn = 126,
        Int127_IRQn = 127,
        Int128_IRQn = 128,
        Int129_IRQn = 129,
        Int130_IRQn = 130,
        Int131_IRQn = 131,
        Int132_IRQn = 132,
        Int133_IRQn = 133,
        Int134_IRQn = 134,
        Int135_IRQn = 135,
        Int136_IRQn = 136,
        Int137_IRQn = 137,
        Int138_IRQn = 138,
        Int139_IRQn = 139,
        Int140_IRQn = 140,
        Int141_IRQn = 141,
        Int142_IRQn = 142,
        Int143_IRQn = 143,

    } IRQn_Type;

#include <core_cm4.h>
#include <stdint.h>

    /**
     *******************************************************************************
     ** \brief Event number enumeration
     ******************************************************************************/
    typedef enum en_event_src
    {
        EVT_SWI_IRQ0 = 0u,
        EVT_SWI_IRQ1 = 1u,
        EVT_SWI_IRQ2 = 2u,
        EVT_SWI_IRQ3 = 3u,
        EVT_SWI_IRQ4 = 4u,
        EVT_SWI_IRQ5 = 5u,
        EVT_SWI_IRQ6 = 6u,
        EVT_SWI_IRQ7 = 7u,
        EVT_SWI_IRQ8 = 8u,
        EVT_SWI_IRQ9 = 9u,
        EVT_SWI_IRQ10 = 10u,
        EVT_SWI_IRQ11 = 11u,
        EVT_SWI_IRQ12 = 12u,
        EVT_SWI_IRQ13 = 13u,
        EVT_SWI_IRQ14 = 14u,
        EVT_SWI_IRQ15 = 15u,
        EVT_SWI_IRQ16 = 16u,
        EVT_SWI_IRQ17 = 17u,
        EVT_SWI_IRQ18 = 18u,
        EVT_SWI_IRQ19 = 19u,
        EVT_SWI_IRQ20 = 20u,
        EVT_SWI_IRQ21 = 21u,
        EVT_SWI_IRQ22 = 22u,
        EVT_SWI_IRQ23 = 23u,
        EVT_SWI_IRQ24 = 24u,
        EVT_SWI_IRQ25 = 25u,
        EVT_SWI_IRQ26 = 26u,
        EVT_SWI_IRQ27 = 27u,
        EVT_SWI_IRQ28 = 28u,
        EVT_SWI_IRQ29 = 29u,
        EVT_SWI_IRQ30 = 30u,
        EVT_SWI_IRQ31 = 31u,

        /* External Interrupt. */
        EVT_PORT_EIRQ0 = 0u,
        EVT_PORT_EIRQ1 = 1u,
        EVT_PORT_EIRQ2 = 2u,
        EVT_PORT_EIRQ3 = 3u,
        EVT_PORT_EIRQ4 = 4u,
        EVT_PORT_EIRQ5 = 5u,
        EVT_PORT_EIRQ6 = 6u,
        EVT_PORT_EIRQ7 = 7u,
        EVT_PORT_EIRQ8 = 8u,
        EVT_PORT_EIRQ9 = 9u,
        EVT_PORT_EIRQ10 = 10u,
        EVT_PORT_EIRQ11 = 11u,
        EVT_PORT_EIRQ12 = 12u,
        EVT_PORT_EIRQ13 = 13u,
        EVT_PORT_EIRQ14 = 14u,
        EVT_PORT_EIRQ15 = 15u,

        /* DMAC */
        EVT_DMA1_TC0 = 32u,
        EVT_DMA1_TC1 = 33u,
        EVT_DMA1_TC2 = 34u,
        EVT_DMA1_TC3 = 35u,
        EVT_DMA2_TC0 = 36u,
        EVT_DMA2_TC1 = 37u,
        EVT_DMA2_TC2 = 38u,
        EVT_DMA2_TC3 = 39u,
        EVT_DMA1_BTC0 = 40u,
        EVT_DMA1_BTC1 = 41u,
        EVT_DMA1_BTC2 = 42u,
        EVT_DMA1_BTC3 = 43u,
        EVT_DMA2_BTC0 = 44u,
        EVT_DMA2_BTC1 = 45u,
        EVT_DMA2_BTC2 = 46u,
        EVT_DMA2_BTC3 = 47u,

        /* EFM */
        EVT_EFM_OPTEND = 52u,

        /* USB SOF */
        EVT_USBFS_SOF = 53u,

