MarlinFirmware/Marlin/Marlin/lib/h32_core/main/hdsc32core/common/hc32f46x.h
        /* DCU */
        INT_DCU1 = 55u,
        INT_DCU2 = 56u,
        INT_DCU3 = 57u,
        INT_DCU4 = 58u,

        /* TIMER 0 */
        INT_TMR01_GCMA = 64u,
        INT_TMR01_GCMB = 65u,
        INT_TMR02_GCMA = 66u,
        INT_TMR02_GCMB = 67u,

        /* RTC */
        INT_RTC_ALM = 81u,
        INT_RTC_PRD = 82u,

        /* XTAL32 stop */
        INT_XTAL32_STOP = 84u,

        /* XTAL stop */
        INT_XTAL_STOP = 85u,

        /* wake-up timer */
        INT_WKTM_PRD = 86u,

        /* SWDT */
        INT_SWDT_REFUDF = 87u,

        /* TIMER 6 */
        INT_TMR61_GCMA = 96u,
        INT_TMR61_GCMB = 97u,
        INT_TMR61_GCMC = 98u,
        INT_TMR61_GCMD = 99u,
        INT_TMR61_GCME = 100u,
        INT_TMR61_GCMF = 101u,
        INT_TMR61_GOVF = 102u,
        INT_TMR61_GUDF = 103u,
        INT_TMR61_GDTE = 104u,
        INT_TMR61_SCMA = 107u,
        INT_TMR61_SCMB = 108u,
        INT_TMR62_GCMA = 112u,
        INT_TMR62_GCMB = 113u,
        INT_TMR62_GCMC = 114u,
        INT_TMR62_GCMD = 115u,
        INT_TMR62_GCME = 116u,
        INT_TMR62_GCMF = 117u,
        INT_TMR62_GOVF = 118u,
        INT_TMR62_GUDF = 119u,
        INT_TMR62_GDTE = 120u,
        INT_TMR62_SCMA = 123u,
        INT_TMR62_SCMB = 124u,
        INT_TMR63_GCMA = 128u,
        INT_TMR63_GCMB = 129u,
        INT_TMR63_GCMC = 130u,
        INT_TMR63_GCMD = 131u,
        INT_TMR63_GCME = 132u,
        INT_TMR63_GCMF = 133u,
        INT_TMR63_GOVF = 134u,
        INT_TMR63_GUDF = 135u,
        INT_TMR63_GDTE = 136u,
        INT_TMR63_SCMA = 139u,
        INT_TMR63_SCMB = 140u,

        /* TIMER A */
        INT_TMRA1_OVF = 256u,
        INT_TMRA1_UDF = 257u,
        INT_TMRA1_CMP = 258u,
        INT_TMRA2_OVF = 259u,
        INT_TMRA2_UDF = 260u,
        INT_TMRA2_CMP = 261u,
        INT_TMRA3_OVF = 262u,
        INT_TMRA3_UDF = 263u,
        INT_TMRA3_CMP = 264u,
        INT_TMRA4_OVF = 265u,
        INT_TMRA4_UDF = 266u,
        INT_TMRA4_CMP = 267u,
        INT_TMRA5_OVF = 268u,
        INT_TMRA5_UDF = 269u,
        INT_TMRA5_CMP = 270u,
        INT_TMRA6_OVF = 272u,
        INT_TMRA6_UDF = 273u,
        INT_TMRA6_CMP = 274u,

        /* USB FS */
        INT_USBFS_GLB = 275u,

        /* USRAT */
        INT_USART1_EI = 278u,
        INT_USART1_RI = 279u,
        INT_USART1_TI = 280u,
        INT_USART1_TCI = 281u,
        INT_USART1_RTO = 282u,
        INT_USART1_WUPI = 432u,
        INT_USART2_EI = 283u,
        INT_USART2_RI = 284u,
        INT_USART2_TI = 285u,
        INT_USART2_TCI = 286u,
        INT_USART2_RTO = 287u,
        INT_USART3_EI = 288u,
        INT_USART3_RI = 289u,
        INT_USART3_TI = 290u,
        INT_USART3_TCI = 291u,
        INT_USART3_RTO = 292u,
        INT_USART4_EI = 293u,
        INT_USART4_RI = 294u,
        INT_USART4_TI = 295u,
        INT_USART4_TCI = 296u,
        INT_USART4_RTO = 297u,

        /* SPI */
        INT_SPI1_SRRI = 299u,
        INT_SPI1_SRTI = 300u,
        INT_SPI1_SPII = 301u,
        INT_SPI1_SPEI = 302u,
        INT_SPI2_SRRI = 304u,
        INT_SPI2_SRTI = 305u,
        INT_SPI2_SPII = 306u,
        INT_SPI2_SPEI = 307u,
        INT_SPI3_SRRI = 309u,
        INT_SPI3_SRTI = 310u,
        INT_SPI3_SPII = 311u,
        INT_SPI3_SPEI = 312u,
        INT_SPI4_SRRI = 314u,
        INT_SPI4_SRTI = 315u,
        INT_SPI4_SPII = 316u,
        INT_SPI4_SPEI = 317u,

        /* TIMER 4 */
        INT_TMR41_GCMUH = 320u,
        INT_TMR41_GCMUL = 321u,
        INT_TMR41_GCMVH = 322u,
        INT_TMR41_GCMVL = 323u,
        INT_TMR41_GCMWH = 324u,
        INT_TMR41_GCMWL = 325u,
        INT_TMR41_GOVF = 326u,
        INT_TMR41_GUDF = 327u,
        INT_TMR41_RLOU = 328u,
        INT_TMR41_RLOV = 329u,
        INT_TMR41_RLOW = 330u,
        INT_TMR42_GCMUH = 336u,
        INT_TMR42_GCMUL = 337u,
        INT_TMR42_GCMVH = 338u,
        INT_TMR42_GCMVL = 339u,
        INT_TMR42_GCMWH = 340u,
        INT_TMR42_GCMWL = 341u,
        INT_TMR42_GOVF = 342u,
        INT_TMR42_GUDF = 343u,
        INT_TMR42_RLOU = 344u,
        INT_TMR42_RLOV = 345u,
        INT_TMR42_RLOW = 346u,
        INT_TMR43_GCMUH = 352u,
        INT_TMR43_GCMUL = 353u,
        INT_TMR43_GCMVH = 354u,
        INT_TMR43_GCMVL = 355u,
        INT_TMR43_GCMWH = 356u,
        INT_TMR43_GCMWL = 357u,
        INT_TMR43_GOVF = 358u,
        INT_TMR43_GUDF = 359u,
        INT_TMR43_RLOU = 360u,
        INT_TMR43_RLOV = 361u,
        INT_TMR43_RLOW = 362u,

        /* EMB */
        INT_EMB_GR0 = 390u,
        INT_EMB_GR1 = 391u,
        INT_EMB_GR2 = 392u,
        INT_EMB_GR3 = 393u,

        /* EVENT PORT */
        INT_EVENT_PORT1 = 394u,
        INT_EVENT_PORT2 = 395u,
        INT_EVENT_PORT3 = 396u,
        INT_EVENT_PORT4 = 397u,

        /* I2S */
        INT_I2S1_TXIRQOUT = 400u,
        INT_I2S1_RXIRQOUT = 401u,
        INT_I2S1_ERRIRQOUT = 402u,
        INT_I2S2_TXIRQOUT = 403u,
        INT_I2S2_RXIRQOUT = 404u,
        INT_I2S2_ERRIRQOUT = 405u,
        INT_I2S3_TXIRQOUT = 406u,
        INT_I2S3_RXIRQOUT = 407u,
        INT_I2S3_ERRIRQOUT = 408u,
        INT_I2S4_TXIRQOUT = 409u,
        INT_I2S4_RXIRQOUT = 410u,
        INT_I2S4_ERRIRQOUT = 411u,

        /* COMPARATOR */
        INT_ACMP1 = 416u,
        INT_ACMP2 = 417u,
        INT_ACMP3 = 418u,

        /* I2C */
        INT_I2C1_RXI = 420u,
        INT_I2C1_TXI = 421u,
        INT_I2C1_TEI = 422u,
        INT_I2C1_EE1 = 423u,
        INT_I2C2_RXI = 424u,
        INT_I2C2_TXI = 425u,
        INT_I2C2_TEI = 426u,
        INT_I2C2_EE1 = 427u,
        INT_I2C3_RXI = 428u,
        INT_I2C3_TXI = 429u,
        INT_I2C3_TEI = 430u,
        INT_I2C3_EE1 = 431u,

        /* PVD */
        INT_PVD_PVD1 = 433u,
        INT_PVD_PVD2 = 434u,

        /* Temp. sensor */
        INT_OTS = 435u,

        /* FCM */
        INT_FCMFERRI = 436u,
        INT_FCMMENDI = 437u,
        INT_FCMCOVFI = 438u,

        /* WDT */
        INT_WDT_REFUDF = 439u,

        /* ADC */
        INT_ADC1_EOCA = 448u,
        INT_ADC1_EOCB = 449u,
        INT_ADC1_CHCMP = 450u,
        INT_ADC1_SEQCMP = 451u,
        INT_ADC2_EOCA = 452u,
        INT_ADC2_EOCB = 453u,
        INT_ADC2_CHCMP = 454u,
        INT_ADC2_SEQCMP = 455u,

        /* TRNG */
        INT_TRNG_END = 456u,

        /* SDIOC */
        INT_SDIOC1_SD = 482u,
        INT_SDIOC2_SD = 485u,

        /* CAN */
        INT_CAN_INT = 486u,

        INT_MAX = 511u,
    } en_int_src_t;

    /******************************************************************************/
    /*                Device Specific Peripheral Registers structures             */
    /******************************************************************************/

#if defined(__CC_ARM)
#pragma anon_unions
#endif

    typedef struct
    {
        __IO uint8_t STRT : 1;
        uint8_t RESERVED1 : 7;
    } stc_adc_str_field_t;

    typedef struct
    {
        __IO uint16_t MS : 2;
        uint16_t RESERVED2 : 2;
        __IO uint16_t ACCSEL : 2;
        __IO uint16_t CLREN : 1;
        __IO uint16_t DFMT : 1;
        __IO uint16_t AVCNT : 3;
        uint16_t RESERVED11 : 5;
    } stc_adc_cr0_field_t;

    typedef struct
    {
        uint16_t RESERVED0 : 2;
        __IO uint16_t RSCHSEL : 1;
        uint16_t RESERVED3 : 13;
    } stc_adc_cr1_field_t;

    typedef struct
    {
        __IO uint16_t TRGSELA : 3;
        uint16_t RESERVED3 : 4;
        __IO uint16_t TRGENA : 1;
        __IO uint16_t TRGSELB : 3;
        uint16_t RESERVED11 : 4;
        __IO uint16_t TRGENB : 1;
    } stc_adc_trgsr_field_t;

    typedef struct
    {
        __IO uint16_t CHSELA16 : 1;
        uint16_t RESERVED1 : 15;
    } stc_adc_chselra1_field_t;

    typedef struct
    {
        __IO uint16_t CHSELB16 : 1;
        uint16_t RESERVED1 : 15;
    } stc_adc_chselrb1_field_t;

    typedef struct
    {
        __IO uint16_t AVCHSEL16 : 1;
        uint16_t RESERVED1 : 15;
    } stc_adc_avchselr1_field_t;

    typedef struct
    {
        __IO uint16_t CH00MUX : 4;
        __IO uint16_t CH01MUX : 4;
        __IO uint16_t CH02MUX : 4;
        __IO uint16_t CH03MUX : 4;
    } stc_adc_chmuxr0_field_t;

    typedef struct
    {
        __IO uint16_t CH04MUX : 4;
        __IO uint16_t CH05MUX : 4;
        __IO uint16_t CH06MUX : 4;
        __IO uint16_t CH07MUX : 4;
    } stc_adc_chmuxr1_field_t;

    typedef struct
    {
        __IO uint16_t CH08MUX : 4;
        __IO uint16_t CH09MUX : 4;
        __IO uint16_t CH10MUX : 4;
        __IO uint16_t CH11MUX : 4;
    } stc_adc_chmuxr2_field_t;

    typedef struct
    {
        __IO uint16_t CH12MUX : 4;
        __IO uint16_t CH13MUX : 4;
        __IO uint16_t CH14MUX : 4;
        __IO uint16_t CH15MUX : 4;
    } stc_adc_chmuxr3_field_t;

    typedef struct
    {
        __IO uint8_t EOCAF : 1;
        __IO uint8_t EOCBF : 1;
        uint8_t RESERVED2 : 6;
    } stc_adc_isr_field_t;

    typedef struct
    {
        __IO uint8_t EOCAIEN : 1;
        __IO uint8_t EOCBIEN : 1;
        uint8_t RESERVED2 : 6;
    } stc_adc_icr_field_t;

    typedef struct
    {
        __IO uint16_t SYNCEN : 1;
        uint16_t RESERVED1 : 3;
        __IO uint16_t SYNCMD : 3;
        uint16_t RESERVED7 : 1;
        __IO uint16_t SYNCDLY : 8;
    } stc_adc_synccr_field_t;

    typedef struct
    {
        __IO uint16_t AWDEN : 1;
        uint16_t RESERVED1 : 3;
        __IO uint16_t AWDMD : 1;
        uint16_t RESERVED5 : 1;
        __IO uint16_t AWDSS : 2;
        __IO uint16_t AWDIEN : 1;
        uint16_t RESERVED9 : 7;
    } stc_adc_awdcr_field_t;

    typedef struct
    {
        __IO uint16_t AWDCH16 : 1;
        uint16_t RESERVED1 : 15;
    } stc_adc_awdchsr1_field_t;

    typedef struct
    {
        __IO uint16_t AWDF16 : 1;
        uint16_t RESERVED1 : 15;
    } stc_adc_awdsr1_field_t;

    typedef struct
    {
        __IO uint16_t PGACTL : 4;
        uint16_t RESERVED4 : 12;
    } stc_adc_pgacr_field_t;

    typedef struct
    {
        __IO uint16_t GAIN : 4;
        uint16_t RESERVED4 : 12;
    } stc_adc_pgagsr_field_t;

    typedef struct
    {
        __IO uint16_t PGAINSEL : 9;
        uint16_t RESERVED9 : 7;
    } stc_adc_pgainsr0_field_t;

    typedef struct
    {
        __IO uint16_t PGAVSSEN : 1;
        uint16_t RESERVED1 : 15;
    } stc_adc_pgainsr1_field_t;

    typedef struct
    {
        __IO uint32_t START : 1;
        __IO uint32_t MODE : 1;
        uint32_t RESERVED2 : 30;
    } stc_aes_cr_field_t;

    typedef struct
    {
        __IO uint32_t STRG : 1;
        uint32_t RESERVED1 : 31;
    } stc_aos_int_sfttrg_field_t;

    typedef struct
    {
        __IO uint32_t TRGSEL : 9;
        uint32_t RESERVED9 : 23;
    } stc_aos_dcu1_trgsel_field_t;

    typedef struct
    {
        __IO uint32_t TRGSEL : 9;
        uint32_t RESERVED9 : 23;
    } stc_aos_dcu2_trgsel_field_t;

    typedef struct
    {
        __IO uint32_t TRGSEL : 9;
        uint32_t RESERVED9 : 23;
    } stc_aos_dcu3_trgsel_field_t;

    typedef struct
    {
        __IO uint32_t TRGSEL : 9;
        uint32_t RESERVED9 : 23;
    } stc_aos_dcu4_trgsel_field_t;

    typedef struct
    {
        __IO uint32_t TRGSEL : 9;
        uint32_t RESERVED9 : 23;
    } stc_aos_dma1_trgsel0_field_t;

    typedef struct
    {
        __IO uint32_t TRGSEL : 9;
        uint32_t RESERVED9 : 23;
    } stc_aos_dma1_trgsel1_field_t;

    typedef struct
    {
        __IO uint32_t TRGSEL : 9;
        uint32_t RESERVED9 : 23;
    } stc_aos_dma1_trgsel2_field_t;

    typedef struct
    {
        __IO uint32_t TRGSEL : 9;
        uint32_t RESERVED9 : 23;
    } stc_aos_dma1_trgsel3_field_t;

    typedef struct
    {
        __IO uint32_t TRGSEL : 9;
        uint32_t RESERVED9 : 23;
    } stc_aos_dma2_trgsel0_field_t;

    typedef struct
    {
        __IO uint32_t TRGSEL : 9;
        uint32_t RESERVED9 : 23;
    } stc_aos_dma2_trgsel1_field_t;

    typedef struct
    {
        __IO uint32_t TRGSEL : 9;
        uint32_t RESERVED9 : 23;
    } stc_aos_dma2_trgsel2_field_t;

    typedef struct
    {
        __IO uint32_t TRGSEL : 9;
        uint32_t RESERVED9 : 23;
    } stc_aos_dma2_trgsel3_field_t;

    typedef struct
    {
        __IO uint32_t TRGSEL : 9;
        uint32_t RESERVED9 : 23;
    } stc_aos_dmatrgselrc_field_t;

    typedef struct
    {
        __IO uint32_t TRGSEL : 9;
        uint32_t RESERVED9 : 23;
    } stc_aos_tmr6_htssr1_field_t;

    typedef struct
    {
        __IO uint32_t TRGSEL : 9;
        uint32_t RESERVED9 : 23;
    } stc_aos_tmr6_htssr2_field_t;

    typedef struct
    {
        __IO uint32_t TRGSEL : 9;
        uint32_t RESERVED9 : 23;
    } stc_aos_tmr0_htssr_field_t;

    typedef struct
    {
        __IO uint32_t TRGSEL : 9;
        uint32_t RESERVED9 : 23;
    } stc_aos_port_pevnttrgsr12_field_t;

    typedef struct
    {
        __IO uint32_t TRGSEL : 9;
        uint32_t RESERVED9 : 23;
    } stc_aos_port_pevnttrgsr34_field_t;

    typedef struct
    {
        __IO uint32_t TRGSEL : 9;
        uint32_t RESERVED9 : 23;
    } stc_aos_tmra_htssr0_field_t;

    typedef struct
    {
        __IO uint32_t TRGSEL : 9;
        uint32_t RESERVED9 : 23;
    } stc_aos_tmra_htssr1_field_t;

    typedef struct
    {
        __IO uint32_t TRGSEL : 9;
        uint32_t RESERVED9 : 23;
    } stc_aos_ots_trg_field_t;

    typedef struct
    {
        __IO uint32_t TRGSEL : 9;
        uint32_t RESERVED9 : 23;
    } stc_aos_adc1_itrgselr0_field_t;

    typedef struct
    {
        __IO uint32_t TRGSEL : 9;
        uint32_t RESERVED9 : 23;
    } stc_aos_adc1_itrgselr1_field_t;

    typedef struct
    {
        __IO uint32_t TRGSEL : 9;
        uint32_t RESERVED9 : 23;
    } stc_aos_adc2_itrgselr0_field_t;

    typedef struct
    {
        __IO uint32_t TRGSEL : 9;
        uint32_t RESERVED9 : 23;
    } stc_aos_adc2_itrgselr1_field_t;

    typedef struct
    {
        __IO uint32_t TRGSEL : 9;
        uint32_t RESERVED9 : 21;
        __IO uint32_t COMTRG_EN : 2;
    } stc_aos_comtrg1_field_t;

    typedef struct
    {
        __IO uint32_t TRGSEL : 9;
        uint32_t RESERVED9 : 21;
        __IO uint32_t COMTRG_EN : 2;
    } stc_aos_comtrg2_field_t;

    typedef struct
    {
        __IO uint32_t PDIR00 : 1;
        __IO uint32_t PDIR01 : 1;
        __IO uint32_t PDIR02 : 1;
        __IO uint32_t PDIR03 : 1;
        __IO uint32_t PDIR04 : 1;
        __IO uint32_t PDIR05 : 1;
        __IO uint32_t PDIR06 : 1;
        __IO uint32_t PDIR07 : 1;
        __IO uint32_t PDIR08 : 1;
        __IO uint32_t PDIR09 : 1;
        __IO uint32_t PDIR10 : 1;
        __IO uint32_t PDIR11 : 1;
        __IO uint32_t PDIR12 : 1;
        __IO uint32_t PDIR13 : 1;
        __IO uint32_t PDIR14 : 1;
        __IO uint32_t PDIR15 : 1;
        uint32_t RESERVED16 : 16;
    } stc_aos_pevntdirr_field_t;

    typedef struct
    {
        __IO uint32_t PIN00 : 1;
        __IO uint32_t PIN01 : 1;
        __IO uint32_t PIN02 : 1;
        __IO uint32_t PIN03 : 1;
        __IO uint32_t PIN04 : 1;
        __IO uint32_t PIN05 : 1;
        __IO uint32_t PIN06 : 1;
        __IO uint32_t PIN07 : 1;
        __IO uint32_t PIN08 : 1;
        __IO uint32_t PIN09 : 1;
        __IO uint32_t PIN10 : 1;
        __IO uint32_t PIN11 : 1;
        __IO uint32_t PIN12 : 1;
        __IO uint32_t PIN13 : 1;
        __IO uint32_t PIN14 : 1;
        __IO uint32_t PIN15 : 1;
        uint32_t RESERVED16 : 16;
    } stc_aos_pevntidr_field_t;

    typedef struct
    {
        __IO uint32_t POUT00 : 1;
        __IO uint32_t POUT01 : 1;
        __IO uint32_t POUT02 : 1;
        __IO uint32_t POUT03 : 1;
        __IO uint32_t POUT04 : 1;
        __IO uint32_t POUT05 : 1;
        __IO uint32_t POUT06 : 1;
        __IO uint32_t POUT07 : 1;
        __IO uint32_t POUT08 : 1;
        __IO uint32_t POUT09 : 1;
        __IO uint32_t POUT10 : 1;
        __IO uint32_t POUT11 : 1;
        __IO uint32_t POUT12 : 1;
        __IO uint32_t POUT13 : 1;
        __IO uint32_t POUT14 : 1;
        __IO uint32_t POUT15 : 1;
        uint32_t RESERVED16 : 16;
    } stc_aos_pevntodr_field_t;

    typedef struct
    {
        __IO uint32_t POR00 : 1;
        __IO uint32_t POR01 : 1;
        __IO uint32_t POR02 : 1;
        __IO uint32_t POR03 : 1;
        __IO uint32_t POR04 : 1;
        __IO uint32_t POR05 : 1;
        __IO uint32_t POR06 : 1;
        __IO uint32_t POR07 : 1;
        __IO uint32_t POR08 : 1;
        __IO uint32_t POR09 : 1;
        __IO uint32_t POR10 : 1;
        __IO uint32_t POR11 : 1;
        __IO uint32_t POR12 : 1;
        __IO uint32_t POR13 : 1;
        __IO uint32_t POR14 : 1;
        __IO uint32_t POR15 : 1;
        uint32_t RESERVED16 : 16;
    } stc_aos_pevntorr_field_t;

    typedef struct
    {
        __IO uint32_t POS00 : 1;
        __IO uint32_t POS01 : 1;
        __IO uint32_t POS02 : 1;
        __IO uint32_t POS03 : 1;
        __IO uint32_t POS04 : 1;
        __IO uint32_t POS05 : 1;
        __IO uint32_t POS06 : 1;
        __IO uint32_t POS07 : 1;
        __IO uint32_t POS08 : 1;
        __IO uint32_t POS09 : 1;
        __IO uint32_t POS10 : 1;
        __IO uint32_t POS11 : 1;
        __IO uint32_t POS12 : 1;
        __IO uint32_t POS13 : 1;
        __IO uint32_t POS14 : 1;
        __IO uint32_t POS15 : 1;
        uint32_t RESERVED16 : 16;
    } stc_aos_pevntosr_field_t;

    typedef struct
    {
        __IO uint32_t RIS00 : 1;
        __IO uint32_t RIS01 : 1;
        __IO uint32_t RIS02 : 1;
        __IO uint32_t RIS03 : 1;
        __IO uint32_t RIS04 : 1;
        __IO uint32_t RIS05 : 1;
        __IO uint32_t RIS06 : 1;
        __IO uint32_t RIS07 : 1;
        __IO uint32_t RIS08 : 1;
        __IO uint32_t RIS09 : 1;
        __IO uint32_t RIS10 : 1;
        __IO uint32_t RIS11 : 1;
        __IO uint32_t RIS12 : 1;
        __IO uint32_t RIS13 : 1;
        __IO uint32_t RIS14 : 1;
        __IO uint32_t RIS15 : 1;
        uint32_t RESERVED16 : 16;
    } stc_aos_pevntrisr_field_t;

    typedef struct
    {
        __IO uint32_t FAL00 : 1;
        __IO uint32_t FAL01 : 1;
        __IO uint32_t FAL02 : 1;
        __IO uint32_t FAL03 : 1;
        __IO uint32_t FAL04 : 1;
        __IO uint32_t FAL05 : 1;
        __IO uint32_t FAL06 : 1;
        __IO uint32_t FAL07 : 1;
        __IO uint32_t FAL08 : 1;
        __IO uint32_t FAL09 : 1;
        __IO uint32_t FAL10 : 1;
        __IO uint32_t FAL11 : 1;
        __IO uint32_t FAL12 : 1;
        __IO uint32_t FAL13 : 1;
        __IO uint32_t FAL14 : 1;
        __IO uint32_t FAL15 : 1;
        uint32_t RESERVED16 : 16;
    } stc_aos_pevntfal_field_t;

    typedef struct
    {
        __IO uint32_t NFEN1 : 1;
        __IO uint32_t DIVS1 : 2;
        uint32_t RESERVED3 : 5;
        __IO uint32_t NFEN2 : 1;
        __IO uint32_t DIVS2 : 2;
        uint32_t RESERVED11 : 5;
        __IO uint32_t NFEN3 : 1;
        __IO uint32_t DIVS3 : 2;
        uint32_t RESERVED19 : 5;
        __IO uint32_t NFEN4 : 1;
        __IO uint32_t DIVS4 : 2;
        uint32_t RESERVED27 : 5;
    } stc_aos_pevntnfcr_field_t;

    typedef struct
    {
        __IO uint8_t BUSOFF : 1;
        __IO uint8_t TACTIVE : 1;
        __IO uint8_t RACTIVE : 1;
        __IO uint8_t TSSS : 1;
        __IO uint8_t TPSS : 1;
        __IO uint8_t LBMI : 1;
        __IO uint8_t LBME : 1;
        __IO uint8_t RESET : 1;
    } stc_can_cfg_stat_field_t;

    typedef struct
    {
        __IO uint8_t TSA : 1;
        __IO uint8_t TSALL : 1;
        __IO uint8_t TSONE : 1;
        __IO uint8_t TPA : 1;
        __IO uint8_t TPE : 1;
        __IO uint8_t STBY : 1;
        __IO uint8_t LOM : 1;
        __IO uint8_t TBSEL : 1;
    } stc_can_tcmd_field_t;

    typedef struct
    {
        __IO uint8_t TSSTAT : 2;
        uint8_t RESERVED2 : 2;
        __IO uint8_t TTBM : 1;
        __IO uint8_t TSMODE : 1;
        __IO uint8_t TSNEXT : 1;
        uint8_t RESERVED7 : 1;
    } stc_can_tctrl_field_t;

    typedef struct
    {
        __IO uint8_t RSSTAT : 2;
        uint8_t RESERVED2 : 1;
        __IO uint8_t RBALL : 1;
        __IO uint8_t RREL : 1;
        __IO uint8_t ROV : 1;
        __IO uint8_t ROM : 1;
        __IO uint8_t SACK : 1;
    } stc_can_rctrl_field_t;

    typedef struct
    {
        __IO uint8_t TSFF : 1;
        __IO uint8_t EIE : 1;
        __IO uint8_t TSIE : 1;
        __IO uint8_t TPIE : 1;
        __IO uint8_t RAFIE : 1;
        __IO uint8_t RFIE : 1;
        __IO uint8_t ROIE : 1;
        __IO uint8_t RIE : 1;
    } stc_can_rtie_field_t;

    typedef struct
    {
        __IO uint8_t AIF : 1;
        __IO uint8_t EIF : 1;
        __IO uint8_t TSIF : 1;
        __IO uint8_t TPIF : 1;
        __IO uint8_t RAFIF : 1;
        __IO uint8_t RFIF : 1;
        __IO uint8_t ROIF : 1;
        __IO uint8_t RIF : 1;
    } stc_can_rtif_field_t;

    typedef struct
    {
        __IO uint8_t BEIF : 1;
        __IO uint8_t BEIE : 1;
        __IO uint8_t ALIF : 1;
        __IO uint8_t ALIE : 1;
        __IO uint8_t EPIF : 1;
        __IO uint8_t EPIE : 1;
        __IO uint8_t EPASS : 1;
        __IO uint8_t EWARN : 1;
    } stc_can_errint_field_t;

    typedef struct
    {
        __IO uint8_t EWL : 4;
        __IO uint8_t AFWL : 4;
    } stc_can_limit_field_t;

    typedef struct
    {
        __IO uint32_t SEG_1 : 8;
        __IO uint32_t SEG_2 : 7;
        uint32_t RESERVED15 : 1;
        __IO uint32_t SJW : 7;
        uint32_t RESERVED23 : 1;
        __IO uint32_t PRESC : 8;
    } stc_can_bt_field_t;

    typedef struct
    {
        __IO uint8_t ALC : 5;
        __IO uint8_t KOER : 3;
    } stc_can_ealcap_field_t;

    typedef struct
    {
        __IO uint8_t ACFADR : 4;
        uint8_t RESERVED4 : 1;
        __IO uint8_t SELMASK : 1;
        uint8_t RESERVED6 : 2;
    } stc_can_acfctrl_field_t;

    typedef struct
    {
        __IO uint8_t AE_1 : 1;
        __IO uint8_t AE_2 : 1;
        __IO uint8_t AE_3 : 1;
        __IO uint8_t AE_4 : 1;
        __IO uint8_t AE_5 : 1;
        __IO uint8_t AE_6 : 1;
        __IO uint8_t AE_7 : 1;
        __IO uint8_t AE_8 : 1;
    } stc_can_acfen_field_t;

    typedef struct
    {
        __IO uint32_t ACODEORAMASK : 29;
        __IO uint32_t AIDE : 1;
        __IO uint32_t AIDEE : 1;
        uint32_t RESERVED31 : 1;
    } stc_can_acf_field_t;

    typedef struct
    {
        __IO uint8_t TBPTR : 6;
        __IO uint8_t TBF : 1;
        __IO uint8_t TBE : 1;
    } stc_can_tbslot_field_t;

    typedef struct
    {
        __IO uint8_t TTEN : 1;
        __IO uint8_t T_PRESC : 2;
        __IO uint8_t TTIF : 1;
        __IO uint8_t TTIE : 1;
        __IO uint8_t TEIF : 1;
        __IO uint8_t WTIF : 1;
        __IO uint8_t WTIE : 1;
    } stc_can_ttcfg_field_t;

    typedef struct
    {
        __IO uint32_t REF_ID : 29;
        uint32_t RESERVED29 : 2;
        __IO uint32_t REF_IDE : 1;
    } stc_can_ref_msg_field_t;

    typedef struct
    {
        __IO uint16_t TTPTR : 6;
        uint16_t RESERVED6 : 2;
        __IO uint16_t TTYPE : 3;
        uint16_t RESERVED11 : 1;
        __IO uint16_t TEW : 4;
    } stc_can_trg_cfg_field_t;

    typedef struct
    {
        __IO uint16_t FLTSL : 3;
        uint16_t RESERVED3 : 2;
        __IO uint16_t EDGSL : 2;
        __IO uint16_t IEN : 1;
        __IO uint16_t CVSEN : 1;
        uint16_t RESERVED9 : 3;
        __IO uint16_t OUTEN : 1;
        __IO uint16_t INV : 1;
        __IO uint16_t CMPOE : 1;
        __IO uint16_t CMPON : 1;
    } stc_cmp_ctrl_field_t;

    typedef struct
    {
        __IO uint16_t RVSL : 4;
        uint16_t RESERVED4 : 4;
        __IO uint16_t CVSL : 4;
        __IO uint16_t C4SL : 3;
        uint16_t RESERVED15 : 1;
    } stc_cmp_vltsel_field_t;

    typedef struct
    {
        __IO uint16_t OMON : 1;
        uint16_t RESERVED1 : 7;
        __IO uint16_t CVST : 4;
        uint16_t RESERVED12 : 4;
    } stc_cmp_mon_field_t;

    typedef struct
    {
        __IO uint16_t STB : 4;
        uint16_t RESERVED4 : 12;
    } stc_cmp_cvsstb_field_t;

    typedef struct
    {
        __IO uint16_t PRD : 8;
        uint16_t RESERVED8 : 8;
    } stc_cmp_cvsprd_field_t;

