MarlinFirmware/Marlin/Marlin/lib/h32_core/main/hdsc32core/common/hc32f46x.h
    typedef struct
    {
        __IO uint32_t NMICFR : 1;
        __IO uint32_t SWDTCFR : 1;
        __IO uint32_t PVD1CFR : 1;
        __IO uint32_t PVD2CFR : 1;
        __IO uint32_t XTAL32STPCFR : 1;
        __IO uint32_t XTALSTPCFR : 1;
        uint32_t RESERVED6 : 2;
        __IO uint32_t REPCFR : 1;
        __IO uint32_t RECCCFR : 1;
        __IO uint32_t BUSMCFR : 1;
        __IO uint32_t WDTCFR : 1;
        uint32_t RESERVED12 : 20;
    } stc_intc_nmicfr_field_t;

    typedef struct
    {
        __IO uint32_t EIRQTRG : 2;
        uint32_t RESERVED2 : 2;
        __IO uint32_t EISMPCLK : 2;
        uint32_t RESERVED6 : 1;
        __IO uint32_t EFEN : 1;
        uint32_t RESERVED8 : 24;
    } stc_intc_eirqcr_field_t;

    typedef struct
    {
        __IO uint32_t EIRQWUEN : 16;
        __IO uint32_t SWDTWUEN : 1;
        __IO uint32_t PVD1WUEN : 1;
        __IO uint32_t PVD2WUEN : 1;
        __IO uint32_t CMPI0WUEN : 1;
        __IO uint32_t WKTMWUEN : 1;
        __IO uint32_t RTCALMWUEN : 1;
        __IO uint32_t RTCPRDWUEN : 1;
        __IO uint32_t TMR0WUEN : 1;
        uint32_t RESERVED24 : 1;
        __IO uint32_t SCIWEN : 1;
        uint32_t RESERVED26 : 6;
    } stc_intc_wupen_field_t;

    typedef struct
    {
        __IO uint32_t EIFR0 : 1;
        __IO uint32_t EIFR1 : 1;
        __IO uint32_t EIFR2 : 1;
        __IO uint32_t EIFR3 : 1;
        __IO uint32_t EIFR4 : 1;
        __IO uint32_t EIFR5 : 1;
        __IO uint32_t EIFR6 : 1;
        __IO uint32_t EIFR7 : 1;
        __IO uint32_t EIFR8 : 1;
        __IO uint32_t EIFR9 : 1;
        __IO uint32_t EIFR10 : 1;
        __IO uint32_t EIFR11 : 1;
        __IO uint32_t EIFR12 : 1;
        __IO uint32_t EIFR13 : 1;
        __IO uint32_t EIFR14 : 1;
        __IO uint32_t EIFR15 : 1;
        uint32_t RESERVED16 : 16;
    } stc_intc_eifr_field_t;

    typedef struct
    {
        __IO uint32_t EICFR0 : 1;
        __IO uint32_t EICFR1 : 1;
        __IO uint32_t EICFR2 : 1;
        __IO uint32_t EICFR3 : 1;
        __IO uint32_t EICFR4 : 1;
        __IO uint32_t EICFR5 : 1;
        __IO uint32_t EICFR6 : 1;
        __IO uint32_t EICFR7 : 1;
        __IO uint32_t EICFR8 : 1;
        __IO uint32_t EICFR9 : 1;
        __IO uint32_t EICFR10 : 1;
        __IO uint32_t EICFR11 : 1;
        __IO uint32_t EICFR12 : 1;
        __IO uint32_t EICFR13 : 1;
        __IO uint32_t EICFR14 : 1;
        __IO uint32_t EICFR15 : 1;
        uint32_t RESERVED16 : 16;
    } stc_intc_eicfr_field_t;

    typedef struct
    {
        __IO uint32_t INTSEL : 9;
        uint32_t RESERVED9 : 23;
    } stc_intc_sel_field_t;

    typedef struct
    {
        __IO uint32_t VSEL0 : 1;
        __IO uint32_t VSEL1 : 1;
        __IO uint32_t VSEL2 : 1;
        __IO uint32_t VSEL3 : 1;
        __IO uint32_t VSEL4 : 1;
        __IO uint32_t VSEL5 : 1;
        __IO uint32_t VSEL6 : 1;
        __IO uint32_t VSEL7 : 1;
        __IO uint32_t VSEL8 : 1;
        __IO uint32_t VSEL9 : 1;
        __IO uint32_t VSEL10 : 1;
        __IO uint32_t VSEL11 : 1;
        __IO uint32_t VSEL12 : 1;
        __IO uint32_t VSEL13 : 1;
        __IO uint32_t VSEL14 : 1;
        __IO uint32_t VSEL15 : 1;
        __IO uint32_t VSEL16 : 1;
        __IO uint32_t VSEL17 : 1;
        __IO uint32_t VSEL18 : 1;
        __IO uint32_t VSEL19 : 1;
        __IO uint32_t VSEL20 : 1;
        __IO uint32_t VSEL21 : 1;
        __IO uint32_t VSEL22 : 1;
        __IO uint32_t VSEL23 : 1;
        __IO uint32_t VSEL24 : 1;
        __IO uint32_t VSEL25 : 1;
        __IO uint32_t VSEL26 : 1;
        __IO uint32_t VSEL27 : 1;
        __IO uint32_t VSEL28 : 1;
        __IO uint32_t VSEL29 : 1;
        __IO uint32_t VSEL30 : 1;
        __IO uint32_t VSEL31 : 1;
    } stc_intc_vssel_field_t;

    typedef struct
    {
        __IO uint32_t SWIE0 : 1;
        __IO uint32_t SWIE1 : 1;
        __IO uint32_t SWIE2 : 1;
        __IO uint32_t SWIE3 : 1;
        __IO uint32_t SWIE4 : 1;
        __IO uint32_t SWIE5 : 1;
        __IO uint32_t SWIE6 : 1;
        __IO uint32_t SWIE7 : 1;
        __IO uint32_t SWIE8 : 1;
        __IO uint32_t SWIE9 : 1;
        __IO uint32_t SWIE10 : 1;
        __IO uint32_t SWIE11 : 1;
        __IO uint32_t SWIE12 : 1;
        __IO uint32_t SWIE13 : 1;
        __IO uint32_t SWIE14 : 1;
        __IO uint32_t SWIE15 : 1;
        __IO uint32_t SWIE16 : 1;
        __IO uint32_t SWIE17 : 1;
        __IO uint32_t SWIE18 : 1;
        __IO uint32_t SWIE19 : 1;
        __IO uint32_t SWIE20 : 1;
        __IO uint32_t SWIE21 : 1;
        __IO uint32_t SWIE22 : 1;
        __IO uint32_t SWIE23 : 1;
        __IO uint32_t SWIE24 : 1;
        __IO uint32_t SWIE25 : 1;
        __IO uint32_t SWIE26 : 1;
        __IO uint32_t SWIE27 : 1;
        __IO uint32_t SWIE28 : 1;
        __IO uint32_t SWIE29 : 1;
        __IO uint32_t SWIE30 : 1;
        __IO uint32_t SWIE31 : 1;
    } stc_intc_swier_field_t;

    typedef struct
    {
        __IO uint32_t EVTE0 : 1;
        __IO uint32_t EVTE1 : 1;
        __IO uint32_t EVTE2 : 1;
        __IO uint32_t EVTE3 : 1;
        __IO uint32_t EVTE4 : 1;
        __IO uint32_t EVTE5 : 1;
        __IO uint32_t EVTE6 : 1;
        __IO uint32_t EVTE7 : 1;
        __IO uint32_t EVTE8 : 1;
        __IO uint32_t EVTE9 : 1;
        __IO uint32_t EVTE10 : 1;
        __IO uint32_t EVTE11 : 1;
        __IO uint32_t EVTE12 : 1;
        __IO uint32_t EVTE13 : 1;
        __IO uint32_t EVTE14 : 1;
        __IO uint32_t EVTE15 : 1;
        __IO uint32_t EVTE16 : 1;
        __IO uint32_t EVTE17 : 1;
        __IO uint32_t EVTE18 : 1;
        __IO uint32_t EVTE19 : 1;
        __IO uint32_t EVTE20 : 1;
        __IO uint32_t EVTE21 : 1;
        __IO uint32_t EVTE22 : 1;
        __IO uint32_t EVTE23 : 1;
        __IO uint32_t EVTE24 : 1;
        __IO uint32_t EVTE25 : 1;
        __IO uint32_t EVTE26 : 1;
        __IO uint32_t EVTE27 : 1;
        __IO uint32_t EVTE28 : 1;
        __IO uint32_t EVTE29 : 1;
        __IO uint32_t EVTE30 : 1;
        __IO uint32_t EVTE31 : 1;
    } stc_intc_evter_field_t;

    typedef struct
    {
        __IO uint32_t IER0 : 1;
        __IO uint32_t IER1 : 1;
        __IO uint32_t IER2 : 1;
        __IO uint32_t IER3 : 1;
        __IO uint32_t IER4 : 1;
        __IO uint32_t IER5 : 1;
        __IO uint32_t IER6 : 1;
        __IO uint32_t IER7 : 1;
        __IO uint32_t IER8 : 1;
        __IO uint32_t IER9 : 1;
        __IO uint32_t IER10 : 1;
        __IO uint32_t IER11 : 1;
        __IO uint32_t IER12 : 1;
        __IO uint32_t IER13 : 1;
        __IO uint32_t IER14 : 1;
        __IO uint32_t IER15 : 1;
        __IO uint32_t IER16 : 1;
        __IO uint32_t IER17 : 1;
        __IO uint32_t IER18 : 1;
        __IO uint32_t IER19 : 1;
        __IO uint32_t IER20 : 1;
        __IO uint32_t IER21 : 1;
        __IO uint32_t IER22 : 1;
        __IO uint32_t IER23 : 1;
        __IO uint32_t IER24 : 1;
        __IO uint32_t IER25 : 1;
        __IO uint32_t IER26 : 1;
        __IO uint32_t IER27 : 1;
        __IO uint32_t IER28 : 1;
        __IO uint32_t IER29 : 1;
        __IO uint32_t IER30 : 1;
        __IO uint32_t IER31 : 1;
    } stc_intc_ier_field_t;

    typedef struct
    {
        __IO uint32_t KEYINSEL : 16;
        __IO uint32_t KEYOUTSEL : 3;
        uint32_t RESERVED19 : 1;
        __IO uint32_t CKSEL : 2;
        uint32_t RESERVED22 : 2;
        __IO uint32_t T_LLEVEL : 5;
        __IO uint32_t T_HIZ : 3;
    } stc_keyscan_scr_field_t;

    typedef struct
    {
        __IO uint32_t SEN : 1;
        uint32_t RESERVED1 : 31;
    } stc_keyscan_ser_field_t;

    typedef struct
    {
        __IO uint32_t INDEX : 3;
        uint32_t RESERVED3 : 29;
    } stc_keyscan_ssr_field_t;

    typedef struct
    {
        __IO uint32_t MPURG0SIZE : 5;
        __IO uint32_t MPURG0ADDR : 27;
    } stc_mpu_rgd0_field_t;

    typedef struct
    {
        __IO uint32_t MPURG1SIZE : 5;
        __IO uint32_t MPURG1ADDR : 27;
    } stc_mpu_rgd1_field_t;

    typedef struct
    {
        __IO uint32_t MPURG2SIZE : 5;
        __IO uint32_t MPURG2ADDR : 27;
    } stc_mpu_rgd2_field_t;

    typedef struct
    {
        __IO uint32_t MPURG3SIZE : 5;
        __IO uint32_t MPURG3ADDR : 27;
    } stc_mpu_rgd3_field_t;

    typedef struct
    {
        __IO uint32_t MPURG4SIZE : 5;
        __IO uint32_t MPURG4ADDR : 27;
    } stc_mpu_rgd4_field_t;

    typedef struct
    {
        __IO uint32_t MPURG5SIZE : 5;
        __IO uint32_t MPURG5ADDR : 27;
    } stc_mpu_rgd5_field_t;

    typedef struct
    {
        __IO uint32_t MPURG6SIZE : 5;
        __IO uint32_t MPURG6ADDR : 27;
    } stc_mpu_rgd6_field_t;

    typedef struct
    {
        __IO uint32_t MPURG7SIZE : 5;
        __IO uint32_t MPURG7ADDR : 27;
    } stc_mpu_rgd7_field_t;

    typedef struct
    {
        __IO uint32_t MPURG8SIZE : 5;
        __IO uint32_t MPURG8ADDR : 27;
    } stc_mpu_rgd8_field_t;

    typedef struct
    {
        __IO uint32_t MPURG9SIZE : 5;
        __IO uint32_t MPURG9ADDR : 27;
    } stc_mpu_rgd9_field_t;

    typedef struct
    {
        __IO uint32_t MPURG10SIZE : 5;
        __IO uint32_t MPURG10ADDR : 27;
    } stc_mpu_rgd10_field_t;

    typedef struct
    {
        __IO uint32_t MPURG11SIZE : 5;
        __IO uint32_t MPURG11ADDR : 27;
    } stc_mpu_rgd11_field_t;

    typedef struct
    {
        __IO uint32_t MPURG12SIZE : 5;
        __IO uint32_t MPURG12ADDR : 27;
    } stc_mpu_rgd12_field_t;

    typedef struct
    {
        __IO uint32_t MPURG13SIZE : 5;
        __IO uint32_t MPURG13ADDR : 27;
    } stc_mpu_rgd13_field_t;

    typedef struct
    {
        __IO uint32_t MPURG14SIZE : 5;
        __IO uint32_t MPURG14ADDR : 27;
    } stc_mpu_rgd14_field_t;

    typedef struct
    {
        __IO uint32_t MPURG15SIZE : 5;
        __IO uint32_t MPURG15ADDR : 27;
    } stc_mpu_rgd15_field_t;

    typedef struct
    {
        __IO uint32_t S2RG0RP : 1;
        __IO uint32_t S2RG0WP : 1;
        uint32_t RESERVED2 : 5;
        __IO uint32_t S2RG0E : 1;
        __IO uint32_t S1RG0RP : 1;
        __IO uint32_t S1RG0WP : 1;
        uint32_t RESERVED10 : 5;
        __IO uint32_t S1RG0E : 1;
        __IO uint32_t FRG0RP : 1;
        __IO uint32_t FRG0WP : 1;
        uint32_t RESERVED18 : 5;
        __IO uint32_t FRG0E : 1;
        uint32_t RESERVED24 : 8;
    } stc_mpu_rgcr0_field_t;

    typedef struct
    {
        __IO uint32_t S2RG1RP : 1;
        __IO uint32_t S2RG1WP : 1;
        uint32_t RESERVED2 : 5;
        __IO uint32_t S2RG1E : 1;
        __IO uint32_t S1RG1RP : 1;
        __IO uint32_t S1RG1WP : 1;
        uint32_t RESERVED10 : 5;
        __IO uint32_t S1RG1E : 1;
        __IO uint32_t FRG1RP : 1;
        __IO uint32_t FRG1WP : 1;
        uint32_t RESERVED18 : 5;
        __IO uint32_t FRG1E : 1;
        uint32_t RESERVED24 : 8;
    } stc_mpu_rgcr1_field_t;

    typedef struct
    {
        __IO uint32_t S2RG2RP : 1;
        __IO uint32_t S2RG2WP : 1;
        uint32_t RESERVED2 : 5;
        __IO uint32_t S2RG2E : 1;
        __IO uint32_t S1RG2RP : 1;
        __IO uint32_t S1RG2WP : 1;
        uint32_t RESERVED10 : 5;
        __IO uint32_t S1RG2E : 1;
        __IO uint32_t FRG2RP : 1;
        __IO uint32_t FRG2WP : 1;
        uint32_t RESERVED18 : 5;
        __IO uint32_t FRG2E : 1;
        uint32_t RESERVED24 : 8;
    } stc_mpu_rgcr2_field_t;

    typedef struct
    {
        __IO uint32_t S2RG3RP : 1;
        __IO uint32_t S2RG3WP : 1;
        uint32_t RESERVED2 : 5;
        __IO uint32_t S2RG3E : 1;
        __IO uint32_t S1RG3RP : 1;
        __IO uint32_t S1RG3WP : 1;
        uint32_t RESERVED10 : 5;
        __IO uint32_t S1RG3E : 1;
        __IO uint32_t FRG3RP : 1;
        __IO uint32_t FRG3WP : 1;
        uint32_t RESERVED18 : 5;
        __IO uint32_t FRG3E : 1;
        uint32_t RESERVED24 : 8;
    } stc_mpu_rgcr3_field_t;

    typedef struct
    {
        __IO uint32_t S2RG4RP : 1;
        __IO uint32_t S2RG4WP : 1;
        uint32_t RESERVED2 : 5;
        __IO uint32_t S2RG4E : 1;
        __IO uint32_t S1RG4RP : 1;
        __IO uint32_t S1RG4WP : 1;
        uint32_t RESERVED10 : 5;
        __IO uint32_t S1RG4E : 1;
        __IO uint32_t FRG4RP : 1;
        __IO uint32_t FRG4WP : 1;
        uint32_t RESERVED18 : 5;
        __IO uint32_t FRG4E : 1;
        uint32_t RESERVED24 : 8;
    } stc_mpu_rgcr4_field_t;

    typedef struct
    {
        __IO uint32_t S2RG5RP : 1;
        __IO uint32_t S2RG5WP : 1;
        uint32_t RESERVED2 : 5;
        __IO uint32_t S2RG5E : 1;
        __IO uint32_t S1RG5RP : 1;
        __IO uint32_t S1RG5WP : 1;
        uint32_t RESERVED10 : 5;
        __IO uint32_t S1RG5E : 1;
        __IO uint32_t FRG5RP : 1;
        __IO uint32_t FRG5WP : 1;
        uint32_t RESERVED18 : 5;
        __IO uint32_t FRG5E : 1;
        uint32_t RESERVED24 : 8;
    } stc_mpu_rgcr5_field_t;

    typedef struct
    {
        __IO uint32_t S2RG6RP : 1;
        __IO uint32_t S2RG6WP : 1;
        uint32_t RESERVED2 : 5;
        __IO uint32_t S2RG6E : 1;
        __IO uint32_t S1RG6RP : 1;
        __IO uint32_t S1RG6WP : 1;
        uint32_t RESERVED10 : 5;
        __IO uint32_t S1RG6E : 1;
        __IO uint32_t FRG6RP : 1;
        __IO uint32_t FRG6WP : 1;
        uint32_t RESERVED18 : 5;
        __IO uint32_t FRG6E : 1;
        uint32_t RESERVED24 : 8;
    } stc_mpu_rgcr6_field_t;

    typedef struct
    {
        __IO uint32_t S2RG7RP : 1;
        __IO uint32_t S2RG7WP : 1;
        uint32_t RESERVED2 : 5;
        __IO uint32_t S2RG7E : 1;
        __IO uint32_t S1RG7RP : 1;
        __IO uint32_t S1RG7WP : 1;
        uint32_t RESERVED10 : 5;
        __IO uint32_t S1RG7E : 1;
        __IO uint32_t FRG7RP : 1;
        __IO uint32_t FRG7WP : 1;
        uint32_t RESERVED18 : 5;
        __IO uint32_t FRG7E : 1;
        uint32_t RESERVED24 : 8;
    } stc_mpu_rgcr7_field_t;

    typedef struct
    {
        __IO uint32_t S2RG8RP : 1;
        __IO uint32_t S2RG8WP : 1;
        uint32_t RESERVED2 : 5;
        __IO uint32_t S2RG8E : 1;
        __IO uint32_t S1RG8RP : 1;
        __IO uint32_t S1RG8WP : 1;
        uint32_t RESERVED10 : 5;
        __IO uint32_t S1RG8E : 1;
        uint32_t RESERVED16 : 16;
    } stc_mpu_rgcr8_field_t;

    typedef struct
    {
        __IO uint32_t S2RG9RP : 1;
        __IO uint32_t S2RG9WP : 1;
        uint32_t RESERVED2 : 5;
        __IO uint32_t S2RG9E : 1;
        __IO uint32_t S1RG9RP : 1;
        __IO uint32_t S1RG9WP : 1;
        uint32_t RESERVED10 : 5;
        __IO uint32_t S1RG9E : 1;
        uint32_t RESERVED16 : 16;
    } stc_mpu_rgcr9_field_t;

    typedef struct
    {
        __IO uint32_t S2RG10RP : 1;
        __IO uint32_t S2RG10WP : 1;
        uint32_t RESERVED2 : 5;
        __IO uint32_t S2RG10E : 1;
        __IO uint32_t S1RG10RP : 1;
        __IO uint32_t S1RG10WP : 1;
        uint32_t RESERVED10 : 5;
        __IO uint32_t S1RG10E : 1;
        uint32_t RESERVED16 : 16;
    } stc_mpu_rgcr10_field_t;

    typedef struct
    {
        __IO uint32_t S2RG11RP : 1;
        __IO uint32_t S2RG11WP : 1;
        uint32_t RESERVED2 : 5;
        __IO uint32_t S2RG11E : 1;
        __IO uint32_t S1RG11RP : 1;
        __IO uint32_t S1RG11WP : 1;
        uint32_t RESERVED10 : 5;
        __IO uint32_t S1RG11E : 1;
        uint32_t RESERVED16 : 16;
    } stc_mpu_rgcr11_field_t;

    typedef struct
    {
        __IO uint32_t S2RG12RP : 1;
        __IO uint32_t S2RG12WP : 1;
        uint32_t RESERVED2 : 5;
        __IO uint32_t S2RG12E : 1;
        __IO uint32_t S1RG12RP : 1;
        __IO uint32_t S1RG12WP : 1;
        uint32_t RESERVED10 : 5;
        __IO uint32_t S1RG12E : 1;
        uint32_t RESERVED16 : 16;
    } stc_mpu_rgcr12_field_t;

    typedef struct
    {
        __IO uint32_t S2RG13RP : 1;
        __IO uint32_t S2RG13WP : 1;
        uint32_t RESERVED2 : 5;
        __IO uint32_t S2RG13E : 1;
        __IO uint32_t S1RG13RP : 1;
        __IO uint32_t S1RG13WP : 1;
        uint32_t RESERVED10 : 5;
        __IO uint32_t S1RG13E : 1;
        uint32_t RESERVED16 : 16;
    } stc_mpu_rgcr13_field_t;

    typedef struct
    {
        __IO uint32_t S2RG14RP : 1;
        __IO uint32_t S2RG14WP : 1;
        uint32_t RESERVED2 : 5;
        __IO uint32_t S2RG14E : 1;
        __IO uint32_t S1RG14RP : 1;
        __IO uint32_t S1RG14WP : 1;
        uint32_t RESERVED10 : 5;
        __IO uint32_t S1RG14E : 1;
        uint32_t RESERVED16 : 16;
    } stc_mpu_rgcr14_field_t;

    typedef struct
    {
        __IO uint32_t S2RG15RP : 1;
        __IO uint32_t S2RG15WP : 1;
        uint32_t RESERVED2 : 5;
        __IO uint32_t S2RG15E : 1;
        __IO uint32_t S1RG15RP : 1;
        __IO uint32_t S1RG15WP : 1;
        uint32_t RESERVED10 : 5;
        __IO uint32_t S1RG15E : 1;
        uint32_t RESERVED16 : 16;
    } stc_mpu_rgcr15_field_t;

    typedef struct
    {
        __IO uint32_t SMPU2BRP : 1;
        __IO uint32_t SMPU2BWP : 1;
        __IO uint32_t SMPU2ACT : 2;
        uint32_t RESERVED4 : 3;
        __IO uint32_t SMPU2E : 1;
        __IO uint32_t SMPU1BRP : 1;
        __IO uint32_t SMPU1BWP : 1;
        __IO uint32_t SMPU1ACT : 2;
        uint32_t RESERVED12 : 3;
        __IO uint32_t SMPU1E : 1;
        __IO uint32_t FMPUBRP : 1;
        __IO uint32_t FMPUBWP : 1;
        __IO uint32_t FMPUACT : 2;
        uint32_t RESERVED20 : 3;
        __IO uint32_t FMPUE : 1;
        uint32_t RESERVED24 : 8;
    } stc_mpu_cr_field_t;

    typedef struct
    {
        __IO uint32_t SMPU2EAF : 1;
        uint32_t RESERVED1 : 7;
        __IO uint32_t SMPU1EAF : 1;
        uint32_t RESERVED9 : 7;
        __IO uint32_t FMPUEAF : 1;
        uint32_t RESERVED17 : 15;
    } stc_mpu_sr_field_t;

    typedef struct
    {
        __IO uint32_t SMPU2ECLR : 1;
        uint32_t RESERVED1 : 7;
        __IO uint32_t SMPU1ECLR : 1;
        uint32_t RESERVED9 : 7;
        __IO uint32_t FMPUECLR : 1;
        uint32_t RESERVED17 : 15;
    } stc_mpu_eclr_field_t;

    typedef struct
    {
        __IO uint32_t MPUWE : 1;
        __IO uint32_t WKEY : 15;
        uint32_t RESERVED16 : 16;
    } stc_mpu_wp_field_t;

    typedef struct
    {
        __IO uint32_t RAMHS : 1;
        uint32_t RESERVED1 : 3;
        __IO uint32_t RAM0 : 1;
        uint32_t RESERVED5 : 3;
        __IO uint32_t ECCRAM : 1;
        uint32_t RESERVED9 : 1;
        __IO uint32_t RETRAM : 1;
        uint32_t RESERVED11 : 3;
        __IO uint32_t DMA1 : 1;
        __IO uint32_t DMA2 : 1;
        __IO uint32_t FCM : 1;
        __IO uint32_t AOS : 1;
        uint32_t RESERVED18 : 2;
        __IO uint32_t AES : 1;
        __IO uint32_t HASH : 1;
        __IO uint32_t TRNG : 1;
        __IO uint32_t CRC : 1;
        __IO uint32_t DCU1 : 1;
        __IO uint32_t DCU2 : 1;
        __IO uint32_t DCU3 : 1;
        __IO uint32_t DCU4 : 1;
        uint32_t RESERVED28 : 3;
        __IO uint32_t KEY : 1;
    } stc_mstp_fcg0_field_t;

    typedef struct
    {
        __IO uint32_t CAN : 1;
        uint32_t RESERVED1 : 2;
        __IO uint32_t QSPI : 1;
        __IO uint32_t IIC1 : 1;
        __IO uint32_t IIC2 : 1;
        __IO uint32_t IIC3 : 1;
        uint32_t RESERVED7 : 1;
        __IO uint32_t USBFS : 1;
        uint32_t RESERVED9 : 1;
        __IO uint32_t SDIOC1 : 1;
        __IO uint32_t SDIOC2 : 1;
        __IO uint32_t I2S1 : 1;
        __IO uint32_t I2S2 : 1;
        __IO uint32_t I2S3 : 1;
        __IO uint32_t I2S4 : 1;
        __IO uint32_t SPI1 : 1;
        __IO uint32_t SPI2 : 1;
        __IO uint32_t SPI3 : 1;
        __IO uint32_t SPI4 : 1;
        uint32_t RESERVED20 : 4;
        __IO uint32_t USART1 : 1;
        __IO uint32_t USART2 : 1;
        __IO uint32_t USART3 : 1;
        __IO uint32_t USART4 : 1;
        uint32_t RESERVED28 : 4;
    } stc_mstp_fcg1_field_t;

    typedef struct
    {
        __IO uint32_t TIMER0_1 : 1;
        __IO uint32_t TIMER0_2 : 1;
        __IO uint32_t TIMERA_1 : 1;
        __IO uint32_t TIMERA_2 : 1;
        __IO uint32_t TIMERA_3 : 1;
        __IO uint32_t TIMERA_4 : 1;
        __IO uint32_t TIMERA_5 : 1;
        __IO uint32_t TIMERA_6 : 1;
        __IO uint32_t TIMER4_1 : 1;
        __IO uint32_t TIMER4_2 : 1;
        __IO uint32_t TIMER4_3 : 1;
        uint32_t RESERVED11 : 4;
        __IO uint32_t EMB : 1;
        __IO uint32_t TIMER6_1 : 1;
        __IO uint32_t TIMER6_2 : 1;
        __IO uint32_t TIMER6_3 : 1;
        uint32_t RESERVED19 : 13;
    } stc_mstp_fcg2_field_t;

    typedef struct
    {
        __IO uint32_t ADC1 : 1;
        __IO uint32_t ADC2 : 1;
        uint32_t RESERVED2 : 2;
        __IO uint32_t DAC : 1;
        uint32_t RESERVED5 : 3;
        __IO uint32_t CMP : 1;
        uint32_t RESERVED9 : 3;
        __IO uint32_t OTS : 1;
        uint32_t RESERVED13 : 19;
    } stc_mstp_fcg3_field_t;

    typedef struct
    {
        __IO uint32_t PRT0 : 1;
        uint32_t RESERVED1 : 15;
        __IO uint32_t FCG0PCWE : 16;
    } stc_mstp_fcg0pc_field_t;

    typedef struct
    {
        __IO uint16_t OTSST : 1;
        __IO uint16_t OTSCK : 1;
        __IO uint16_t OTSIE : 1;
        __IO uint16_t TSSTP : 1;
        uint16_t RESERVED4 : 12;
    } stc_ots_ctl_field_t;

    typedef struct
    {
        __IO uint16_t TSDC0 : 1;
        __IO uint16_t TSDC1 : 1;
        __IO uint16_t TSDC2 : 1;
        __IO uint16_t TSDC3 : 1;
        __IO uint16_t TSDC4 : 1;
        __IO uint16_t TSDC5 : 1;
        __IO uint16_t TSDC6 : 1;
        __IO uint16_t TSDC7 : 1;
        __IO uint16_t TSDC8 : 1;
        __IO uint16_t TSDC9 : 1;
        __IO uint16_t TSDC10 : 1;
        __IO uint16_t TSDC11 : 1;
        __IO uint16_t TSDC12 : 1;
        __IO uint16_t TSDC13 : 1;
        __IO uint16_t TSDC14 : 1;
        __IO uint16_t TSDC15 : 1;
    } stc_ots_dr1_field_t;

    typedef struct
    {
        __IO uint16_t TSDC0 : 1;
        __IO uint16_t TSDC1 : 1;
        __IO uint16_t TSDC2 : 1;
        __IO uint16_t TSDC3 : 1;
        __IO uint16_t TSDC4 : 1;
        __IO uint16_t TSDC5 : 1;
        __IO uint16_t TSDC6 : 1;
        __IO uint16_t TSDC7 : 1;
        __IO uint16_t TSDC8 : 1;
        __IO uint16_t TSDC9 : 1;
        __IO uint16_t TSDC10 : 1;
        __IO uint16_t TSDC11 : 1;
        __IO uint16_t TSDC12 : 1;
        __IO uint16_t TSDC13 : 1;
        __IO uint16_t TSDC14 : 1;
        __IO uint16_t TSDC15 : 1;
    } stc_ots_dr2_field_t;

    typedef struct
    {
        __IO uint16_t TSEC0 : 1;
        __IO uint16_t TSEC1 : 1;
        __IO uint16_t TSEC2 : 1;
        __IO uint16_t TSEC3 : 1;
        __IO uint16_t TSEC4 : 1;
        __IO uint16_t TSEC5 : 1;
        __IO uint16_t TSEC6 : 1;
        __IO uint16_t TSEC7 : 1;
        __IO uint16_t TSEC8 : 1;
        __IO uint16_t TSEC9 : 1;
        __IO uint16_t TSEC10 : 1;
        __IO uint16_t TSEC11 : 1;
        __IO uint16_t TSEC12 : 1;
        __IO uint16_t TSEC13 : 1;
        __IO uint16_t TSEC14 : 1;
        __IO uint16_t TSEC15 : 1;
    } stc_ots_ecr_field_t;

    typedef struct
    {
        __IO uint32_t TSOFS : 8;
        __IO uint32_t TSSLP : 24;
    } stc_ots_lpr_field_t;

    typedef struct
    {
        __IO uint32_t DFB : 1;
        __IO uint32_t SOFEN : 1;
        uint32_t RESERVED2 : 30;
    } stc_peric_usbfs_syctlreg_field_t;

    typedef struct
    {
        __IO uint32_t ABINT1 : 1;
        __IO uint32_t SELMMC1 : 1;
        __IO uint32_t ABINT2 : 1;
        __IO uint32_t SELMMC2 : 1;
        uint32_t RESERVED4 : 28;
    } stc_peric_sdioc_syctlreg_field_t;

    typedef struct
    {
        __IO uint16_t PIN00 : 1;
        __IO uint16_t PIN01 : 1;
        __IO uint16_t PIN02 : 1;
        __IO uint16_t PIN03 : 1;
        __IO uint16_t PIN04 : 1;
        __IO uint16_t PIN05 : 1;
        __IO uint16_t PIN06 : 1;
        __IO uint16_t PIN07 : 1;
        __IO uint16_t PIN08 : 1;
        __IO uint16_t PIN09 : 1;
        __IO uint16_t PIN10 : 1;
        __IO uint16_t PIN11 : 1;
        __IO uint16_t PIN12 : 1;
        __IO uint16_t PIN13 : 1;
        __IO uint16_t PIN14 : 1;
        __IO uint16_t PIN15 : 1;
    } stc_port_pidr_field_t;

