MarlinFirmware/Marlin/Marlin/lib/h32_core/main/hdsc32core/common/hc32f46x.h
    typedef struct
    {
        __IO uint32_t PER : 16;
        uint32_t RESERVED16 : 16;
    } stc_tmra_perar_field_t;

    typedef struct
    {
        __IO uint32_t CMP : 16;
        uint32_t RESERVED16 : 16;
    } stc_tmra_cmpar_field_t;

    typedef struct
    {
        __IO uint32_t START : 1;
        __IO uint32_t DIR : 1;
        __IO uint32_t MODE : 1;
        __IO uint32_t SYNST : 1;
        __IO uint32_t CKDIV : 4;
        uint32_t RESERVED8 : 4;
        __IO uint32_t ITENOVF : 1;
        __IO uint32_t ITENUDF : 1;
        __IO uint32_t OVFF : 1;
        __IO uint32_t UDFF : 1;
        uint32_t RESERVED16 : 16;
    } stc_tmra_bcstr_field_t;

    typedef struct
    {
        __IO uint32_t HSTA0 : 1;
        __IO uint32_t HSTA1 : 1;
        __IO uint32_t HSTA2 : 1;
        uint32_t RESERVED3 : 1;
        __IO uint32_t HSTP0 : 1;
        __IO uint32_t HSTP1 : 1;
        __IO uint32_t HSTP2 : 1;
        uint32_t RESERVED7 : 1;
        __IO uint32_t HCLE0 : 1;
        __IO uint32_t HCLE1 : 1;
        __IO uint32_t HCLE2 : 1;
        uint32_t RESERVED11 : 1;
        __IO uint32_t HCLE3 : 1;
        __IO uint32_t HCLE4 : 1;
        __IO uint32_t HCLE5 : 1;
        __IO uint32_t HCLE6 : 1;
        uint32_t RESERVED16 : 16;
    } stc_tmra_hconr_field_t;

    typedef struct
    {
        __IO uint32_t HCUP0 : 1;
        __IO uint32_t HCUP1 : 1;
        __IO uint32_t HCUP2 : 1;
        __IO uint32_t HCUP3 : 1;
        __IO uint32_t HCUP4 : 1;
        __IO uint32_t HCUP5 : 1;
        __IO uint32_t HCUP6 : 1;
        __IO uint32_t HCUP7 : 1;
        __IO uint32_t HCUP8 : 1;
        __IO uint32_t HCUP9 : 1;
        __IO uint32_t HCUP10 : 1;
        __IO uint32_t HCUP11 : 1;
        __IO uint32_t HCUP12 : 1;
        uint32_t RESERVED13 : 19;
    } stc_tmra_hcupr_field_t;

    typedef struct
    {
        __IO uint32_t HCDO0 : 1;
        __IO uint32_t HCDO1 : 1;
        __IO uint32_t HCDO2 : 1;
        __IO uint32_t HCDO3 : 1;
        __IO uint32_t HCDO4 : 1;
        __IO uint32_t HCDO5 : 1;
        __IO uint32_t HCDO6 : 1;
        __IO uint32_t HCDO7 : 1;
        __IO uint32_t HCDO8 : 1;
        __IO uint32_t HCDO9 : 1;
        __IO uint32_t HCDO10 : 1;
        __IO uint32_t HCDO11 : 1;
        __IO uint32_t HCDO12 : 1;
        uint32_t RESERVED13 : 19;
    } stc_tmra_hcdor_field_t;

    typedef struct
    {
        __IO uint32_t ITEN1 : 1;
        __IO uint32_t ITEN2 : 1;
        __IO uint32_t ITEN3 : 1;
        __IO uint32_t ITEN4 : 1;
        __IO uint32_t ITEN5 : 1;
        __IO uint32_t ITEN6 : 1;
        __IO uint32_t ITEN7 : 1;
        __IO uint32_t ITEN8 : 1;
        uint32_t RESERVED8 : 24;
    } stc_tmra_iconr_field_t;

    typedef struct
    {
        __IO uint32_t ETEN1 : 1;
        __IO uint32_t ETEN2 : 1;
        __IO uint32_t ETEN3 : 1;
        __IO uint32_t ETEN4 : 1;
        __IO uint32_t ETEN5 : 1;
        __IO uint32_t ETEN6 : 1;
        __IO uint32_t ETEN7 : 1;
        __IO uint32_t ETEN8 : 1;
        uint32_t RESERVED8 : 24;
    } stc_tmra_econr_field_t;

    typedef struct
    {
        __IO uint32_t NOFIENTG : 1;
        __IO uint32_t NOFICKTG : 2;
        uint32_t RESERVED3 : 5;
        __IO uint32_t NOFIENCA : 1;
        __IO uint32_t NOFICKCA : 2;
        uint32_t RESERVED11 : 1;
        __IO uint32_t NOFIENCB : 1;
        __IO uint32_t NOFICKCB : 2;
        uint32_t RESERVED15 : 17;
    } stc_tmra_fconr_field_t;

    typedef struct
    {
        __IO uint32_t CMPF1 : 1;
        __IO uint32_t CMPF2 : 1;
        __IO uint32_t CMPF3 : 1;
        __IO uint32_t CMPF4 : 1;
        __IO uint32_t CMPF5 : 1;
        __IO uint32_t CMPF6 : 1;
        __IO uint32_t CMPF7 : 1;
        __IO uint32_t CMPF8 : 1;
        uint32_t RESERVED8 : 24;
    } stc_tmra_stflr_field_t;

    typedef struct
    {
        __IO uint32_t BEN : 1;
        __IO uint32_t BSE0 : 1;
        __IO uint32_t BSE1 : 1;
        uint32_t RESERVED3 : 29;
    } stc_tmra_bconr_field_t;

    typedef struct
    {
        __IO uint32_t CAPMDA : 1;
        uint32_t RESERVED1 : 3;
        __IO uint32_t HICP0 : 1;
        __IO uint32_t HICP1 : 1;
        __IO uint32_t HICP2 : 1;
        uint32_t RESERVED7 : 1;
        __IO uint32_t HICP3 : 1;
        __IO uint32_t HICP4 : 1;
        uint32_t RESERVED10 : 2;
        __IO uint32_t NOFIENCP : 1;
        __IO uint32_t NOFICKCP : 2;
        uint32_t RESERVED15 : 17;
    } stc_tmra_cconr_field_t;

    typedef struct
    {
        __IO uint32_t STAC : 2;
        __IO uint32_t STPC : 2;
        __IO uint32_t CMPC : 2;
        __IO uint32_t PERC : 2;
        __IO uint32_t FORC : 2;
        uint32_t RESERVED10 : 2;
        __IO uint32_t OUTEN : 1;
        uint32_t RESERVED13 : 19;
    } stc_tmra_pconr_field_t;

    typedef struct
    {
        __IO uint32_t EN : 1;
        __IO uint32_t RUN : 1;
        uint32_t RESERVED2 : 30;
    } stc_trng_cr_field_t;

    typedef struct
    {
        __IO uint32_t LOAD : 1;
        uint32_t RESERVED1 : 1;
        __IO uint32_t CNT : 3;
        uint32_t RESERVED5 : 27;
    } stc_trng_mr_field_t;

    typedef struct
    {
        __IO uint32_t PE : 1;
        __IO uint32_t FE : 1;
        uint32_t RESERVED2 : 1;
        __IO uint32_t ORE : 1;
        uint32_t RESERVED4 : 1;
        __IO uint32_t RXNE : 1;
        __IO uint32_t TC : 1;
        __IO uint32_t TXE : 1;
        __IO uint32_t RTOF : 1;
        uint32_t RESERVED9 : 7;
        __IO uint32_t MPB : 1;
        uint32_t RESERVED17 : 15;
    } stc_usart_sr_field_t;

    typedef struct
    {
        __IO uint32_t TDR : 9;
        __IO uint32_t MPID : 1;
        uint32_t RESERVED10 : 6;
        __IO uint32_t RDR : 9;
        uint32_t RESERVED25 : 7;
    } stc_usart_dr_field_t;

    typedef struct
    {
        __IO uint32_t DIV_FRACTION : 7;
        uint32_t RESERVED7 : 1;
        __IO uint32_t DIV_INTEGER : 8;
        uint32_t RESERVED16 : 16;
    } stc_usart_brr_field_t;

    typedef struct
    {
        __IO uint32_t RTOE : 1;
        __IO uint32_t RTOIE : 1;
        __IO uint32_t RE : 1;
        __IO uint32_t TE : 1;
        __IO uint32_t SLME : 1;
        __IO uint32_t RIE : 1;
        __IO uint32_t TCIE : 1;
        __IO uint32_t TXEIE : 1;
        uint32_t RESERVED8 : 1;
        __IO uint32_t PS : 1;
        __IO uint32_t PCE : 1;
        uint32_t RESERVED11 : 1;
        __IO uint32_t M : 1;
        uint32_t RESERVED13 : 2;
        __IO uint32_t OVER8 : 1;
        __IO uint32_t CPE : 1;
        __IO uint32_t CFE : 1;
        uint32_t RESERVED18 : 1;
        __IO uint32_t CORE : 1;
        __IO uint32_t CRTOF : 1;
        uint32_t RESERVED21 : 3;
        __IO uint32_t MS : 1;
        uint32_t RESERVED25 : 3;
        __IO uint32_t ML : 1;
        __IO uint32_t FBME : 1;
        __IO uint32_t NFE : 1;
        __IO uint32_t SBS : 1;
    } stc_usart_cr1_field_t;

    typedef struct
    {
        __IO uint32_t MPE : 1;
        uint32_t RESERVED1 : 10;
        __IO uint32_t CLKC : 2;
        __IO uint32_t STOP : 1;
        uint32_t RESERVED14 : 18;
    } stc_usart_cr2_field_t;

    typedef struct
    {
        uint32_t RESERVED0 : 5;
        __IO uint32_t SCEN : 1;
        uint32_t RESERVED6 : 3;
        __IO uint32_t CTSE : 1;
        uint32_t RESERVED10 : 11;
        __IO uint32_t BCN : 3;
        uint32_t RESERVED24 : 8;
    } stc_usart_cr3_field_t;

    typedef struct
    {
        __IO uint32_t PSC : 2;
        uint32_t RESERVED2 : 30;
    } stc_usart_pr_field_t;

    typedef struct
    {
        __IO uint32_t GINTMSK : 1;
        __IO uint32_t HBSTLEN : 4;
        __IO uint32_t DMAEN : 1;
        uint32_t RESERVED6 : 1;
        __IO uint32_t TXFELVL : 1;
        __IO uint32_t PTXFELVL : 1;
        uint32_t RESERVED9 : 23;
    } stc_usbfs_gahbcfg_field_t;

    typedef struct
    {
        __IO uint32_t TOCAL : 3;
        uint32_t RESERVED3 : 3;
        __IO uint32_t PHYSEL : 1;
        uint32_t RESERVED7 : 3;
        __IO uint32_t TRDT : 4;
        uint32_t RESERVED14 : 15;
        __IO uint32_t FHMOD : 1;
        __IO uint32_t FDMOD : 1;
        uint32_t RESERVED31 : 1;
    } stc_usbfs_gusbcfg_field_t;

    typedef struct
    {
        __IO uint32_t CSRST : 1;
        __IO uint32_t HSRST : 1;
        __IO uint32_t FCRST : 1;
        uint32_t RESERVED3 : 1;
        __IO uint32_t RXFFLSH : 1;
        __IO uint32_t TXFFLSH : 1;
        __IO uint32_t TXFNUM : 5;
        uint32_t RESERVED11 : 19;
        __IO uint32_t DMAREQ : 1;
        __IO uint32_t AHBIDL : 1;
    } stc_usbfs_grstctl_field_t;

    typedef struct
    {
        __IO uint32_t CMOD : 1;
        __IO uint32_t MMIS : 1;
        uint32_t RESERVED2 : 1;
        __IO uint32_t SOF : 1;
        __IO uint32_t RXFLNE : 1;
        __IO uint32_t NPTXFE : 1;
        __IO uint32_t GINAKEFF : 1;
        __IO uint32_t GOUTNAKEFF : 1;
        uint32_t RESERVED8 : 2;
        __IO uint32_t ESUSP : 1;
        __IO uint32_t USBSUSP : 1;
        __IO uint32_t USBRST : 1;
        __IO uint32_t ENUMDNE : 1;
        __IO uint32_t ISOODRP : 1;
        __IO uint32_t EOPF : 1;
        uint32_t RESERVED16 : 2;
        __IO uint32_t IEPINT : 1;
        __IO uint32_t OEPINT : 1;
        __IO uint32_t IISOIXFR : 1;
        __IO uint32_t IPXFR_INCOMPISO : 1;
        __IO uint32_t DATAFSUSP : 1;
        uint32_t RESERVED23 : 1;
        __IO uint32_t HPRTINT : 1;
        __IO uint32_t HCINT : 1;
        __IO uint32_t PTXFE : 1;
        uint32_t RESERVED27 : 1;
        __IO uint32_t CIDSCHG : 1;
        __IO uint32_t DISCINT : 1;
        __IO uint32_t VBUSVINT : 1;
        __IO uint32_t WKUINT : 1;
    } stc_usbfs_gintsts_field_t;

    typedef struct
    {
        uint32_t RESERVED0 : 1;
        __IO uint32_t MMISM : 1;
        uint32_t RESERVED2 : 1;
        __IO uint32_t SOFM : 1;
        __IO uint32_t RXFNEM : 1;
        __IO uint32_t NPTXFEM : 1;
        __IO uint32_t GINAKEFFM : 1;
        __IO uint32_t GOUTNAKEFFM : 1;
        uint32_t RESERVED8 : 2;
        __IO uint32_t ESUSPM : 1;
        __IO uint32_t USBSUSPM : 1;
        __IO uint32_t USBRSTM : 1;
        __IO uint32_t ENUMDNEM : 1;
        __IO uint32_t ISOODRPM : 1;
        __IO uint32_t EOPFM : 1;
        uint32_t RESERVED16 : 2;
        __IO uint32_t IEPIM : 1;
        __IO uint32_t OEPIM : 1;
        __IO uint32_t IISOIXFRM : 1;
        __IO uint32_t IPXFRM_INCOMPISOOUTM : 1;
        __IO uint32_t DATAFSUSPM : 1;
        uint32_t RESERVED23 : 1;
        __IO uint32_t HPRTIM : 1;
        __IO uint32_t HCIM : 1;
        __IO uint32_t PTXFEM : 1;
        uint32_t RESERVED27 : 1;
        __IO uint32_t CIDSCHGM : 1;
        __IO uint32_t DISCIM : 1;
        __IO uint32_t VBUSVIM : 1;
        __IO uint32_t WKUIM : 1;
    } stc_usbfs_gintmsk_field_t;

    typedef struct
    {
        __IO uint32_t CHNUM_EPNUM : 4;
        __IO uint32_t BCNT : 11;
        __IO uint32_t DPID : 2;
        __IO uint32_t PKTSTS : 4;
        uint32_t RESERVED21 : 11;
    } stc_usbfs_grxstsr_field_t;

    typedef struct
    {
        __IO uint32_t CHNUM_EPNUM : 4;
        __IO uint32_t BCNT : 11;
        __IO uint32_t DPID : 2;
        __IO uint32_t PKTSTS : 4;
        uint32_t RESERVED21 : 11;
    } stc_usbfs_grxstsp_field_t;

    typedef struct
    {
        __IO uint32_t RXFD : 11;
        uint32_t RESERVED11 : 21;
    } stc_usbfs_grxfsiz_field_t;

    typedef struct
    {
        __IO uint32_t NPTXFSA : 16;
        __IO uint32_t NPTXFD : 16;
    } stc_usbfs_hnptxfsiz_field_t;

    typedef struct
    {
        __IO uint32_t NPTXFSAV : 16;
        __IO uint32_t NPTQXSAV : 8;
        __IO uint32_t NPTXQTOP : 7;
        uint32_t RESERVED31 : 1;
    } stc_usbfs_hnptxsts_field_t;

    typedef struct
    {
        __IO uint32_t PTXSA : 12;
        uint32_t RESERVED12 : 4;
        __IO uint32_t PTXFD : 11;
        uint32_t RESERVED27 : 5;
    } stc_usbfs_hptxfsiz_field_t;

    typedef struct
    {
        __IO uint32_t INEPTXSA : 12;
        uint32_t RESERVED12 : 4;
        __IO uint32_t INEPTXFD : 10;
        uint32_t RESERVED26 : 6;
    } stc_usbfs_dieptxf_field_t;

    typedef struct
    {
        __IO uint32_t FSLSPCS : 2;
        __IO uint32_t FSLSS : 1;
        uint32_t RESERVED3 : 29;
    } stc_usbfs_hcfg_field_t;

    typedef struct
    {
        __IO uint32_t FRIVL : 16;
        uint32_t RESERVED16 : 16;
    } stc_usbfs_hfir_field_t;

    typedef struct
    {
        __IO uint32_t FRNUM : 16;
        __IO uint32_t FTREM : 16;
    } stc_usbfs_hfnum_field_t;

    typedef struct
    {
        __IO uint32_t PTXFSAVL : 16;
        __IO uint32_t PTXQSAV : 8;
        __IO uint32_t PTXQTOP : 8;
    } stc_usbfs_hptxsts_field_t;

    typedef struct
    {
        __IO uint32_t HAINT : 12;
        uint32_t RESERVED12 : 20;
    } stc_usbfs_haint_field_t;

    typedef struct
    {
        __IO uint32_t HAINTM : 12;
        uint32_t RESERVED12 : 20;
    } stc_usbfs_haintmsk_field_t;

    typedef struct
    {
        __IO uint32_t PCSTS : 1;
        __IO uint32_t PCDET : 1;
        __IO uint32_t PENA : 1;
        __IO uint32_t PENCHNG : 1;
        uint32_t RESERVED4 : 2;
        __IO uint32_t PRES : 1;
        __IO uint32_t PSUSP : 1;
        __IO uint32_t PRST : 1;
        uint32_t RESERVED9 : 1;
        __IO uint32_t PLSTS : 2;
        __IO uint32_t PWPR : 1;
        uint32_t RESERVED13 : 4;
        __IO uint32_t PSPD : 2;
        uint32_t RESERVED19 : 13;
    } stc_usbfs_hprt_field_t;

    typedef struct
    {
        __IO uint32_t MPSIZ : 11;
        __IO uint32_t EPNUM : 4;
        __IO uint32_t EPDIR : 1;
        uint32_t RESERVED16 : 1;
        __IO uint32_t LSDEV : 1;
        __IO uint32_t EPTYP : 2;
        uint32_t RESERVED20 : 2;
        __IO uint32_t DAD : 7;
        __IO uint32_t ODDFRM : 1;
        __IO uint32_t CHDIS : 1;
        __IO uint32_t CHENA : 1;
    } stc_usbfs_hcchar_field_t;

    typedef struct
    {
        __IO uint32_t XFRC : 1;
        __IO uint32_t CHH : 1;
        uint32_t RESERVED2 : 1;
        __IO uint32_t STALL : 1;
        __IO uint32_t NAK : 1;
        __IO uint32_t ACK : 1;
        uint32_t RESERVED6 : 1;
        __IO uint32_t TXERR : 1;
        __IO uint32_t BBERR : 1;
        __IO uint32_t FRMOR : 1;
        __IO uint32_t DTERR : 1;
        uint32_t RESERVED11 : 21;
    } stc_usbfs_hcint_field_t;

    typedef struct
    {
        __IO uint32_t XFRCM : 1;
        __IO uint32_t CHHM : 1;
        uint32_t RESERVED2 : 1;
        __IO uint32_t STALLM : 1;
        __IO uint32_t NAKM : 1;
        __IO uint32_t ACKM : 1;
        uint32_t RESERVED6 : 1;
        __IO uint32_t TXERRM : 1;
        __IO uint32_t BBERRM : 1;
        __IO uint32_t FRMORM : 1;
        __IO uint32_t DTERRM : 1;
        uint32_t RESERVED11 : 21;
    } stc_usbfs_hcintmsk_field_t;

    typedef struct
    {
        __IO uint32_t XFRSIZ : 19;
        __IO uint32_t PKTCNT : 10;
        __IO uint32_t DPID : 2;
        uint32_t RESERVED31 : 1;
    } stc_usbfs_hctsiz_field_t;

    typedef struct
    {
        __IO uint32_t DSPD : 2;
        __IO uint32_t NZLSOHSK : 1;
        uint32_t RESERVED3 : 1;
        __IO uint32_t DAD : 7;
        __IO uint32_t PFIVL : 2;
        uint32_t RESERVED13 : 19;
    } stc_usbfs_dcfg_field_t;

    typedef struct
    {
        __IO uint32_t RWUSIG : 1;
        __IO uint32_t SDIS : 1;
        __IO uint32_t GINSTS : 1;
        __IO uint32_t GONSTS : 1;
        __IO uint32_t TCTL : 3;
        __IO uint32_t SGINAK : 1;
        __IO uint32_t CGINAK : 1;
        __IO uint32_t SGONAK : 1;
        __IO uint32_t CGONAK : 1;
        __IO uint32_t POPRGDNE : 1;
        uint32_t RESERVED12 : 20;
    } stc_usbfs_dctl_field_t;

    typedef struct
    {
        __IO uint32_t SUSPSTS : 1;
        __IO uint32_t ENUMSPD : 2;
        __IO uint32_t EERR : 1;
        uint32_t RESERVED4 : 4;
        __IO uint32_t FNSOF : 14;
        uint32_t RESERVED22 : 10;
    } stc_usbfs_dsts_field_t;

    typedef struct
    {
        __IO uint32_t XFRCM : 1;
        __IO uint32_t EPDM : 1;
        uint32_t RESERVED2 : 1;
        __IO uint32_t TOM : 1;
        __IO uint32_t ITTXFEMSK : 1;
        __IO uint32_t INEPNMM : 1;
        __IO uint32_t IINEPNEM : 1;
        uint32_t RESERVED7 : 25;
    } stc_usbfs_diepmsk_field_t;

    typedef struct
    {
        __IO uint32_t XFRCM : 1;
        __IO uint32_t EPDM : 1;
        uint32_t RESERVED2 : 1;
        __IO uint32_t STUPM : 1;
        __IO uint32_t OTEPDM : 1;
        uint32_t RESERVED5 : 27;
    } stc_usbfs_doepmsk_field_t;

    typedef struct
    {
        __IO uint32_t IEPINT : 6;
        uint32_t RESERVED6 : 10;
        __IO uint32_t OEPINT : 6;
        uint32_t RESERVED22 : 10;
    } stc_usbfs_daint_field_t;

    typedef struct
    {
        __IO uint32_t IEPINTM : 6;
        uint32_t RESERVED6 : 10;
        __IO uint32_t OEPINTM : 6;
        uint32_t RESERVED22 : 10;
    } stc_usbfs_daintmsk_field_t;

    typedef struct
    {
        __IO uint32_t INEPTXFEM : 6;
        uint32_t RESERVED6 : 26;
    } stc_usbfs_diepempmsk_field_t;

    typedef struct
    {
        __IO uint32_t MPSIZ : 2;
        uint32_t RESERVED2 : 13;
        __IO uint32_t USBAEP : 1;
        uint32_t RESERVED16 : 1;
        __IO uint32_t NAKSTS : 1;
        __IO uint32_t EPTYP : 2;
        uint32_t RESERVED20 : 1;
        __IO uint32_t STALL : 1;
        __IO uint32_t TXFNUM : 4;
        __IO uint32_t CNAK : 1;
        __IO uint32_t SNAK : 1;
        uint32_t RESERVED28 : 2;
        __IO uint32_t EPDIS : 1;
        __IO uint32_t EPENA : 1;
    } stc_usbfs_diepctl0_field_t;

    typedef struct
    {
        __IO uint32_t XFRC : 1;
        __IO uint32_t EPDISD : 1;
        uint32_t RESERVED2 : 1;
        __IO uint32_t TOC : 1;
        __IO uint32_t TTXFE : 1;
        uint32_t RESERVED5 : 1;
        __IO uint32_t NEPNE : 1;
        __IO uint32_t TXFE : 1;
        uint32_t RESERVED8 : 24;
    } stc_usbfs_diepint0_field_t;

    typedef struct
    {
        __IO uint32_t XFRSIZ : 7;
        uint32_t RESERVED7 : 12;
        __IO uint32_t PKTCNT : 2;
        uint32_t RESERVED21 : 11;
    } stc_usbfs_dieptsiz0_field_t;

    typedef struct
    {
        __IO uint32_t INEPTFSAV : 16;
        uint32_t RESERVED16 : 16;
    } stc_usbfs_dtxfsts0_field_t;

    typedef struct
    {
        __IO uint32_t MPSIZ : 11;
        uint32_t RESERVED11 : 4;
        __IO uint32_t USBAEP : 1;
        __IO uint32_t EONUM_DPID : 1;
        __IO uint32_t NAKSTS : 1;
        __IO uint32_t EPTYP : 2;
        uint32_t RESERVED20 : 1;
        __IO uint32_t STALL : 1;
        __IO uint32_t TXFNUM : 4;
        __IO uint32_t CNAK : 1;
        __IO uint32_t SNAK : 1;
        __IO uint32_t SD0PID_SEVNFRM : 1;
        __IO uint32_t SODDFRM : 1;
        __IO uint32_t EPDIS : 1;
        __IO uint32_t EPENA : 1;
    } stc_usbfs_diepctl_field_t;

    typedef struct
    {
        __IO uint32_t XFRC : 1;
        __IO uint32_t EPDISD : 1;
        uint32_t RESERVED2 : 1;
        __IO uint32_t TOC : 1;
        __IO uint32_t TTXFE : 1;
        uint32_t RESERVED5 : 1;
        __IO uint32_t NEPNE : 1;
        __IO uint32_t TXFE : 1;
        uint32_t RESERVED8 : 24;
    } stc_usbfs_diepint_field_t;

    typedef struct
    {
        __IO uint32_t XFRSIZ : 19;
        __IO uint32_t PKTCNT : 10;
        __IO uint32_t MC : 2;
        uint32_t RESERVED31 : 1;
    } stc_usbfs_dieptsiz_field_t;

    typedef struct
    {
        __IO uint32_t INEPTFSAV : 16;
        uint32_t RESERVED16 : 16;
    } stc_usbfs_dtxfsts_field_t;

    typedef struct
    {
        __IO uint32_t MPSIZ : 2;
        uint32_t RESERVED2 : 13;
        __IO uint32_t USBAEP : 1;
        uint32_t RESERVED16 : 1;
        __IO uint32_t NAKSTS : 1;
        __IO uint32_t EPTYP : 2;
        __IO uint32_t SNPM : 1;
        __IO uint32_t STALL : 1;
        uint32_t RESERVED22 : 4;
        __IO uint32_t CNAK : 1;
        __IO uint32_t SNAK : 1;
        uint32_t RESERVED28 : 2;
        __IO uint32_t EPDIS : 1;
        __IO uint32_t EPENA : 1;
    } stc_usbfs_doepctl0_field_t;

    typedef struct
    {
        __IO uint32_t XFRC : 1;
        __IO uint32_t EPDISD : 1;
        uint32_t RESERVED2 : 1;
        __IO uint32_t STUP : 1;
        __IO uint32_t OTEPDIS : 1;
        uint32_t RESERVED5 : 1;
        __IO uint32_t B2BSTUP : 1;
        uint32_t RESERVED7 : 25;
    } stc_usbfs_doepint_field_t;

    typedef struct
    {
        __IO uint32_t XFRSIZ : 7;
        uint32_t RESERVED7 : 12;
        __IO uint32_t PKTCNT : 1;
        uint32_t RESERVED20 : 9;
        __IO uint32_t STUPCNT : 2;
        uint32_t RESERVED31 : 1;
    } stc_usbfs_doeptsiz0_field_t;

    typedef struct
    {
        __IO uint32_t MPSIZ : 11;
        uint32_t RESERVED11 : 4;
        __IO uint32_t USBAEP : 1;
        __IO uint32_t DPID : 1;
        __IO uint32_t NAKSTS : 1;
        __IO uint32_t EPTYP : 2;
        __IO uint32_t SNPM : 1;
        __IO uint32_t STALL : 1;
        uint32_t RESERVED22 : 4;
        __IO uint32_t CNAK : 1;
        __IO uint32_t SNAK : 1;
        __IO uint32_t SD0PID : 1;
        __IO uint32_t SD1PID : 1;
        __IO uint32_t EPDIS : 1;
        __IO uint32_t EPENA : 1;
    } stc_usbfs_doepctl_field_t;

    typedef struct
    {
        __IO uint32_t XFRSIZ : 19;
        __IO uint32_t PKTCNT : 10;
        uint32_t RESERVED29 : 3;
    } stc_usbfs_doeptsiz_field_t;

    typedef struct
    {
        __IO uint32_t STPPCLK : 1;
        __IO uint32_t GATEHCLK : 1;
        uint32_t RESERVED2 : 30;
    } stc_usbfs_pcgcctl_field_t;

    typedef struct
    {
        __IO uint32_t PERI : 2;
        uint32_t RESERVED2 : 2;
        __IO uint32_t CKS : 4;
        __IO uint32_t WDPT : 4;
        uint32_t RESERVED12 : 4;
        __IO uint32_t SLPOFF : 1;
        uint32_t RESERVED17 : 14;
        __IO uint32_t ITS : 1;
    } stc_wdt_cr_field_t;

    typedef struct
    {
        __IO uint32_t CNT : 16;
        __IO uint32_t UDF : 1;
        __IO uint32_t REF : 1;
        uint32_t RESERVED18 : 14;
    } stc_wdt_sr_field_t;

    typedef struct
    {
        __IO uint32_t RF : 16;
        uint32_t RESERVED16 : 16;
    } stc_wdt_rr_field_t;

    typedef struct
    {
        __IO uint16_t WKTMCMP : 12;
        __IO uint16_t WKOVF : 1;
        __IO uint16_t WKCKS : 2;
        __IO uint16_t WKTCE : 1;
    } stc_wktm_cr_field_t;

