MarlinFirmware/Marlin/Marlin/lib/h32_core/main/hdsc32core/common/hc32f46x.h
    typedef struct
    {
        union
        {
            __IO uint32_t EN;
            stc_dma_en_field_t EN_f;
        };
        union
        {
            __IO uint32_t INTSTAT0;
            stc_dma_intstat0_field_t INTSTAT0_f;
        };
        union
        {
            __IO uint32_t INTSTAT1;
            stc_dma_intstat1_field_t INTSTAT1_f;
        };
        union
        {
            __IO uint32_t INTMASK0;
            stc_dma_intmask0_field_t INTMASK0_f;
        };
        union
        {
            __IO uint32_t INTMASK1;
            stc_dma_intmask1_field_t INTMASK1_f;
        };
        union
        {
            __IO uint32_t INTCLR0;
            stc_dma_intclr0_field_t INTCLR0_f;
        };
        union
        {
            __IO uint32_t INTCLR1;
            stc_dma_intclr1_field_t INTCLR1_f;
        };
        union
        {
            __IO uint32_t CHEN;
            stc_dma_chen_field_t CHEN_f;
        };
        uint8_t RESERVED8[4];
        union
        {
            __IO uint32_t CHSTAT;
            stc_dma_chstat_field_t CHSTAT_f;
        };
        uint8_t RESERVED9[4];
        union
        {
            __IO uint32_t RCFGCTL;
            stc_dma_rcfgctl_field_t RCFGCTL_f;
        };
        uint8_t RESERVED10[16];
        __IO uint32_t SAR0;
        __IO uint32_t DAR0;
        union
        {
            __IO uint32_t DTCTL0;
            stc_dma_dtctl_field_t DTCTL0_f;
        };
        union
        {
            __IO uint32_t RPT0;
            stc_dma_rpt_field_t RPT0_f;
            __IO uint32_t RPTB0;
            stc_dma_rptb_field_t RPTB0_f;
        };
        union
        {
            __IO uint32_t SNSEQCTL0;
            stc_dma_snseqctl_field_t SNSEQCTL0_f;
            __IO uint32_t SNSEQCTLB0;
            stc_dma_snseqctlb_field_t SNSEQCTLB0_f;
        };
        union
        {
            __IO uint32_t DNSEQCTL0;
            stc_dma_dnseqctl_field_t DNSEQCTL0_f;
            __IO uint32_t DNSEQCTLB0;
            stc_dma_dnseqctlb_field_t DNSEQCTLB0_f;
        };
        union
        {
            __IO uint32_t LLP0;
            stc_dma_llp_field_t LLP0_f;
        };
        union
        {
            __IO uint32_t CH0CTL;
            stc_dma_ch0ctl_field_t CH0CTL_f;
        };
        __IO uint32_t MONSAR0;
        __IO uint32_t MONDAR0;
        union
        {
            __IO uint32_t MONDTCTL0;
            stc_dma_mondtctl_field_t MONDTCTL0_f;
        };
        union
        {
            __IO uint32_t MONRPT0;
            stc_dma_monrpt_field_t MONRPT0_f;
        };
        union
        {
            __IO uint32_t MONSNSEQCTL0;
            stc_dma_monsnseqctl_field_t MONSNSEQCTL0_f;
        };
        union
        {
            __IO uint32_t MONDNSEQCTL0;
            stc_dma_mondnseqctl_field_t MONDNSEQCTL0_f;
        };
        uint8_t RESERVED27[8];
        __IO uint32_t SAR1;
        __IO uint32_t DAR1;
        union
        {
            __IO uint32_t DTCTL1;
            stc_dma_dtctl_field_t DTCTL1_f;
        };
        union
        {
            __IO uint32_t RPT1;
            stc_dma_rpt_field_t RPT1_f;
            __IO uint32_t RPTB1;
            stc_dma_rptb_field_t RPTB1_f;
        };
        union
        {
            __IO uint32_t SNSEQCTL1;
            stc_dma_snseqctl_field_t SNSEQCTL1_f;
            __IO uint32_t SNSEQCTLB1;
            stc_dma_snseqctlb_field_t SNSEQCTLB1_f;
        };
        union
        {
            __IO uint32_t DNSEQCTL1;
            stc_dma_dnseqctl_field_t DNSEQCTL1_f;
            __IO uint32_t DNSEQCTLB1;
            stc_dma_dnseqctlb_field_t DNSEQCTLB1_f;
        };
        union
        {
            __IO uint32_t LLP1;
            stc_dma_llp_field_t LLP1_f;
        };
        union
        {
            __IO uint32_t CH1CTL;
            stc_dma_ch1ctl_field_t CH1CTL_f;
        };
        __IO uint32_t MONSAR1;
        __IO uint32_t MONDAR1;
        union
        {
            __IO uint32_t MONDTCTL1;
            stc_dma_mondtctl_field_t MONDTCTL1_f;
        };
        union
        {
            __IO uint32_t MONRPT1;
            stc_dma_monrpt_field_t MONRPT1_f;
        };
        union
        {
            __IO uint32_t MONSNSEQCTL1;
            stc_dma_monsnseqctl_field_t MONSNSEQCTL1_f;
        };
        union
        {
            __IO uint32_t MONDNSEQCTL1;
            stc_dma_mondnseqctl_field_t MONDNSEQCTL1_f;
        };
        uint8_t RESERVED44[8];
        __IO uint32_t SAR2;
        __IO uint32_t DAR2;
        union
        {
            __IO uint32_t DTCTL2;
            stc_dma_dtctl_field_t DTCTL2_f;
        };
        union
        {
            __IO uint32_t RPT2;
            stc_dma_rpt_field_t RPT2_f;
            __IO uint32_t RPTB2;
            stc_dma_rptb_field_t RPTB2_f;
        };
        union
        {
            __IO uint32_t SNSEQCTL2;
            stc_dma_snseqctl_field_t SNSEQCTL2_f;
            __IO uint32_t SNSEQCTLB2;
            stc_dma_snseqctlb_field_t SNSEQCTLB2_f;
        };
        union
        {
            __IO uint32_t DNSEQCTL2;
            stc_dma_dnseqctl_field_t DNSEQCTL2_f;
            __IO uint32_t DNSEQCTLB2;
            stc_dma_dnseqctlb_field_t DNSEQCTLB2_f;
        };
        union
        {
            __IO uint32_t LLP2;
            stc_dma_llp_field_t LLP2_f;
        };
        union
        {
            __IO uint32_t CH2CTL;
            stc_dma_ch2ctl_field_t CH2CTL_f;
        };
        __IO uint32_t MONSAR2;
        __IO uint32_t MONDAR2;
        union
        {
            __IO uint32_t MONDTCTL2;
            stc_dma_mondtctl_field_t MONDTCTL2_f;
        };
        union
        {
            __IO uint32_t MONRPT2;
            stc_dma_monrpt_field_t MONRPT2_f;
        };
        union
        {
            __IO uint32_t MONSNSEQCTL2;
            stc_dma_monsnseqctl_field_t MONSNSEQCTL2_f;
        };
        union
        {
            __IO uint32_t MONDNSEQCTL2;
            stc_dma_mondnseqctl_field_t MONDNSEQCTL2_f;
        };
        uint8_t RESERVED61[8];
        __IO uint32_t SAR3;
        __IO uint32_t DAR3;
        union
        {
            __IO uint32_t DTCTL3;
            stc_dma_dtctl_field_t DTCTL3_f;
        };
        union
        {
            __IO uint32_t RPT3;
            stc_dma_rpt_field_t RPT3_f;
            __IO uint32_t RPTB3;
            stc_dma_rptb_field_t RPTB3_f;
        };
        union
        {
            __IO uint32_t SNSEQCTL3;
            stc_dma_snseqctl_field_t SNSEQCTL3_f;
            __IO uint32_t SNSEQCTLB3;
            stc_dma_snseqctlb_field_t SNSEQCTLB3_f;
        };
        union
        {
            __IO uint32_t DNSEQCTL3;
            stc_dma_dnseqctl_field_t DNSEQCTL3_f;
            __IO uint32_t DNSEQCTLB3;
            stc_dma_dnseqctlb_field_t DNSEQCTLB3_f;
        };
        union
        {
            __IO uint32_t LLP3;
            stc_dma_llp_field_t LLP3_f;
        };
        union
        {
            __IO uint32_t CH3CTL;
            stc_dma_ch3ctl_field_t CH3CTL_f;
        };
        __IO uint32_t MONSAR3;
        __IO uint32_t MONDAR3;
        union
        {
            __IO uint32_t MONDTCTL3;
            stc_dma_mondtctl_field_t MONDTCTL3_f;
        };
        union
        {
            __IO uint32_t MONRPT3;
            stc_dma_monrpt_field_t MONRPT3_f;
        };
        union
        {
            __IO uint32_t MONSNSEQCTL3;
            stc_dma_monsnseqctl_field_t MONSNSEQCTL3_f;
        };
        union
        {
            __IO uint32_t MONDNSEQCTL3;
            stc_dma_mondnseqctl_field_t MONDNSEQCTL3_f;
        };
    } M4_DMA_TypeDef;

    typedef struct
    {
        union
        {
            __IO uint32_t FAPRT;
            stc_efm_faprt_field_t FAPRT_f;
        };
        union
        {
            __IO uint32_t FSTP;
            stc_efm_fstp_field_t FSTP_f;
        };
        union
        {
            __IO uint32_t FRMC;
            stc_efm_frmc_field_t FRMC_f;
        };
        union
        {
            __IO uint32_t FWMC;
            stc_efm_fwmc_field_t FWMC_f;
        };
        union
        {
            __IO uint32_t FSR;
            stc_efm_fsr_field_t FSR_f;
        };
        union
        {
            __IO uint32_t FSCLR;
            stc_efm_fsclr_field_t FSCLR_f;
        };
        union
        {
            __IO uint32_t FITE;
            stc_efm_fite_field_t FITE_f;
        };
        union
        {
            __IO uint32_t FSWP;
            stc_efm_fswp_field_t FSWP_f;
        };
        union
        {
            __IO uint32_t FPMTSW;
            stc_efm_fpmtsw_field_t FPMTSW_f;
        };
        union
        {
            __IO uint32_t FPMTEW;
            stc_efm_fpmtew_field_t FPMTEW_f;
        };
        uint8_t RESERVED10[40];
        __IO uint32_t UQID1;
        __IO uint32_t UQID2;
        __IO uint32_t UQID3;
        uint8_t RESERVED13[164];
        union
        {
            __IO uint32_t MMF_REMPRT;
            stc_efm_mmf_remprt_field_t MMF_REMPRT_f;
        };
        union
        {
            __IO uint32_t MMF_REMCR0;
            stc_efm_mmf_remcr0_field_t MMF_REMCR0_f;
        };
        union
        {
            __IO uint32_t MMF_REMCR1;
            stc_efm_mmf_remcr1_field_t MMF_REMCR1_f;
        };
    } M4_EFM_TypeDef;

    typedef struct
    {
        union
        {
            __IO uint32_t CTL;
            stc_emb_ctl_field_t CTL_f;
        };
        union
        {
            __IO uint32_t PWMLV;
            stc_emb_pwmlv_field_t PWMLV_f;
        };
        union
        {
            __IO uint32_t SOE;
            stc_emb_soe_field_t SOE_f;
        };
        union
        {
            __IO uint32_t STAT;
            stc_emb_stat_field_t STAT_f;
        };
        union
        {
            __IO uint32_t STATCLR;
            stc_emb_statclr_field_t STATCLR_f;
        };
        union
        {
            __IO uint32_t INTEN;
            stc_emb_inten_field_t INTEN_f;
        };
    } M4_EMB_TypeDef;

    typedef struct
    {
        union
        {
            __IO uint32_t LVR;
            stc_fcm_lvr_field_t LVR_f;
        };
        union
        {
            __IO uint32_t UVR;
            stc_fcm_uvr_field_t UVR_f;
        };
        union
        {
            __IO uint32_t CNTR;
            stc_fcm_cntr_field_t CNTR_f;
        };
        union
        {
            __IO uint32_t STR;
            stc_fcm_str_field_t STR_f;
        };
        union
        {
            __IO uint32_t MCCR;
            stc_fcm_mccr_field_t MCCR_f;
        };
        union
        {
            __IO uint32_t RCCR;
            stc_fcm_rccr_field_t RCCR_f;
        };
        union
        {
            __IO uint32_t RIER;
            stc_fcm_rier_field_t RIER_f;
        };
        union
        {
            __IO uint32_t SR;
            stc_fcm_sr_field_t SR_f;
        };
        union
        {
            __IO uint32_t CLR;
            stc_fcm_clr_field_t CLR_f;
        };
    } M4_FCM_TypeDef;

    typedef struct
    {
        union
        {
            __IO uint32_t CR;
            stc_hash_cr_field_t CR_f;
        };
        uint8_t RESERVED1[12];
        __IO uint32_t HR7;
        __IO uint32_t HR6;
        __IO uint32_t HR5;
        __IO uint32_t HR4;
        __IO uint32_t HR3;
        __IO uint32_t HR2;
        __IO uint32_t HR1;
        __IO uint32_t HR0;
        uint8_t RESERVED9[16];
        __IO uint32_t DR15;
        __IO uint32_t DR14;
        __IO uint32_t DR13;
        __IO uint32_t DR12;
        __IO uint32_t DR11;
        __IO uint32_t DR10;
        __IO uint32_t DR9;
        __IO uint32_t DR8;
        __IO uint32_t DR7;
        __IO uint32_t DR6;
        __IO uint32_t DR5;
        __IO uint32_t DR4;
        __IO uint32_t DR3;
        __IO uint32_t DR2;
        __IO uint32_t DR1;
        __IO uint32_t DR0;
    } M4_HASH_TypeDef;

    typedef struct
    {
        union
        {
            __IO uint32_t CR1;
            stc_i2c_cr1_field_t CR1_f;
        };
        union
        {
            __IO uint32_t CR2;
            stc_i2c_cr2_field_t CR2_f;
        };
        union
        {
            __IO uint32_t CR3;
            stc_i2c_cr3_field_t CR3_f;
        };
        uint8_t RESERVED3[4];
        union
        {
            __IO uint32_t SLR0;
            stc_i2c_slr0_field_t SLR0_f;
        };
        union
        {
            __IO uint32_t SLR1;
            stc_i2c_slr1_field_t SLR1_f;
        };
        union
        {
            __IO uint32_t SLTR;
            stc_i2c_sltr_field_t SLTR_f;
        };
        union
        {
            __IO uint32_t SR;
            stc_i2c_sr_field_t SR_f;
        };
        union
        {
            __IO uint32_t CLR;
            stc_i2c_clr_field_t CLR_f;
        };
        union
        {
            __IO uint32_t DTR;
            stc_i2c_dtr_field_t DTR_f;
        };
        union
        {
            __IO uint32_t DRR;
            stc_i2c_drr_field_t DRR_f;
        };
        union
        {
            __IO uint32_t CCR;
            stc_i2c_ccr_field_t CCR_f;
        };
        union
        {
            __IO uint32_t FLTR;
            stc_i2c_fltr_field_t FLTR_f;
        };
    } M4_I2C_TypeDef;

    typedef struct
    {
        union
        {
            __IO uint32_t CTRL;
            stc_i2s_ctrl_field_t CTRL_f;
        };
        union
        {
            __IO uint32_t SR;
            stc_i2s_sr_field_t SR_f;
        };
        union
        {
            __IO uint32_t ER;
            stc_i2s_er_field_t ER_f;
        };
        union
        {
            __IO uint32_t CFGR;
            stc_i2s_cfgr_field_t CFGR_f;
        };
        __IO uint32_t TXBUF;
        __IO uint32_t RXBUF;
        union
        {
            __IO uint32_t PR;
            stc_i2s_pr_field_t PR_f;
        };
    } M4_I2S_TypeDef;

    typedef struct
    {
        union
        {
            __IO uint32_t ICG0;
            stc_icg_icg0_field_t ICG0_f;
        };
        union
        {
            __IO uint32_t ICG1;
            stc_icg_icg1_field_t ICG1_f;
        };
        __IO uint32_t ICG2;
        __IO uint32_t ICG3;
        __IO uint32_t ICG4;
        __IO uint32_t ICG5;
        __IO uint32_t ICG6;
        __IO uint32_t ICG7;
    } M4_ICG_TypeDef;

