MarlinFirmware/Marlin/Marlin/lib/h32_core/main/hdsc32core/common/hc32f46x.h
    typedef struct
    {
        union
        {
            __IO uint32_t FCG0;
            stc_mstp_fcg0_field_t FCG0_f;
        };
        union
        {
            __IO uint32_t FCG1;
            stc_mstp_fcg1_field_t FCG1_f;
        };
        union
        {
            __IO uint32_t FCG2;
            stc_mstp_fcg2_field_t FCG2_f;
        };
        union
        {
            __IO uint32_t FCG3;
            stc_mstp_fcg3_field_t FCG3_f;
        };
        union
        {
            __IO uint32_t FCG0PC;
            stc_mstp_fcg0pc_field_t FCG0PC_f;
        };
    } M4_MSTP_TypeDef;

    typedef struct
    {
        union
        {
            __IO uint16_t CTL;
            stc_ots_ctl_field_t CTL_f;
        };
        union
        {
            __IO uint16_t DR1;
            stc_ots_dr1_field_t DR1_f;
        };
        union
        {
            __IO uint16_t DR2;
            stc_ots_dr2_field_t DR2_f;
        };
        union
        {
            __IO uint16_t ECR;
            stc_ots_ecr_field_t ECR_f;
        };
        union
        {
            __IO uint32_t LPR;
            stc_ots_lpr_field_t LPR_f;
        };
    } M4_OTS_TypeDef;

    typedef struct
    {
        union
        {
            __IO uint32_t USBFS_SYCTLREG;
            stc_peric_usbfs_syctlreg_field_t USBFS_SYCTLREG_f;
        };
        union
        {
            __IO uint32_t SDIOC_SYCTLREG;
            stc_peric_sdioc_syctlreg_field_t SDIOC_SYCTLREG_f;
        };
    } M4_PERIC_TypeDef;

    typedef struct
    {
        union
        {
            __IO uint16_t PIDRA;
            stc_port_pidr_field_t PIDRA_f;
        };
        uint8_t RESERVED1[2];
        union
        {
            __IO uint16_t PODRA;
            stc_port_podr_field_t PODRA_f;
        };
        union
        {
            __IO uint16_t POERA;
            stc_port_poer_field_t POERA_f;
        };
        union
        {
            __IO uint16_t POSRA;
            stc_port_posr_field_t POSRA_f;
        };
        union
        {
            __IO uint16_t PORRA;
            stc_port_porr_field_t PORRA_f;
        };
        union
        {
            __IO uint16_t POTRA;
            stc_port_potr_field_t POTRA_f;
        };
        uint8_t RESERVED6[2];
        union
        {
            __IO uint16_t PIDRB;
            stc_port_pidr_field_t PIDRB_f;
        };
        uint8_t RESERVED7[2];
        union
        {
            __IO uint16_t PODRB;
            stc_port_podr_field_t PODRB_f;
        };
        union
        {
            __IO uint16_t POERB;
            stc_port_poer_field_t POERB_f;
        };
        union
        {
            __IO uint16_t POSRB;
            stc_port_posr_field_t POSRB_f;
        };
        union
        {
            __IO uint16_t PORRB;
            stc_port_porr_field_t PORRB_f;
        };
        union
        {
            __IO uint16_t POTRB;
            stc_port_potr_field_t POTRB_f;
        };
        uint8_t RESERVED12[2];
        union
        {
            __IO uint16_t PIDRC;
            stc_port_pidr_field_t PIDRC_f;
        };
        uint8_t RESERVED13[2];
        union
        {
            __IO uint16_t PODRC;
            stc_port_podr_field_t PODRC_f;
        };
        union
        {
            __IO uint16_t POERC;
            stc_port_poer_field_t POERC_f;
        };
        union
        {
            __IO uint16_t POSRC;
            stc_port_posr_field_t POSRC_f;
        };
        union
        {
            __IO uint16_t PORRC;
            stc_port_porr_field_t PORRC_f;
        };
        union
        {
            __IO uint16_t POTRC;
            stc_port_potr_field_t POTRC_f;
        };
        uint8_t RESERVED18[2];
        union
        {
            __IO uint16_t PIDRD;
            stc_port_pidr_field_t PIDRD_f;
        };
        uint8_t RESERVED19[2];
        union
        {
            __IO uint16_t PODRD;
            stc_port_podr_field_t PODRD_f;
        };
        union
        {
            __IO uint16_t POERD;
            stc_port_poer_field_t POERD_f;
        };
        union
        {
            __IO uint16_t POSRD;
            stc_port_posr_field_t POSRD_f;
        };
        union
        {
            __IO uint16_t PORRD;
            stc_port_porr_field_t PORRD_f;
        };
        union
        {
            __IO uint16_t POTRD;
            stc_port_potr_field_t POTRD_f;
        };
        uint8_t RESERVED24[2];
        union
        {
            __IO uint16_t PIDRE;
            stc_port_pidr_field_t PIDRE_f;
        };
        uint8_t RESERVED25[2];
        union
        {
            __IO uint16_t PODRE;
            stc_port_podr_field_t PODRE_f;
        };
        union
        {
            __IO uint16_t POERE;
            stc_port_poer_field_t POERE_f;
        };
        union
        {
            __IO uint16_t POSRE;
            stc_port_posr_field_t POSRE_f;
        };
        union
        {
            __IO uint16_t PORRE;
            stc_port_porr_field_t PORRE_f;
        };
        union
        {
            __IO uint16_t POTRE;
            stc_port_potr_field_t POTRE_f;
        };
        uint8_t RESERVED30[2];
        union
        {
            __IO uint16_t PIDRH;
            stc_port_pidrh_field_t PIDRH_f;
        };
        uint8_t RESERVED31[2];
        union
        {
            __IO uint16_t PODRH;
            stc_port_podrh_field_t PODRH_f;
        };
        union
        {
            __IO uint16_t POERH;
            stc_port_poerh_field_t POERH_f;
        };
        union
        {
            __IO uint16_t POSRH;
            stc_port_posrh_field_t POSRH_f;
        };
        union
        {
            __IO uint16_t PORRH;
            stc_port_porrh_field_t PORRH_f;
        };
        union
        {
            __IO uint16_t POTRH;
            stc_port_potrh_field_t POTRH_f;
        };
        uint8_t RESERVED36[918];
        union
        {
            __IO uint16_t PSPCR;
            stc_port_pspcr_field_t PSPCR_f;
        };
        uint8_t RESERVED37[2];
        union
        {
            __IO uint16_t PCCR;
            stc_port_pccr_field_t PCCR_f;
        };
        union
        {
            __IO uint16_t PINAER;
            stc_port_pinaer_field_t PINAER_f;
        };
        union
        {
            __IO uint16_t PWPR;
            stc_port_pwpr_field_t PWPR_f;
        };
        uint8_t RESERVED40[2];
        union
        {
            __IO uint16_t PCRA0;
            stc_port_pcr_field_t PCRA0_f;
        };
        union
        {
            __IO uint16_t PFSRA0;
            stc_port_pfsr_field_t PFSRA0_f;
        };
        union
        {
            __IO uint16_t PCRA1;
            stc_port_pcr_field_t PCRA1_f;
        };
        union
        {
            __IO uint16_t PFSRA1;
            stc_port_pfsr_field_t PFSRA1_f;
        };
        union
        {
            __IO uint16_t PCRA2;
            stc_port_pcr_field_t PCRA2_f;
        };
        union
        {
            __IO uint16_t PFSRA2;
            stc_port_pfsr_field_t PFSRA2_f;
        };
        union
        {
            __IO uint16_t PCRA3;
            stc_port_pcr_field_t PCRA3_f;
        };
        union
        {
            __IO uint16_t PFSRA3;
            stc_port_pfsr_field_t PFSRA3_f;
        };
        union
        {
            __IO uint16_t PCRA4;
            stc_port_pcr_field_t PCRA4_f;
        };
        union
        {
            __IO uint16_t PFSRA4;
            stc_port_pfsr_field_t PFSRA4_f;
        };
        union
        {
            __IO uint16_t PCRA5;
            stc_port_pcr_field_t PCRA5_f;
        };
        union
        {
            __IO uint16_t PFSRA5;
            stc_port_pfsr_field_t PFSRA5_f;
        };
        union
        {
            __IO uint16_t PCRA6;
            stc_port_pcr_field_t PCRA6_f;
        };
        union
        {
            __IO uint16_t PFSRA6;
            stc_port_pfsr_field_t PFSRA6_f;
        };
        union
        {
            __IO uint16_t PCRA7;
            stc_port_pcr_field_t PCRA7_f;
        };
        union
        {
            __IO uint16_t PFSRA7;
            stc_port_pfsr_field_t PFSRA7_f;
        };
        union
        {
            __IO uint16_t PCRA8;
            stc_port_pcr_field_t PCRA8_f;
        };
        union
        {
            __IO uint16_t PFSRA8;
            stc_port_pfsr_field_t PFSRA8_f;
        };
        union
        {
            __IO uint16_t PCRA9;
            stc_port_pcr_field_t PCRA9_f;
        };
        union
        {
            __IO uint16_t PFSRA9;
            stc_port_pfsr_field_t PFSRA9_f;
        };
        union
        {
            __IO uint16_t PCRA10;
            stc_port_pcr_field_t PCRA10_f;
        };
        union
        {
            __IO uint16_t PFSRA10;
            stc_port_pfsr_field_t PFSRA10_f;
        };
        union
        {
            __IO uint16_t PCRA11;
            stc_port_pcr_field_t PCRA11_f;
        };
        union
        {
            __IO uint16_t PFSRA11;
            stc_port_pfsr_field_t PFSRA11_f;
        };
        union
        {
            __IO uint16_t PCRA12;
            stc_port_pcr_field_t PCRA12_f;
        };
        union
        {
            __IO uint16_t PFSRA12;
            stc_port_pfsr_field_t PFSRA12_f;
        };
        union
        {
            __IO uint16_t PCRA13;
            stc_port_pcr_field_t PCRA13_f;
        };
        union
        {
            __IO uint16_t PFSRA13;
            stc_port_pfsr_field_t PFSRA13_f;
        };
        union
        {
            __IO uint16_t PCRA14;
            stc_port_pcr_field_t PCRA14_f;
        };
        union
        {
            __IO uint16_t PFSRA14;
            stc_port_pfsr_field_t PFSRA14_f;
        };
        union
        {
            __IO uint16_t PCRA15;
            stc_port_pcr_field_t PCRA15_f;
        };
        union
        {
            __IO uint16_t PFSRA15;
            stc_port_pfsr_field_t PFSRA15_f;
        };
        union
        {
            __IO uint16_t PCRB0;
            stc_port_pcr_field_t PCRB0_f;
        };
        union
        {
            __IO uint16_t PFSRB0;
            stc_port_pfsr_field_t PFSRB0_f;
        };
        union
        {
            __IO uint16_t PCRB1;
            stc_port_pcr_field_t PCRB1_f;
        };
        union
        {
            __IO uint16_t PFSRB1;
            stc_port_pfsr_field_t PFSRB1_f;
        };
        union
        {
            __IO uint16_t PCRB2;
            stc_port_pcr_field_t PCRB2_f;
        };
        union
        {
            __IO uint16_t PFSRB2;
            stc_port_pfsr_field_t PFSRB2_f;
        };
        union
        {
            __IO uint16_t PCRB3;
            stc_port_pcr_field_t PCRB3_f;
        };
        union
        {
            __IO uint16_t PFSRB3;
            stc_port_pfsr_field_t PFSRB3_f;
        };
        union
        {
            __IO uint16_t PCRB4;
            stc_port_pcr_field_t PCRB4_f;
        };
        union
        {
            __IO uint16_t PFSRB4;
            stc_port_pfsr_field_t PFSRB4_f;
        };
        union
        {
            __IO uint16_t PCRB5;
            stc_port_pcr_field_t PCRB5_f;
        };
        union
        {
            __IO uint16_t PFSRB5;
            stc_port_pfsr_field_t PFSRB5_f;
        };
        union
        {
            __IO uint16_t PCRB6;
            stc_port_pcr_field_t PCRB6_f;
        };
        union
        {
            __IO uint16_t PFSRB6;
            stc_port_pfsr_field_t PFSRB6_f;
        };
        union
        {
            __IO uint16_t PCRB7;
            stc_port_pcr_field_t PCRB7_f;
        };
        union
        {
            __IO uint16_t PFSRB7;
            stc_port_pfsr_field_t PFSRB7_f;
        };
        union
        {
            __IO uint16_t PCRB8;
            stc_port_pcr_field_t PCRB8_f;
        };
        union
        {
            __IO uint16_t PFSRB8;
            stc_port_pfsr_field_t PFSRB8_f;
        };
        union
        {
            __IO uint16_t PCRB9;
            stc_port_pcr_field_t PCRB9_f;
        };
        union
        {
            __IO uint16_t PFSRB9;
            stc_port_pfsr_field_t PFSRB9_f;
        };
        union
        {
            __IO uint16_t PCRB10;
            stc_port_pcr_field_t PCRB10_f;
        };
        union
        {
            __IO uint16_t PFSRB10;
            stc_port_pfsr_field_t PFSRB10_f;
        };
        union
        {
            __IO uint16_t PCRB11;
            stc_port_pcr_field_t PCRB11_f;
        };
        union
        {
            __IO uint16_t PFSRB11;
            stc_port_pfsr_field_t PFSRB11_f;
        };
        union
        {
            __IO uint16_t PCRB12;
            stc_port_pcr_field_t PCRB12_f;
        };
        union
        {
            __IO uint16_t PFSRB12;
            stc_port_pfsr_field_t PFSRB12_f;
        };
        union
        {
            __IO uint16_t PCRB13;
            stc_port_pcr_field_t PCRB13_f;
        };
        union
        {
            __IO uint16_t PFSRB13;
            stc_port_pfsr_field_t PFSRB13_f;
        };
        union
        {
            __IO uint16_t PCRB14;
            stc_port_pcr_field_t PCRB14_f;
        };
        union
        {
            __IO uint16_t PFSRB14;
            stc_port_pfsr_field_t PFSRB14_f;
        };
        union
        {
            __IO uint16_t PCRB15;
            stc_port_pcr_field_t PCRB15_f;
        };
        union
        {
            __IO uint16_t PFSRB15;
            stc_port_pfsr_field_t PFSRB15_f;
        };
        union
        {
            __IO uint16_t PCRC0;
            stc_port_pcr_field_t PCRC0_f;
        };
        union
        {
            __IO uint16_t PFSRC0;
            stc_port_pfsr_field_t PFSRC0_f;
        };
        union
        {
            __IO uint16_t PCRC1;
            stc_port_pcr_field_t PCRC1_f;
        };
        union
        {
            __IO uint16_t PFSRC1;
            stc_port_pfsr_field_t PFSRC1_f;
        };
        union
        {
            __IO uint16_t PCRC2;
            stc_port_pcr_field_t PCRC2_f;
        };
        union
        {
            __IO uint16_t PFSRC2;
            stc_port_pfsr_field_t PFSRC2_f;
        };
        union
        {
            __IO uint16_t PCRC3;
            stc_port_pcr_field_t PCRC3_f;
        };
        union
        {
            __IO uint16_t PFSRC3;
            stc_port_pfsr_field_t PFSRC3_f;
        };
        union
        {
            __IO uint16_t PCRC4;
            stc_port_pcr_field_t PCRC4_f;
        };
        union
        {
            __IO uint16_t PFSRC4;
            stc_port_pfsr_field_t PFSRC4_f;
        };
        union
        {
            __IO uint16_t PCRC5;
            stc_port_pcr_field_t PCRC5_f;
        };
        union
        {
            __IO uint16_t PFSRC5;
            stc_port_pfsr_field_t PFSRC5_f;
        };
        union
        {
            __IO uint16_t PCRC6;
            stc_port_pcr_field_t PCRC6_f;
        };
        union
        {
            __IO uint16_t PFSRC6;
            stc_port_pfsr_field_t PFSRC6_f;
        };
        union
        {
            __IO uint16_t PCRC7;
            stc_port_pcr_field_t PCRC7_f;
        };
        union
        {
            __IO uint16_t PFSRC7;
            stc_port_pfsr_field_t PFSRC7_f;
        };
        union
        {
            __IO uint16_t PCRC8;
            stc_port_pcr_field_t PCRC8_f;
        };
        union
        {
            __IO uint16_t PFSRC8;
            stc_port_pfsr_field_t PFSRC8_f;
        };
        union
        {
            __IO uint16_t PCRC9;
            stc_port_pcr_field_t PCRC9_f;
        };
        union
        {
            __IO uint16_t PFSRC9;
            stc_port_pfsr_field_t PFSRC9_f;
        };
        union
        {
            __IO uint16_t PCRC10;
            stc_port_pcr_field_t PCRC10_f;
        };
        union
        {
            __IO uint16_t PFSRC10;
            stc_port_pfsr_field_t PFSRC10_f;
        };
        union
        {
            __IO uint16_t PCRC11;
            stc_port_pcr_field_t PCRC11_f;
        };
        union
        {
            __IO uint16_t PFSRC11;
            stc_port_pfsr_field_t PFSRC11_f;
        };
        union
        {
            __IO uint16_t PCRC12;
            stc_port_pcr_field_t PCRC12_f;
        };
        union
        {
            __IO uint16_t PFSRC12;
            stc_port_pfsr_field_t PFSRC12_f;
        };
        union
        {
            __IO uint16_t PCRC13;
            stc_port_pcr_field_t PCRC13_f;
        };
        union
        {
            __IO uint16_t PFSRC13;
            stc_port_pfsr_field_t PFSRC13_f;
        };
        union
        {
            __IO uint16_t PCRC14;
            stc_port_pcr_field_t PCRC14_f;
        };
        union
        {
            __IO uint16_t PFSRC14;
            stc_port_pfsr_field_t PFSRC14_f;
        };
        union
        {
            __IO uint16_t PCRC15;
            stc_port_pcr_field_t PCRC15_f;
        };
        union
        {
            __IO uint16_t PFSRC15;
            stc_port_pfsr_field_t PFSRC15_f;
        };
        union
        {
            __IO uint16_t PCRD0;
            stc_port_pcr_field_t PCRD0_f;
        };
        union
        {
            __IO uint16_t PFSRD0;
            stc_port_pfsr_field_t PFSRD0_f;
        };
        union
        {
            __IO uint16_t PCRD1;
            stc_port_pcr_field_t PCRD1_f;
        };
        union
        {
            __IO uint16_t PFSRD1;
            stc_port_pfsr_field_t PFSRD1_f;
        };
        union
        {
            __IO uint16_t PCRD2;
            stc_port_pcr_field_t PCRD2_f;
        };
        union
        {
            __IO uint16_t PFSRD2;
            stc_port_pfsr_field_t PFSRD2_f;
        };
        union
        {
            __IO uint16_t PCRD3;
            stc_port_pcr_field_t PCRD3_f;
        };
        union
        {
            __IO uint16_t PFSRD3;
            stc_port_pfsr_field_t PFSRD3_f;
        };
        union
        {
            __IO uint16_t PCRD4;
            stc_port_pcr_field_t PCRD4_f;
        };
        union
        {
            __IO uint16_t PFSRD4;
            stc_port_pfsr_field_t PFSRD4_f;
        };
        union
        {
            __IO uint16_t PCRD5;
            stc_port_pcr_field_t PCRD5_f;
        };
        union
        {
            __IO uint16_t PFSRD5;
            stc_port_pfsr_field_t PFSRD5_f;
        };
        union
        {
            __IO uint16_t PCRD6;
            stc_port_pcr_field_t PCRD6_f;
        };
        union
        {
            __IO uint16_t PFSRD6;
            stc_port_pfsr_field_t PFSRD6_f;
        };
        union
        {
            __IO uint16_t PCRD7;
            stc_port_pcr_field_t PCRD7_f;
        };
        union
        {
            __IO uint16_t PFSRD7;
            stc_port_pfsr_field_t PFSRD7_f;
        };
        union
        {
            __IO uint16_t PCRD8;
            stc_port_pcr_field_t PCRD8_f;
        };
        union
        {
            __IO uint16_t PFSRD8;
            stc_port_pfsr_field_t PFSRD8_f;
        };
        union
        {
            __IO uint16_t PCRD9;
            stc_port_pcr_field_t PCRD9_f;
        };
        union
        {
            __IO uint16_t PFSRD9;
            stc_port_pfsr_field_t PFSRD9_f;
        };
        union
        {
            __IO uint16_t PCRD10;
            stc_port_pcr_field_t PCRD10_f;
        };
        union
        {
            __IO uint16_t PFSRD10;
            stc_port_pfsr_field_t PFSRD10_f;
        };
        union
        {
            __IO uint16_t PCRD11;
            stc_port_pcr_field_t PCRD11_f;
        };
        union
        {
            __IO uint16_t PFSRD11;
            stc_port_pfsr_field_t PFSRD11_f;
        };
        union
        {
            __IO uint16_t PCRD12;
            stc_port_pcr_field_t PCRD12_f;
        };
        union
        {
            __IO uint16_t PFSRD12;
            stc_port_pfsr_field_t PFSRD12_f;
        };
        union
        {
            __IO uint16_t PCRD13;
            stc_port_pcr_field_t PCRD13_f;
        };
        union
        {
            __IO uint16_t PFSRD13;
            stc_port_pfsr_field_t PFSRD13_f;
        };
        union
        {
            __IO uint16_t PCRD14;
            stc_port_pcr_field_t PCRD14_f;
        };
        union
        {
            __IO uint16_t PFSRD14;
            stc_port_pfsr_field_t PFSRD14_f;
        };
        union
        {
            __IO uint16_t PCRD15;
            stc_port_pcr_field_t PCRD15_f;
        };
        union
        {
            __IO uint16_t PFSRD15;
            stc_port_pfsr_field_t PFSRD15_f;
        };
        union
        {
            __IO uint16_t PCRE0;
            stc_port_pcr_field_t PCRE0_f;
        };
        union
        {
            __IO uint16_t PFSRE0;
            stc_port_pfsr_field_t PFSRE0_f;
        };
        union
        {
            __IO uint16_t PCRE1;
            stc_port_pcr_field_t PCRE1_f;
        };
        union
        {
            __IO uint16_t PFSRE1;
            stc_port_pfsr_field_t PFSRE1_f;
        };
        union
        {
            __IO uint16_t PCRE2;
            stc_port_pcr_field_t PCRE2_f;
        };
        union
        {
            __IO uint16_t PFSRE2;
            stc_port_pfsr_field_t PFSRE2_f;
        };
        union
        {
            __IO uint16_t PCRE3;
            stc_port_pcr_field_t PCRE3_f;
        };
        union
        {
            __IO uint16_t PFSRE3;
            stc_port_pfsr_field_t PFSRE3_f;
        };
        union
        {
            __IO uint16_t PCRE4;
            stc_port_pcr_field_t PCRE4_f;
        };
        union
        {
            __IO uint16_t PFSRE4;
            stc_port_pfsr_field_t PFSRE4_f;
        };
        union
        {
            __IO uint16_t PCRE5;
            stc_port_pcr_field_t PCRE5_f;
        };
        union
        {
            __IO uint16_t PFSRE5;
            stc_port_pfsr_field_t PFSRE5_f;
        };
        union
        {
            __IO uint16_t PCRE6;
            stc_port_pcr_field_t PCRE6_f;
        };
        union
        {
            __IO uint16_t PFSRE6;
            stc_port_pfsr_field_t PFSRE6_f;
        };
        union
        {
            __IO uint16_t PCRE7;
            stc_port_pcr_field_t PCRE7_f;
        };
        union
        {
            __IO uint16_t PFSRE7;
            stc_port_pfsr_field_t PFSRE7_f;
        };
        union
        {
            __IO uint16_t PCRE8;
            stc_port_pcr_field_t PCRE8_f;
        };
        union
        {
            __IO uint16_t PFSRE8;
            stc_port_pfsr_field_t PFSRE8_f;
        };
        union
        {
            __IO uint16_t PCRE9;
            stc_port_pcr_field_t PCRE9_f;
        };
        union
        {
            __IO uint16_t PFSRE9;
            stc_port_pfsr_field_t PFSRE9_f;
        };
        union
        {
            __IO uint16_t PCRE10;
            stc_port_pcr_field_t PCRE10_f;
        };
        union
        {
            __IO uint16_t PFSRE10;
            stc_port_pfsr_field_t PFSRE10_f;
        };
        union
        {
            __IO uint16_t PCRE11;
            stc_port_pcr_field_t PCRE11_f;
        };
        union
        {
            __IO uint16_t PFSRE11;
            stc_port_pfsr_field_t PFSRE11_f;
        };
        union
        {
            __IO uint16_t PCRE12;
            stc_port_pcr_field_t PCRE12_f;
        };
        union
        {
            __IO uint16_t PFSRE12;
            stc_port_pfsr_field_t PFSRE12_f;
        };
        union
        {
            __IO uint16_t PCRE13;
            stc_port_pcr_field_t PCRE13_f;
        };
        union
        {
            __IO uint16_t PFSRE13;
            stc_port_pfsr_field_t PFSRE13_f;
        };
        union
        {
            __IO uint16_t PCRE14;
