MarlinFirmware/Marlin/Marlin/lib/h32_core/main/hdsc32core/common/hc32f46x.h
            stc_port_pcr_field_t PCRE14_f;
        };
        union
        {
            __IO uint16_t PFSRE14;
            stc_port_pfsr_field_t PFSRE14_f;
        };
        union
        {
            __IO uint16_t PCRE15;
            stc_port_pcr_field_t PCRE15_f;
        };
        union
        {
            __IO uint16_t PFSRE15;
            stc_port_pfsr_field_t PFSRE15_f;
        };
        union
        {
            __IO uint16_t PCRH0;
            stc_port_pcr_field_t PCRH0_f;
        };
        union
        {
            __IO uint16_t PFSRH0;
            stc_port_pfsr_field_t PFSRH0_f;
        };
        union
        {
            __IO uint16_t PCRH1;
            stc_port_pcr_field_t PCRH1_f;
        };
        union
        {
            __IO uint16_t PFSRH1;
            stc_port_pfsr_field_t PFSRH1_f;
        };
        union
        {
            __IO uint16_t PCRH2;
            stc_port_pcr_field_t PCRH2_f;
        };
        union
        {
            __IO uint16_t PFSRH2;
            stc_port_pfsr_field_t PFSRH2_f;
        };
    } M4_PORT_TypeDef;

    typedef struct
    {
        union
        {
            __IO uint32_t CR;
            stc_qspi_cr_field_t CR_f;
        };
        union
        {
            __IO uint32_t CSCR;
            stc_qspi_cscr_field_t CSCR_f;
        };
        union
        {
            __IO uint32_t FCR;
            stc_qspi_fcr_field_t FCR_f;
        };
        union
        {
            __IO uint32_t SR;
            stc_qspi_sr_field_t SR_f;
        };
        union
        {
            __IO uint32_t DCOM;
            stc_qspi_dcom_field_t DCOM_f;
        };
        union
        {
            __IO uint32_t CCMD;
            stc_qspi_ccmd_field_t CCMD_f;
        };
        union
        {
            __IO uint32_t XCMD;
            stc_qspi_xcmd_field_t XCMD_f;
        };
        uint8_t RESERVED7[8];
        union
        {
            __IO uint32_t SR2;
            stc_qspi_sr2_field_t SR2_f;
        };
        uint8_t RESERVED8[2012];
        union
        {
            __IO uint32_t EXAR;
            stc_qspi_exar_field_t EXAR_f;
        };
    } M4_QSPI_TypeDef;

    typedef struct
    {
        union
        {
            __IO uint32_t CR0;
            stc_rtc_cr0_field_t CR0_f;
        };
        union
        {
            __IO uint32_t CR1;
            stc_rtc_cr1_field_t CR1_f;
        };
        union
        {
            __IO uint32_t CR2;
            stc_rtc_cr2_field_t CR2_f;
        };
        union
        {
            __IO uint32_t CR3;
            stc_rtc_cr3_field_t CR3_f;
        };
        union
        {
            __IO uint32_t SEC;
            stc_rtc_sec_field_t SEC_f;
        };
        union
        {
            __IO uint32_t MIN;
            stc_rtc_min_field_t MIN_f;
        };
        union
        {
            __IO uint32_t HOUR;
            stc_rtc_hour_field_t HOUR_f;
        };
        union
        {
            __IO uint32_t WEEK;
            stc_rtc_week_field_t WEEK_f;
        };
        union
        {
            __IO uint32_t DAY;
            stc_rtc_day_field_t DAY_f;
        };
        union
        {
            __IO uint32_t MON;
            stc_rtc_mon_field_t MON_f;
        };
        union
        {
            __IO uint32_t YEAR;
            stc_rtc_year_field_t YEAR_f;
        };
        union
        {
            __IO uint32_t ALMMIN;
            stc_rtc_almmin_field_t ALMMIN_f;
        };
        union
        {
            __IO uint32_t ALMHOUR;
            stc_rtc_almhour_field_t ALMHOUR_f;
        };
        union
        {
            __IO uint32_t ALMWEEK;
            stc_rtc_almweek_field_t ALMWEEK_f;
        };
        union
        {
            __IO uint32_t ERRCRH;
            stc_rtc_errcrh_field_t ERRCRH_f;
        };
        union
        {
            __IO uint32_t ERRCRL;
            stc_rtc_errcrl_field_t ERRCRL_f;
        };
    } M4_RTC_TypeDef;

    typedef struct
    {
        uint8_t RESERVED0[4];
        union
        {
            __IO uint16_t BLKSIZE;
            stc_sdioc_blksize_field_t BLKSIZE_f;
        };
        __IO uint16_t BLKCNT;
        __IO uint16_t ARG0;
        __IO uint16_t ARG1;
        union
        {
            __IO uint16_t TRANSMODE;
            stc_sdioc_transmode_field_t TRANSMODE_f;
        };
        union
        {
            __IO uint16_t CMD;
            stc_sdioc_cmd_field_t CMD_f;
        };
        __IO uint16_t RESP0;
        __IO uint16_t RESP1;
        __IO uint16_t RESP2;
        __IO uint16_t RESP3;
        __IO uint16_t RESP4;
        __IO uint16_t RESP5;
        __IO uint16_t RESP6;
        __IO uint16_t RESP7;
        __IO uint16_t BUF0;
        __IO uint16_t BUF1;
        union
        {
            __IO uint32_t PSTAT;
            stc_sdioc_pstat_field_t PSTAT_f;
        };
        union
        {
            __IO uint8_t HOSTCON;
            stc_sdioc_hostcon_field_t HOSTCON_f;
        };
        union
        {
            __IO uint8_t PWRCON;
            stc_sdioc_pwrcon_field_t PWRCON_f;
        };
        union
        {
            __IO uint8_t BLKGPCON;
            stc_sdioc_blkgpcon_field_t BLKGPCON_f;
        };
        uint8_t RESERVED20[1];
        union
        {
            __IO uint16_t CLKCON;
            stc_sdioc_clkcon_field_t CLKCON_f;
        };
        union
        {
            __IO uint8_t TOUTCON;
            stc_sdioc_toutcon_field_t TOUTCON_f;
        };
        union
        {
            __IO uint8_t SFTRST;
            stc_sdioc_sftrst_field_t SFTRST_f;
        };
        union
        {
            __IO uint16_t NORINTST;
            stc_sdioc_norintst_field_t NORINTST_f;
        };
        union
        {
            __IO uint16_t ERRINTST;
            stc_sdioc_errintst_field_t ERRINTST_f;
        };
        union
        {
            __IO uint16_t NORINTSTEN;
            stc_sdioc_norintsten_field_t NORINTSTEN_f;
        };
        union
        {
            __IO uint16_t ERRINTSTEN;
            stc_sdioc_errintsten_field_t ERRINTSTEN_f;
        };
        union
        {
            __IO uint16_t NORINTSGEN;
            stc_sdioc_norintsgen_field_t NORINTSGEN_f;
        };
        union
        {
            __IO uint16_t ERRINTSGEN;
            stc_sdioc_errintsgen_field_t ERRINTSGEN_f;
        };
        union
        {
            __IO uint16_t ATCERRST;
            stc_sdioc_atcerrst_field_t ATCERRST_f;
        };
        uint8_t RESERVED30[18];
        union
        {
            __IO uint16_t FEA;
            stc_sdioc_fea_field_t FEA_f;
        };
        union
        {
            __IO uint16_t FEE;
            stc_sdioc_fee_field_t FEE_f;
        };
    } M4_SDIOC_TypeDef;

    typedef struct
    {
        __IO uint32_t DR;
        union
        {
            __IO uint32_t CR1;
            stc_spi_cr1_field_t CR1_f;
        };
        uint8_t RESERVED2[4];
        union
        {
            __IO uint32_t CFG1;
            stc_spi_cfg1_field_t CFG1_f;
        };
        uint8_t RESERVED3[4];
        union
        {
            __IO uint32_t SR;
            stc_spi_sr_field_t SR_f;
        };
        union
        {
            __IO uint32_t CFG2;
            stc_spi_cfg2_field_t CFG2_f;
        };
    } M4_SPI_TypeDef;

    typedef struct
    {
        union
        {
            __IO uint32_t WTCR;
            stc_sramc_wtcr_field_t WTCR_f;
        };
        union
        {
            __IO uint32_t WTPR;
            stc_sramc_wtpr_field_t WTPR_f;
        };
        union
        {
            __IO uint32_t CKCR;
            stc_sramc_ckcr_field_t CKCR_f;
        };
        union
        {
            __IO uint32_t CKPR;
            stc_sramc_ckpr_field_t CKPR_f;
        };
        union
        {
            __IO uint32_t CKSR;
            stc_sramc_cksr_field_t CKSR_f;
        };
    } M4_SRAMC_TypeDef;

    typedef struct
    {
        uint8_t RESERVED0[4];
        union
        {
            __IO uint32_t SR;
            stc_swdt_sr_field_t SR_f;
        };
        union
        {
            __IO uint32_t RR;
            stc_swdt_rr_field_t RR_f;
        };
    } M4_SWDT_TypeDef;

    typedef struct
    {
        uint8_t RESERVED0[12];
        union
        {
            __IO uint16_t PWR_STPMCR;
            stc_sysreg_pwr_stpmcr_field_t PWR_STPMCR_f;
        };
        uint8_t RESERVED1[2];
        union
        {
            __IO uint16_t CMU_PERICKSEL;
            stc_sysreg_cmu_pericksel_field_t CMU_PERICKSEL_f;
        };
        union
        {
            __IO uint16_t CMU_I2SCKSEL;
            stc_sysreg_cmu_i2scksel_field_t CMU_I2SCKSEL_f;
        };
        union
        {
            __IO uint32_t PWR_RAMPC0;
            stc_sysreg_pwr_rampc0_field_t PWR_RAMPC0_f;
        };
        union
        {
            __IO uint32_t PWR_RAMOPM;
            stc_sysreg_pwr_ramopm_field_t PWR_RAMOPM_f;
        };
        union
        {
            __IO uint32_t MPU_IPPR;
            stc_sysreg_mpu_ippr_field_t MPU_IPPR_f;
        };
        union
        {
            __IO uint32_t CMU_SCFGR;
            stc_sysreg_cmu_scfgr_field_t CMU_SCFGR_f;
        };
        union
        {
            __IO uint8_t CMU_UFSCKCFGR;
            stc_sysreg_cmu_ufsckcfgr_field_t CMU_UFSCKCFGR_f;
        };
        uint8_t RESERVED8[1];
        union
        {
            __IO uint8_t CMU_CKSWR;
            stc_sysreg_cmu_ckswr_field_t CMU_CKSWR_f;
        };
        uint8_t RESERVED9[3];
        union
        {
            __IO uint8_t CMU_PLLCR;
            stc_sysreg_cmu_pllcr_field_t CMU_PLLCR_f;
        };
        uint8_t RESERVED10[3];
        union
        {
            __IO uint8_t CMU_UPLLCR;
            stc_sysreg_cmu_upllcr_field_t CMU_UPLLCR_f;
        };
        uint8_t RESERVED11[3];
        union
        {
            __IO uint8_t CMU_XTALCR;
            stc_sysreg_cmu_xtalcr_field_t CMU_XTALCR_f;
        };
        uint8_t RESERVED12[3];
        union
        {
            __IO uint8_t CMU_HRCCR;
            stc_sysreg_cmu_hrccr_field_t CMU_HRCCR_f;
        };
        uint8_t RESERVED13[1];
        union
        {
            __IO uint8_t CMU_MRCCR;
            stc_sysreg_cmu_mrccr_field_t CMU_MRCCR_f;
        };
        uint8_t RESERVED14[3];
        union
        {
            __IO uint8_t CMU_OSCSTBSR;
            stc_sysreg_cmu_oscstbsr_field_t CMU_OSCSTBSR_f;
        };
        union
        {
            __IO uint8_t CMU_MCO1CFGR;
            stc_sysreg_cmu_mco1cfgr_field_t CMU_MCO1CFGR_f;
        };
        union
        {
            __IO uint8_t CMU_MCO2CFGR;
            stc_sysreg_cmu_mco2cfgr_field_t CMU_MCO2CFGR_f;
        };
        union
        {
            __IO uint8_t CMU_TPIUCKCFGR;
            stc_sysreg_cmu_tpiuckcfgr_field_t CMU_TPIUCKCFGR_f;
        };
        union
        {
            __IO uint8_t CMU_XTALSTDCR;
            stc_sysreg_cmu_xtalstdcr_field_t CMU_XTALSTDCR_f;
        };
        union
        {
            __IO uint8_t CMU_XTALSTDSR;
            stc_sysreg_cmu_xtalstdsr_field_t CMU_XTALSTDSR_f;
        };
        uint8_t RESERVED20[31];
        __IO uint8_t CMU_MRCTRM;
        __IO uint8_t CMU_HRCTRM;
        uint8_t RESERVED22[63];
        union
        {
            __IO uint8_t CMU_XTALSTBCR;
            stc_sysreg_cmu_xtalstbcr_field_t CMU_XTALSTBCR_f;
        };
        uint8_t RESERVED23[29];
        union
        {
            __IO uint16_t RMU_RSTF0;
            stc_sysreg_rmu_rstf0_field_t RMU_RSTF0_f;
        };
        uint8_t RESERVED24[30];
        union
        {
            __IO uint8_t PWR_PVDICR;
            stc_sysreg_pwr_pvdicr_field_t PWR_PVDICR_f;
        };
        union
        {
            __IO uint8_t PWR_PVDDSR;
            stc_sysreg_pwr_pvddsr_field_t PWR_PVDDSR_f;
        };
        uint8_t RESERVED26[30];
        union
        {
            __IO uint32_t CMU_PLLCFGR;
            stc_sysreg_cmu_pllcfgr_field_t CMU_PLLCFGR_f;
        };
        union
        {
            __IO uint32_t CMU_UPLLCFGR;
            stc_sysreg_cmu_upllcfgr_field_t CMU_UPLLCFGR_f;
        };
        uint8_t RESERVED28[758];
        union
        {
            __IO uint16_t PWR_FPRC;
            stc_sysreg_pwr_fprc_field_t PWR_FPRC_f;
        };
        union
        {
            __IO uint8_t PWR_PWRC0;
            stc_sysreg_pwr_pwrc0_field_t PWR_PWRC0_f;
        };
        union
        {
            __IO uint8_t PWR_PWRC1;
            stc_sysreg_pwr_pwrc1_field_t PWR_PWRC1_f;
        };
        union
        {
            __IO uint8_t PWR_PWRC2;
            stc_sysreg_pwr_pwrc2_field_t PWR_PWRC2_f;
        };
        union
        {
            __IO uint8_t PWR_PWRC3;
            stc_sysreg_pwr_pwrc3_field_t PWR_PWRC3_f;
        };
        union
        {
            __IO uint8_t PWR_PDWKE0;
            stc_sysreg_pwr_pdwke0_field_t PWR_PDWKE0_f;
        };
        union
        {
            __IO uint8_t PWR_PDWKE1;
            stc_sysreg_pwr_pdwke1_field_t PWR_PDWKE1_f;
        };
        union
        {
            __IO uint8_t PWR_PDWKE2;
            stc_sysreg_pwr_pdwke2_field_t PWR_PDWKE2_f;
        };
        union
        {
            __IO uint8_t PWR_PDWKES;
            stc_sysreg_pwr_pdwkes_field_t PWR_PDWKES_f;
        };
        union
        {
            __IO uint8_t PWR_PDWKF0;
            stc_sysreg_pwr_pdwkf0_field_t PWR_PDWKF0_f;
        };
        union
        {
            __IO uint8_t PWR_PDWKF1;
            stc_sysreg_pwr_pdwkf1_field_t PWR_PDWKF1_f;
        };
        union
        {
            __IO uint8_t PWR_PWCMR;
            stc_sysreg_pwr_pwcmr_field_t PWR_PWCMR_f;
        };
        uint8_t RESERVED40[4];
        __IO uint8_t PWR_MDSWCR;
        union
        {
            __IO uint8_t CMU_XTALCFGR;
            stc_sysreg_cmu_xtalcfgr_field_t CMU_XTALCFGR_f;
        };
        uint8_t RESERVED42[1];
        union
        {
            __IO uint8_t PWR_PVDCR0;
            stc_sysreg_pwr_pvdcr0_field_t PWR_PVDCR0_f;
        };
        union
        {
            __IO uint8_t PWR_PVDCR1;
            stc_sysreg_pwr_pvdcr1_field_t PWR_PVDCR1_f;
        };
        union
        {
            __IO uint8_t PWR_PVDFCR;
            stc_sysreg_pwr_pvdfcr_field_t PWR_PVDFCR_f;
        };
        union
        {
            __IO uint8_t PWR_PVDLCR;
            stc_sysreg_pwr_pvdlcr_field_t PWR_PVDLCR_f;
        };
        uint8_t RESERVED46[10];
        union
        {
            __IO uint8_t CMU_XTAL32CR;
            stc_sysreg_cmu_xtal32cr_field_t CMU_XTAL32CR_f;
        };
        union
        {
            __IO uint8_t CMU_XTAL32CFGR;
            stc_sysreg_cmu_xtal32cfgr_field_t CMU_XTAL32CFGR_f;
        };
        uint8_t RESERVED48[3];
        union
        {
            __IO uint8_t CMU_XTAL32NFR;
            stc_sysreg_cmu_xtal32nfr_field_t CMU_XTAL32NFR_f;
        };
        uint8_t RESERVED49[1];
        union
        {
            __IO uint8_t CMU_LRCCR;
            stc_sysreg_cmu_lrccr_field_t CMU_LRCCR_f;
        };
        uint8_t RESERVED50[1];
        __IO uint8_t CMU_LRCTRM;
        uint8_t RESERVED51[1];
        union
        {
            __IO uint8_t PWR_XTAL32CS;
            stc_sysreg_pwr_xtal32cs_field_t PWR_XTAL32CS_f;
        };
    } M4_SYSREG_TypeDef;

    typedef struct
    {
        union
        {
            __IO uint32_t CNTAR;
            stc_tmr0_cntar_field_t CNTAR_f;
        };
        union
        {
            __IO uint32_t CNTBR;
            stc_tmr0_cntbr_field_t CNTBR_f;
        };
        union
        {
            __IO uint32_t CMPAR;
            stc_tmr0_cmpar_field_t CMPAR_f;
        };
        union
        {
            __IO uint32_t CMPBR;
            stc_tmr0_cmpbr_field_t CMPBR_f;
        };
        union
        {
            __IO uint32_t BCONR;
            stc_tmr0_bconr_field_t BCONR_f;
        };
        union
        {
            __IO uint32_t STFLR;
            stc_tmr0_stflr_field_t STFLR_f;
        };
    } M4_TMR0_TypeDef;

    typedef struct
    {
        uint8_t RESERVED0[2];
        __IO uint16_t OCCRUH;
        uint8_t RESERVED1[2];
        __IO uint16_t OCCRUL;
        uint8_t RESERVED2[2];
        __IO uint16_t OCCRVH;
        uint8_t RESERVED3[2];
        __IO uint16_t OCCRVL;
        uint8_t RESERVED4[2];
        __IO uint16_t OCCRWH;
        uint8_t RESERVED5[2];
        __IO uint16_t OCCRWL;
        union
        {
            __IO uint16_t OCSRU;
            stc_tmr4_ocsr_field_t OCSRU_f;
        };
        union
        {
            __IO uint16_t OCERU;
            stc_tmr4_ocer_field_t OCERU_f;
        };
        union
        {
            __IO uint16_t OCSRV;
            stc_tmr4_ocsr_field_t OCSRV_f;
        };
        union
        {
            __IO uint16_t OCERV;
            stc_tmr4_ocer_field_t OCERV_f;
        };
        union
        {
            __IO uint16_t OCSRW;
            stc_tmr4_ocsr_field_t OCSRW_f;
        };
        union
        {
            __IO uint16_t OCERW;
            stc_tmr4_ocer_field_t OCERW_f;
        };
        union
        {
            __IO uint16_t OCMRHUH;
            stc_tmr4_ocmrh_field_t OCMRHUH_f;
        };
        uint8_t RESERVED13[2];
        union
        {
            __IO uint32_t OCMRLUL;
            stc_tmr4_ocmrl_field_t OCMRLUL_f;
        };
        union
        {
            __IO uint16_t OCMRHVH;
            stc_tmr4_ocmrh_field_t OCMRHVH_f;
        };
        uint8_t RESERVED15[2];
        union
        {
            __IO uint32_t OCMRLVL;
            stc_tmr4_ocmrl_field_t OCMRLVL_f;
        };
        union
        {
            __IO uint16_t OCMRHWH;
            stc_tmr4_ocmrh_field_t OCMRHWH_f;
        };
        uint8_t RESERVED17[2];
        union
        {
            __IO uint32_t OCMRLWL;
            stc_tmr4_ocmrl_field_t OCMRLWL_f;
        };
        uint8_t RESERVED18[6];
        __IO uint16_t CPSR;
        uint8_t RESERVED19[2];
        __IO uint16_t CNTR;
        union
        {
            __IO uint16_t CCSR;
            stc_tmr4_ccsr_field_t CCSR_f;
        };
        union
        {
            __IO uint16_t CVPR;
            stc_tmr4_cvpr_field_t CVPR_f;
        };
        uint8_t RESERVED22[54];
        __IO uint16_t PFSRU;
        __IO uint16_t PDARU;
        __IO uint16_t PDBRU;
        uint8_t RESERVED25[2];
        __IO uint16_t PFSRV;
        __IO uint16_t PDARV;
        __IO uint16_t PDBRV;
        uint8_t RESERVED28[2];
        __IO uint16_t PFSRW;
        __IO uint16_t PDARW;
        __IO uint16_t PDBRW;
        union
        {
            __IO uint16_t POCRU;
            stc_tmr4_pocr_field_t POCRU_f;
        };
        uint8_t RESERVED32[2];
        union
        {
            __IO uint16_t POCRV;
            stc_tmr4_pocr_field_t POCRV_f;
        };
        uint8_t RESERVED33[2];
        union
        {
            __IO uint16_t POCRW;
            stc_tmr4_pocr_field_t POCRW_f;
        };
        uint8_t RESERVED34[2];
        union
        {
            __IO uint16_t RCSR;
            stc_tmr4_rcsr_field_t RCSR_f;
        };
        uint8_t RESERVED35[12];
        __IO uint16_t SCCRUH;
        uint8_t RESERVED36[2];
        __IO uint16_t SCCRUL;
        uint8_t RESERVED37[2];
        __IO uint16_t SCCRVH;
        uint8_t RESERVED38[2];
        __IO uint16_t SCCRVL;
        uint8_t RESERVED39[2];
        __IO uint16_t SCCRWH;
        uint8_t RESERVED40[2];
        __IO uint16_t SCCRWL;
        union
        {
            __IO uint16_t SCSRUH;
            stc_tmr4_scsr_field_t SCSRUH_f;
        };
        union
        {
            __IO uint16_t SCMRUH;
            stc_tmr4_scmr_field_t SCMRUH_f;
        };
        union
        {
            __IO uint16_t SCSRUL;
            stc_tmr4_scsr_field_t SCSRUL_f;
        };
        union
        {
            __IO uint16_t SCMRUL;
            stc_tmr4_scmr_field_t SCMRUL_f;
        };
        union
        {
            __IO uint16_t SCSRVH;
            stc_tmr4_scsr_field_t SCSRVH_f;
        };
        union
        {
            __IO uint16_t SCMRVH;
            stc_tmr4_scmr_field_t SCMRVH_f;
        };
        union
        {
            __IO uint16_t SCSRVL;
            stc_tmr4_scsr_field_t SCSRVL_f;
        };
        union
        {
            __IO uint16_t SCMRVL;
            stc_tmr4_scmr_field_t SCMRVL_f;
        };
        union
        {
            __IO uint16_t SCSRWH;
            stc_tmr4_scsr_field_t SCSRWH_f;
        };
        union
        {
            __IO uint16_t SCMRWH;
            stc_tmr4_scmr_field_t SCMRWH_f;
        };
        union
        {
            __IO uint16_t SCSRWL;
            stc_tmr4_scsr_field_t SCSRWL_f;
        };
        union
        {
            __IO uint16_t SCMRWL;
            stc_tmr4_scmr_field_t SCMRWL_f;
        };
        uint8_t RESERVED53[16];
        union
        {
            __IO uint16_t ECSR;
            stc_tmr4_ecsr_field_t ECSR_f;
        };
    } M4_TMR4_TypeDef;

    typedef struct
    {
        union
        {
            __IO uint16_t ECER1;
            stc_tmr4_cr_ecer1_field_t ECER1_f;
        };
        uint8_t RESERVED1[2];
        union
        {
            __IO uint16_t ECER2;
            stc_tmr4_cr_ecer2_field_t ECER2_f;
        };
        uint8_t RESERVED2[2];
        union
        {
            __IO uint16_t ECER3;
            stc_tmr4_cr_ecer3_field_t ECER3_f;
        };
    } M4_TMR4_CR_TypeDef;

