MarlinFirmware/Marlin/Marlin/lib/h32_core/main/hdsc32core/common/hc32f46x.h
    typedef struct
    {
        union
        {
            __IO uint32_t CNTER;
            stc_tmr6_cnter_field_t CNTER_f;
        };
        union
        {
            __IO uint32_t PERAR;
            stc_tmr6_perar_field_t PERAR_f;
        };
        union
        {
            __IO uint32_t PERBR;
            stc_tmr6_perbr_field_t PERBR_f;
        };
        union
        {
            __IO uint32_t PERCR;
            stc_tmr6_percr_field_t PERCR_f;
        };
        union
        {
            __IO uint32_t GCMAR;
            stc_tmr6_gcmar_field_t GCMAR_f;
        };
        union
        {
            __IO uint32_t GCMBR;
            stc_tmr6_gcmbr_field_t GCMBR_f;
        };
        union
        {
            __IO uint32_t GCMCR;
            stc_tmr6_gcmcr_field_t GCMCR_f;
        };
        union
        {
            __IO uint32_t GCMDR;
            stc_tmr6_gcmdr_field_t GCMDR_f;
        };
        union
        {
            __IO uint32_t GCMER;
            stc_tmr6_gcmer_field_t GCMER_f;
        };
        union
        {
            __IO uint32_t GCMFR;
            stc_tmr6_gcmfr_field_t GCMFR_f;
        };
        union
        {
            __IO uint32_t SCMAR;
            stc_tmr6_scmar_field_t SCMAR_f;
        };
        union
        {
            __IO uint32_t SCMBR;
            stc_tmr6_scmbr_field_t SCMBR_f;
        };
        union
        {
            __IO uint32_t SCMCR;
            stc_tmr6_scmcr_field_t SCMCR_f;
        };
        union
        {
            __IO uint32_t SCMDR;
            stc_tmr6_scmdr_field_t SCMDR_f;
        };
        union
        {
            __IO uint32_t SCMER;
            stc_tmr6_scmer_field_t SCMER_f;
        };
        union
        {
            __IO uint32_t SCMFR;
            stc_tmr6_scmfr_field_t SCMFR_f;
        };
        union
        {
            __IO uint32_t DTUAR;
            stc_tmr6_dtuar_field_t DTUAR_f;
        };
        union
        {
            __IO uint32_t DTDAR;
            stc_tmr6_dtdar_field_t DTDAR_f;
        };
        union
        {
            __IO uint32_t DTUBR;
            stc_tmr6_dtubr_field_t DTUBR_f;
        };
        union
        {
            __IO uint32_t DTDBR;
            stc_tmr6_dtdbr_field_t DTDBR_f;
        };
        union
        {
            __IO uint32_t GCONR;
            stc_tmr6_gconr_field_t GCONR_f;
        };
        union
        {
            __IO uint32_t ICONR;
            stc_tmr6_iconr_field_t ICONR_f;
        };
        union
        {
            __IO uint32_t PCONR;
            stc_tmr6_pconr_field_t PCONR_f;
        };
        union
        {
            __IO uint32_t BCONR;
            stc_tmr6_bconr_field_t BCONR_f;
        };
        union
        {
            __IO uint32_t DCONR;
            stc_tmr6_dconr_field_t DCONR_f;
        };
        uint8_t RESERVED25[4];
        union
        {
            __IO uint32_t FCONR;
            stc_tmr6_fconr_field_t FCONR_f;
        };
        union
        {
            __IO uint32_t VPERR;
            stc_tmr6_vperr_field_t VPERR_f;
        };
        union
        {
            __IO uint32_t STFLR;
            stc_tmr6_stflr_field_t STFLR_f;
        };
        union
        {
            __IO uint32_t HSTAR;
            stc_tmr6_hstar_field_t HSTAR_f;
        };
        union
        {
            __IO uint32_t HSTPR;
            stc_tmr6_hstpr_field_t HSTPR_f;
        };
        union
        {
            __IO uint32_t HCLRR;
            stc_tmr6_hclrr_field_t HCLRR_f;
        };
        union
        {
            __IO uint32_t HCPAR;
            stc_tmr6_hcpar_field_t HCPAR_f;
        };
        union
        {
            __IO uint32_t HCPBR;
            stc_tmr6_hcpbr_field_t HCPBR_f;
        };
        union
        {
            __IO uint32_t HCUPR;
            stc_tmr6_hcupr_field_t HCUPR_f;
        };
        union
        {
            __IO uint32_t HCDOR;
            stc_tmr6_hcdor_field_t HCDOR_f;
        };
    } M4_TMR6_TypeDef;

    typedef struct
    {
        uint8_t RESERVED0[1012];
        union
        {
            __IO uint32_t SSTAR;
            stc_tmr6_cr_sstar_field_t SSTAR_f;
        };
        union
        {
            __IO uint32_t SSTPR;
            stc_tmr6_cr_sstpr_field_t SSTPR_f;
        };
        union
        {
            __IO uint32_t SCLRR;
            stc_tmr6_cr_sclrr_field_t SCLRR_f;
        };
    } M4_TMR6_CR_TypeDef;

    typedef struct
    {
        union
        {
            __IO uint32_t CNTER;
            stc_tmra_cnter_field_t CNTER_f;
        };
        union
        {
            __IO uint32_t PERAR;
            stc_tmra_perar_field_t PERAR_f;
        };
        uint8_t RESERVED2[56];
        union
        {
            __IO uint32_t CMPAR1;
            stc_tmra_cmpar_field_t CMPAR1_f;
        };
        union
        {
            __IO uint32_t CMPAR2;
            stc_tmra_cmpar_field_t CMPAR2_f;
        };
        union
        {
            __IO uint32_t CMPAR3;
            stc_tmra_cmpar_field_t CMPAR3_f;
        };
        union
        {
            __IO uint32_t CMPAR4;
            stc_tmra_cmpar_field_t CMPAR4_f;
        };
        union
        {
            __IO uint32_t CMPAR5;
            stc_tmra_cmpar_field_t CMPAR5_f;
        };
        union
        {
            __IO uint32_t CMPAR6;
            stc_tmra_cmpar_field_t CMPAR6_f;
        };
        union
        {
            __IO uint32_t CMPAR7;
            stc_tmra_cmpar_field_t CMPAR7_f;
        };
        union
        {
            __IO uint32_t CMPAR8;
            stc_tmra_cmpar_field_t CMPAR8_f;
        };
        uint8_t RESERVED10[32];
        union
        {
            __IO uint32_t BCSTR;
            stc_tmra_bcstr_field_t BCSTR_f;
        };
        union
        {
            __IO uint32_t HCONR;
            stc_tmra_hconr_field_t HCONR_f;
        };
        union
        {
            __IO uint32_t HCUPR;
            stc_tmra_hcupr_field_t HCUPR_f;
        };
        union
        {
            __IO uint32_t HCDOR;
            stc_tmra_hcdor_field_t HCDOR_f;
        };
        union
        {
            __IO uint32_t ICONR;
            stc_tmra_iconr_field_t ICONR_f;
        };
        union
        {
            __IO uint32_t ECONR;
            stc_tmra_econr_field_t ECONR_f;
        };
        union
        {
            __IO uint32_t FCONR;
            stc_tmra_fconr_field_t FCONR_f;
        };
        union
        {
            __IO uint32_t STFLR;
            stc_tmra_stflr_field_t STFLR_f;
        };
        uint8_t RESERVED18[32];
        union
        {
            __IO uint32_t BCONR1;
            stc_tmra_bconr_field_t BCONR1_f;
        };
        uint8_t RESERVED19[4];
        union
        {
            __IO uint32_t BCONR2;
            stc_tmra_bconr_field_t BCONR2_f;
        };
        uint8_t RESERVED20[4];
        union
        {
            __IO uint32_t BCONR3;
            stc_tmra_bconr_field_t BCONR3_f;
        };
        uint8_t RESERVED21[4];
        union
        {
            __IO uint32_t BCONR4;
            stc_tmra_bconr_field_t BCONR4_f;
        };
        uint8_t RESERVED22[36];
        union
        {
            __IO uint32_t CCONR1;
            stc_tmra_cconr_field_t CCONR1_f;
        };
        union
        {
            __IO uint32_t CCONR2;
            stc_tmra_cconr_field_t CCONR2_f;
        };
        union
        {
            __IO uint32_t CCONR3;
            stc_tmra_cconr_field_t CCONR3_f;
        };
        union
        {
            __IO uint32_t CCONR4;
            stc_tmra_cconr_field_t CCONR4_f;
        };
        union
        {
            __IO uint32_t CCONR5;
            stc_tmra_cconr_field_t CCONR5_f;
        };
        union
        {
            __IO uint32_t CCONR6;
            stc_tmra_cconr_field_t CCONR6_f;
        };
        union
        {
            __IO uint32_t CCONR7;
            stc_tmra_cconr_field_t CCONR7_f;
        };
        union
        {
            __IO uint32_t CCONR8;
            stc_tmra_cconr_field_t CCONR8_f;
        };
        uint8_t RESERVED30[32];
        union
        {
            __IO uint32_t PCONR1;
            stc_tmra_pconr_field_t PCONR1_f;
        };
        union
        {
            __IO uint32_t PCONR2;
            stc_tmra_pconr_field_t PCONR2_f;
        };
        union
        {
            __IO uint32_t PCONR3;
            stc_tmra_pconr_field_t PCONR3_f;
        };
        union
        {
            __IO uint32_t PCONR4;
            stc_tmra_pconr_field_t PCONR4_f;
        };
        union
        {
            __IO uint32_t PCONR5;
            stc_tmra_pconr_field_t PCONR5_f;
        };
        union
        {
            __IO uint32_t PCONR6;
            stc_tmra_pconr_field_t PCONR6_f;
        };
        union
        {
            __IO uint32_t PCONR7;
            stc_tmra_pconr_field_t PCONR7_f;
        };
        union
        {
            __IO uint32_t PCONR8;
            stc_tmra_pconr_field_t PCONR8_f;
        };
    } M4_TMRA_TypeDef;

    typedef struct
    {
        union
        {
            __IO uint32_t CR;
            stc_trng_cr_field_t CR_f;
        };
        union
        {
            __IO uint32_t MR;
            stc_trng_mr_field_t MR_f;
        };
        uint8_t RESERVED2[4];
        __IO uint32_t DR0;
        __IO uint32_t DR1;
    } M4_TRNG_TypeDef;

    typedef struct
    {
        union
        {
            __IO uint32_t SR;
            stc_usart_sr_field_t SR_f;
        };
        union
        {
            __IO uint32_t DR;
            stc_usart_dr_field_t DR_f;
        };
        union
        {
            __IO uint32_t BRR;
            stc_usart_brr_field_t BRR_f;
        };
        union
        {
            __IO uint32_t CR1;
            stc_usart_cr1_field_t CR1_f;
        };
        union
        {
            __IO uint32_t CR2;
            stc_usart_cr2_field_t CR2_f;
        };
        union
        {
            __IO uint32_t CR3;
            stc_usart_cr3_field_t CR3_f;
        };
        union
        {
            __IO uint32_t PR;
            stc_usart_pr_field_t PR_f;
        };
    } M4_USART_TypeDef;

