MarlinFirmware/Marlin/Marlin/lib/h32_core/main/hdsc32core/common/hc32f46x.h
    typedef struct
    {
        uint8_t RESERVED0[8];
        union
        {
            __IO uint32_t GAHBCFG;
            stc_usbfs_gahbcfg_field_t GAHBCFG_f;
        };
        union
        {
            __IO uint32_t GUSBCFG;
            stc_usbfs_gusbcfg_field_t GUSBCFG_f;
        };
        union
        {
            __IO uint32_t GRSTCTL;
            stc_usbfs_grstctl_field_t GRSTCTL_f;
        };
        union
        {
            __IO uint32_t GINTSTS;
            stc_usbfs_gintsts_field_t GINTSTS_f;
        };
        union
        {
            __IO uint32_t GINTMSK;
            stc_usbfs_gintmsk_field_t GINTMSK_f;
        };
        union
        {
            __IO uint32_t GRXSTSR;
            stc_usbfs_grxstsr_field_t GRXSTSR_f;
        };
        union
        {
            __IO uint32_t GRXSTSP;
            stc_usbfs_grxstsp_field_t GRXSTSP_f;
        };
        union
        {
            __IO uint32_t GRXFSIZ;
            stc_usbfs_grxfsiz_field_t GRXFSIZ_f;
        };
        union
        {
            __IO uint32_t HNPTXFSIZ;
            stc_usbfs_hnptxfsiz_field_t HNPTXFSIZ_f;
        };
        union
        {
            __IO uint32_t HNPTXSTS;
            stc_usbfs_hnptxsts_field_t HNPTXSTS_f;
        };
        uint8_t RESERVED10[12];
        __IO uint32_t CID;
        uint8_t RESERVED11[192];
        union
        {
            __IO uint32_t HPTXFSIZ;
            stc_usbfs_hptxfsiz_field_t HPTXFSIZ_f;
        };
        union
        {
            __IO uint32_t DIEPTXF1;
            stc_usbfs_dieptxf_field_t DIEPTXF1_f;
        };
        union
        {
            __IO uint32_t DIEPTXF2;
            stc_usbfs_dieptxf_field_t DIEPTXF2_f;
        };
        union
        {
            __IO uint32_t DIEPTXF3;
            stc_usbfs_dieptxf_field_t DIEPTXF3_f;
        };
        union
        {
            __IO uint32_t DIEPTXF4;
            stc_usbfs_dieptxf_field_t DIEPTXF4_f;
        };
        union
        {
            __IO uint32_t DIEPTXF5;
            stc_usbfs_dieptxf_field_t DIEPTXF5_f;
        };
        uint8_t RESERVED17[744];
        union
        {
            __IO uint32_t HCFG;
            stc_usbfs_hcfg_field_t HCFG_f;
        };
        union
        {
            __IO uint32_t HFIR;
            stc_usbfs_hfir_field_t HFIR_f;
        };
        union
        {
            __IO uint32_t HFNUM;
            stc_usbfs_hfnum_field_t HFNUM_f;
        };
        uint8_t RESERVED20[4];
        union
        {
            __IO uint32_t HPTXSTS;
            stc_usbfs_hptxsts_field_t HPTXSTS_f;
        };
        union
        {
            __IO uint32_t HAINT;
            stc_usbfs_haint_field_t HAINT_f;
        };
        union
        {
            __IO uint32_t HAINTMSK;
            stc_usbfs_haintmsk_field_t HAINTMSK_f;
        };
        uint8_t RESERVED23[36];
        union
        {
            __IO uint32_t HPRT;
            stc_usbfs_hprt_field_t HPRT_f;
        };
        uint8_t RESERVED24[188];
        union
        {
            __IO uint32_t HCCHAR0;
            stc_usbfs_hcchar_field_t HCCHAR0_f;
        };
        uint8_t RESERVED25[4];
        union
        {
            __IO uint32_t HCINT0;
            stc_usbfs_hcint_field_t HCINT0_f;
        };
        union
        {
            __IO uint32_t HCINTMSK0;
            stc_usbfs_hcintmsk_field_t HCINTMSK0_f;
        };
        union
        {
            __IO uint32_t HCTSIZ0;
            stc_usbfs_hctsiz_field_t HCTSIZ0_f;
        };
        __IO uint32_t HCDMA0;
        uint8_t RESERVED29[8];
        union
        {
            __IO uint32_t HCCHAR1;
            stc_usbfs_hcchar_field_t HCCHAR1_f;
        };
        uint8_t RESERVED30[4];
        union
        {
            __IO uint32_t HCINT1;
            stc_usbfs_hcint_field_t HCINT1_f;
        };
        union
        {
            __IO uint32_t HCINTMSK1;
            stc_usbfs_hcintmsk_field_t HCINTMSK1_f;
        };
        union
        {
            __IO uint32_t HCTSIZ1;
            stc_usbfs_hctsiz_field_t HCTSIZ1_f;
        };
        __IO uint32_t HCDMA1;
        uint8_t RESERVED34[8];
        union
        {
            __IO uint32_t HCCHAR2;
            stc_usbfs_hcchar_field_t HCCHAR2_f;
        };
        uint8_t RESERVED35[4];
        union
        {
            __IO uint32_t HCINT2;
            stc_usbfs_hcint_field_t HCINT2_f;
        };
        union
        {
            __IO uint32_t HCINTMSK2;
            stc_usbfs_hcintmsk_field_t HCINTMSK2_f;
        };
        union
        {
            __IO uint32_t HCTSIZ2;
            stc_usbfs_hctsiz_field_t HCTSIZ2_f;
        };
        __IO uint32_t HCDMA2;
        uint8_t RESERVED39[8];
        union
        {
            __IO uint32_t HCCHAR3;
            stc_usbfs_hcchar_field_t HCCHAR3_f;
        };
        uint8_t RESERVED40[4];
        union
        {
            __IO uint32_t HCINT3;
            stc_usbfs_hcint_field_t HCINT3_f;
        };
        union
        {
            __IO uint32_t HCINTMSK3;
            stc_usbfs_hcintmsk_field_t HCINTMSK3_f;
        };
        union
        {
            __IO uint32_t HCTSIZ3;
            stc_usbfs_hctsiz_field_t HCTSIZ3_f;
        };
        __IO uint32_t HCDMA3;
        uint8_t RESERVED44[8];
        union
        {
            __IO uint32_t HCCHAR4;
            stc_usbfs_hcchar_field_t HCCHAR4_f;
        };
        uint8_t RESERVED45[4];
        union
        {
            __IO uint32_t HCINT4;
            stc_usbfs_hcint_field_t HCINT4_f;
        };
        union
        {
            __IO uint32_t HCINTMSK4;
            stc_usbfs_hcintmsk_field_t HCINTMSK4_f;
        };
        union
        {
            __IO uint32_t HCTSIZ4;
            stc_usbfs_hctsiz_field_t HCTSIZ4_f;
        };
        __IO uint32_t HCDMA4;
        uint8_t RESERVED49[8];
        union
        {
            __IO uint32_t HCCHAR5;
            stc_usbfs_hcchar_field_t HCCHAR5_f;
        };
        uint8_t RESERVED50[4];
        union
        {
            __IO uint32_t HCINT5;
            stc_usbfs_hcint_field_t HCINT5_f;
        };
        union
        {
            __IO uint32_t HCINTMSK5;
            stc_usbfs_hcintmsk_field_t HCINTMSK5_f;
        };
        union
        {
            __IO uint32_t HCTSIZ5;
            stc_usbfs_hctsiz_field_t HCTSIZ5_f;
        };
        __IO uint32_t HCDMA5;
        uint8_t RESERVED54[8];
        union
        {
            __IO uint32_t HCCHAR6;
            stc_usbfs_hcchar_field_t HCCHAR6_f;
        };
        uint8_t RESERVED55[4];
        union
        {
            __IO uint32_t HCINT6;
            stc_usbfs_hcint_field_t HCINT6_f;
        };
        union
        {
            __IO uint32_t HCINTMSK6;
            stc_usbfs_hcintmsk_field_t HCINTMSK6_f;
        };
        union
        {
            __IO uint32_t HCTSIZ6;
            stc_usbfs_hctsiz_field_t HCTSIZ6_f;
        };
        __IO uint32_t HCDMA6;
        uint8_t RESERVED59[8];
        union
        {
            __IO uint32_t HCCHAR7;
            stc_usbfs_hcchar_field_t HCCHAR7_f;
        };
        uint8_t RESERVED60[4];
        union
        {
            __IO uint32_t HCINT7;
            stc_usbfs_hcint_field_t HCINT7_f;
        };
        union
        {
            __IO uint32_t HCINTMSK7;
            stc_usbfs_hcintmsk_field_t HCINTMSK7_f;
        };
        union
        {
            __IO uint32_t HCTSIZ7;
            stc_usbfs_hctsiz_field_t HCTSIZ7_f;
        };
        __IO uint32_t HCDMA7;
        uint8_t RESERVED64[8];
        union
        {
            __IO uint32_t HCCHAR8;
            stc_usbfs_hcchar_field_t HCCHAR8_f;
        };
        uint8_t RESERVED65[4];
        union
        {
            __IO uint32_t HCINT8;
            stc_usbfs_hcint_field_t HCINT8_f;
        };
        union
        {
            __IO uint32_t HCINTMSK8;
            stc_usbfs_hcintmsk_field_t HCINTMSK8_f;
        };
        union
        {
            __IO uint32_t HCTSIZ8;
            stc_usbfs_hctsiz_field_t HCTSIZ8_f;
        };
        __IO uint32_t HCDMA8;
        uint8_t RESERVED69[8];
        union
        {
            __IO uint32_t HCCHAR9;
            stc_usbfs_hcchar_field_t HCCHAR9_f;
        };
        uint8_t RESERVED70[4];
        union
        {
            __IO uint32_t HCINT9;
            stc_usbfs_hcint_field_t HCINT9_f;
        };
        union
        {
            __IO uint32_t HCINTMSK9;
            stc_usbfs_hcintmsk_field_t HCINTMSK9_f;
        };
        union
        {
            __IO uint32_t HCTSIZ9;
            stc_usbfs_hctsiz_field_t HCTSIZ9_f;
        };
        __IO uint32_t HCDMA9;
        uint8_t RESERVED74[8];
        union
        {
            __IO uint32_t HCCHAR10;
            stc_usbfs_hcchar_field_t HCCHAR10_f;
        };
        uint8_t RESERVED75[4];
        union
        {
            __IO uint32_t HCINT10;
            stc_usbfs_hcint_field_t HCINT10_f;
        };
        union
        {
            __IO uint32_t HCINTMSK10;
            stc_usbfs_hcintmsk_field_t HCINTMSK10_f;
        };
        union
        {
            __IO uint32_t HCTSIZ10;
            stc_usbfs_hctsiz_field_t HCTSIZ10_f;
        };
        __IO uint32_t HCDMA10;
        uint8_t RESERVED79[8];
        union
        {
            __IO uint32_t HCCHAR11;
            stc_usbfs_hcchar_field_t HCCHAR11_f;
        };
        uint8_t RESERVED80[4];
        union
        {
            __IO uint32_t HCINT11;
            stc_usbfs_hcint_field_t HCINT11_f;
        };
        union
        {
            __IO uint32_t HCINTMSK11;
            stc_usbfs_hcintmsk_field_t HCINTMSK11_f;
        };
        union
        {
            __IO uint32_t HCTSIZ11;
            stc_usbfs_hctsiz_field_t HCTSIZ11_f;
        };
        __IO uint32_t HCDMA11;
        uint8_t RESERVED84[392];
        union
        {
            __IO uint32_t DCFG;
            stc_usbfs_dcfg_field_t DCFG_f;
        };
        union
        {
            __IO uint32_t DCTL;
            stc_usbfs_dctl_field_t DCTL_f;
        };
        union
        {
            __IO uint32_t DSTS;
            stc_usbfs_dsts_field_t DSTS_f;
        };
        uint8_t RESERVED87[4];
        union
        {
            __IO uint32_t DIEPMSK;
            stc_usbfs_diepmsk_field_t DIEPMSK_f;
        };
        union
        {
            __IO uint32_t DOEPMSK;
            stc_usbfs_doepmsk_field_t DOEPMSK_f;
        };
        union
        {
            __IO uint32_t DAINT;
            stc_usbfs_daint_field_t DAINT_f;
        };
        union
        {
            __IO uint32_t DAINTMSK;
            stc_usbfs_daintmsk_field_t DAINTMSK_f;
        };
        uint8_t RESERVED91[20];
        union
        {
            __IO uint32_t DIEPEMPMSK;
            stc_usbfs_diepempmsk_field_t DIEPEMPMSK_f;
        };
        uint8_t RESERVED92[200];
        union
        {
            __IO uint32_t DIEPCTL0;
            stc_usbfs_diepctl0_field_t DIEPCTL0_f;
        };
        uint8_t RESERVED93[4];
        union
        {
            __IO uint32_t DIEPINT0;
            stc_usbfs_diepint0_field_t DIEPINT0_f;
        };
        uint8_t RESERVED94[4];
        union
        {
            __IO uint32_t DIEPTSIZ0;
            stc_usbfs_dieptsiz0_field_t DIEPTSIZ0_f;
        };
        __IO uint32_t DIEPDMA0;
        union
        {
            __IO uint32_t DTXFSTS0;
            stc_usbfs_dtxfsts0_field_t DTXFSTS0_f;
        };
        uint8_t RESERVED97[4];
        union
        {
            __IO uint32_t DIEPCTL1;
            stc_usbfs_diepctl_field_t DIEPCTL1_f;
        };
        uint8_t RESERVED98[4];
        union
        {
            __IO uint32_t DIEPINT1;
            stc_usbfs_diepint_field_t DIEPINT1_f;
        };
        uint8_t RESERVED99[4];
        union
        {
            __IO uint32_t DIEPTSIZ1;
            stc_usbfs_dieptsiz_field_t DIEPTSIZ1_f;
        };
        __IO uint32_t DIEPDMA1;
        union
        {
            __IO uint32_t DTXFSTS1;
            stc_usbfs_dtxfsts_field_t DTXFSTS1_f;
        };
        uint8_t RESERVED102[4];
        union
        {
            __IO uint32_t DIEPCTL2;
            stc_usbfs_diepctl_field_t DIEPCTL2_f;
        };
        uint8_t RESERVED103[4];
        union
        {
            __IO uint32_t DIEPINT2;
            stc_usbfs_diepint_field_t DIEPINT2_f;
        };
        uint8_t RESERVED104[4];
        union
        {
            __IO uint32_t DIEPTSIZ2;
            stc_usbfs_dieptsiz_field_t DIEPTSIZ2_f;
        };
        __IO uint32_t DIEPDMA2;
        union
        {
            __IO uint32_t DTXFSTS2;
            stc_usbfs_dtxfsts_field_t DTXFSTS2_f;
        };
        uint8_t RESERVED107[4];
        union
        {
            __IO uint32_t DIEPCTL3;
            stc_usbfs_diepctl_field_t DIEPCTL3_f;
        };
        uint8_t RESERVED108[4];
        union
        {
            __IO uint32_t DIEPINT3;
            stc_usbfs_diepint_field_t DIEPINT3_f;
        };
        uint8_t RESERVED109[4];
        union
        {
            __IO uint32_t DIEPTSIZ3;
            stc_usbfs_dieptsiz_field_t DIEPTSIZ3_f;
        };
        __IO uint32_t DIEPDMA3;
        union
        {
            __IO uint32_t DTXFSTS3;
            stc_usbfs_dtxfsts_field_t DTXFSTS3_f;
        };
        uint8_t RESERVED112[4];
        union
        {
            __IO uint32_t DIEPCTL4;
            stc_usbfs_diepctl_field_t DIEPCTL4_f;
        };
        uint8_t RESERVED113[4];
        union
        {
            __IO uint32_t DIEPINT4;
            stc_usbfs_diepint_field_t DIEPINT4_f;
        };
        uint8_t RESERVED114[4];
        union
        {
            __IO uint32_t DIEPTSIZ4;
            stc_usbfs_dieptsiz_field_t DIEPTSIZ4_f;
        };
        __IO uint32_t DIEPDMA4;
        union
        {
            __IO uint32_t DTXFSTS4;
            stc_usbfs_dtxfsts_field_t DTXFSTS4_f;
        };
        uint8_t RESERVED117[4];
        union
        {
            __IO uint32_t DIEPCTL5;
            stc_usbfs_diepctl_field_t DIEPCTL5_f;
        };
        uint8_t RESERVED118[4];
        union
        {
            __IO uint32_t DIEPINT5;
            stc_usbfs_diepint_field_t DIEPINT5_f;
        };
        uint8_t RESERVED119[4];
        union
        {
            __IO uint32_t DIEPTSIZ5;
            stc_usbfs_dieptsiz_field_t DIEPTSIZ5_f;
        };
        __IO uint32_t DIEPDMA5;
        union
        {
            __IO uint32_t DTXFSTS5;
            stc_usbfs_dtxfsts_field_t DTXFSTS5_f;
        };
        uint8_t RESERVED122[324];
        union
        {
            __IO uint32_t DOEPCTL0;
            stc_usbfs_doepctl0_field_t DOEPCTL0_f;
        };
        uint8_t RESERVED123[4];
        union
        {
            __IO uint32_t DOEPINT0;
            stc_usbfs_doepint_field_t DOEPINT0_f;
        };
        uint8_t RESERVED124[4];
        union
        {
            __IO uint32_t DOEPTSIZ0;
            stc_usbfs_doeptsiz0_field_t DOEPTSIZ0_f;
        };
        __IO uint32_t DOEPDMA0;
        uint8_t RESERVED126[8];
        union
        {
            __IO uint32_t DOEPCTL1;
            stc_usbfs_doepctl_field_t DOEPCTL1_f;
        };
        uint8_t RESERVED127[4];
        union
        {
            __IO uint32_t DOEPINT1;
            stc_usbfs_doepint_field_t DOEPINT1_f;
        };
        uint8_t RESERVED128[4];
        union
        {
            __IO uint32_t DOEPTSIZ1;
            stc_usbfs_doeptsiz_field_t DOEPTSIZ1_f;
        };
        __IO uint32_t DOEPDMA1;
        uint8_t RESERVED130[8];
        union
        {
            __IO uint32_t DOEPCTL2;
            stc_usbfs_doepctl_field_t DOEPCTL2_f;
        };
        uint8_t RESERVED131[4];
        union
        {
            __IO uint32_t DOEPINT2;
            stc_usbfs_doepint_field_t DOEPINT2_f;
        };
        uint8_t RESERVED132[4];
        union
        {
            __IO uint32_t DOEPTSIZ2;
            stc_usbfs_doeptsiz_field_t DOEPTSIZ2_f;
        };
        __IO uint32_t DOEPDMA2;
        uint8_t RESERVED134[8];
        union
        {
            __IO uint32_t DOEPCTL3;
            stc_usbfs_doepctl_field_t DOEPCTL3_f;
        };
        uint8_t RESERVED135[4];
        union
        {
            __IO uint32_t DOEPINT3;
            stc_usbfs_doepint_field_t DOEPINT3_f;
        };
        uint8_t RESERVED136[4];
        union
        {
            __IO uint32_t DOEPTSIZ3;
            stc_usbfs_doeptsiz_field_t DOEPTSIZ3_f;
        };
        __IO uint32_t DOEPDMA3;
        uint8_t RESERVED138[8];
        union
        {
            __IO uint32_t DOEPCTL4;
            stc_usbfs_doepctl_field_t DOEPCTL4_f;
        };
        uint8_t RESERVED139[4];
        union
        {
            __IO uint32_t DOEPINT4;
            stc_usbfs_doepint_field_t DOEPINT4_f;
        };
        uint8_t RESERVED140[4];
        union
        {
            __IO uint32_t DOEPTSIZ4;
            stc_usbfs_doeptsiz_field_t DOEPTSIZ4_f;
        };
        __IO uint32_t DOEPDMA4;
        uint8_t RESERVED142[8];
        union
        {
            __IO uint32_t DOEPCTL5;
            stc_usbfs_doepctl_field_t DOEPCTL5_f;
        };
        uint8_t RESERVED143[4];
        union
        {
            __IO uint32_t DOEPINT5;
            stc_usbfs_doepint_field_t DOEPINT5_f;
        };
        uint8_t RESERVED144[4];
        union
        {
            __IO uint32_t DOEPTSIZ5;
            stc_usbfs_doeptsiz_field_t DOEPTSIZ5_f;
        };
        __IO uint32_t DOEPDMA5;
        uint8_t RESERVED146[584];
        union
        {
            __IO uint32_t PCGCCTL;
            stc_usbfs_pcgcctl_field_t PCGCCTL_f;
        };
    } M4_USBFS_TypeDef;

    typedef struct
    {
        union
        {
            __IO uint32_t CR;
            stc_wdt_cr_field_t CR_f;
        };
        union
        {
            __IO uint32_t SR;
            stc_wdt_sr_field_t SR_f;
        };
        union
        {
            __IO uint32_t RR;
            stc_wdt_rr_field_t RR_f;
        };
    } M4_WDT_TypeDef;

    typedef struct
    {
        union
        {
            __IO uint16_t CR;
            stc_wktm_cr_field_t CR_f;
        };
    } M4_WKTM_TypeDef;

