MarlinFirmware/Marlin/Marlin/lib/h32_core/main/hdsc32core/common/hc32f46x.h
#define bM4_AOS_PEVNTORR1_POR05 (*((volatile unsigned int *)(0x42212194UL)))
#define bM4_AOS_PEVNTORR1_POR06 (*((volatile unsigned int *)(0x42212198UL)))
#define bM4_AOS_PEVNTORR1_POR07 (*((volatile unsigned int *)(0x4221219CUL)))
#define bM4_AOS_PEVNTORR1_POR08 (*((volatile unsigned int *)(0x422121A0UL)))
#define bM4_AOS_PEVNTORR1_POR09 (*((volatile unsigned int *)(0x422121A4UL)))
#define bM4_AOS_PEVNTORR1_POR10 (*((volatile unsigned int *)(0x422121A8UL)))
#define bM4_AOS_PEVNTORR1_POR11 (*((volatile unsigned int *)(0x422121ACUL)))
#define bM4_AOS_PEVNTORR1_POR12 (*((volatile unsigned int *)(0x422121B0UL)))
#define bM4_AOS_PEVNTORR1_POR13 (*((volatile unsigned int *)(0x422121B4UL)))
#define bM4_AOS_PEVNTORR1_POR14 (*((volatile unsigned int *)(0x422121B8UL)))
#define bM4_AOS_PEVNTORR1_POR15 (*((volatile unsigned int *)(0x422121BCUL)))
#define bM4_AOS_PEVNTOSR1_POS00 (*((volatile unsigned int *)(0x42212200UL)))
#define bM4_AOS_PEVNTOSR1_POS01 (*((volatile unsigned int *)(0x42212204UL)))
#define bM4_AOS_PEVNTOSR1_POS02 (*((volatile unsigned int *)(0x42212208UL)))
#define bM4_AOS_PEVNTOSR1_POS03 (*((volatile unsigned int *)(0x4221220CUL)))
#define bM4_AOS_PEVNTOSR1_POS04 (*((volatile unsigned int *)(0x42212210UL)))
#define bM4_AOS_PEVNTOSR1_POS05 (*((volatile unsigned int *)(0x42212214UL)))
#define bM4_AOS_PEVNTOSR1_POS06 (*((volatile unsigned int *)(0x42212218UL)))
#define bM4_AOS_PEVNTOSR1_POS07 (*((volatile unsigned int *)(0x4221221CUL)))
#define bM4_AOS_PEVNTOSR1_POS08 (*((volatile unsigned int *)(0x42212220UL)))
#define bM4_AOS_PEVNTOSR1_POS09 (*((volatile unsigned int *)(0x42212224UL)))
#define bM4_AOS_PEVNTOSR1_POS10 (*((volatile unsigned int *)(0x42212228UL)))
#define bM4_AOS_PEVNTOSR1_POS11 (*((volatile unsigned int *)(0x4221222CUL)))
#define bM4_AOS_PEVNTOSR1_POS12 (*((volatile unsigned int *)(0x42212230UL)))
#define bM4_AOS_PEVNTOSR1_POS13 (*((volatile unsigned int *)(0x42212234UL)))
#define bM4_AOS_PEVNTOSR1_POS14 (*((volatile unsigned int *)(0x42212238UL)))
#define bM4_AOS_PEVNTOSR1_POS15 (*((volatile unsigned int *)(0x4221223CUL)))
#define bM4_AOS_PEVNTRISR1_RIS00 (*((volatile unsigned int *)(0x42212280UL)))
#define bM4_AOS_PEVNTRISR1_RIS01 (*((volatile unsigned int *)(0x42212284UL)))
#define bM4_AOS_PEVNTRISR1_RIS02 (*((volatile unsigned int *)(0x42212288UL)))
#define bM4_AOS_PEVNTRISR1_RIS03 (*((volatile unsigned int *)(0x4221228CUL)))
#define bM4_AOS_PEVNTRISR1_RIS04 (*((volatile unsigned int *)(0x42212290UL)))
#define bM4_AOS_PEVNTRISR1_RIS05 (*((volatile unsigned int *)(0x42212294UL)))
#define bM4_AOS_PEVNTRISR1_RIS06 (*((volatile unsigned int *)(0x42212298UL)))
#define bM4_AOS_PEVNTRISR1_RIS07 (*((volatile unsigned int *)(0x4221229CUL)))
#define bM4_AOS_PEVNTRISR1_RIS08 (*((volatile unsigned int *)(0x422122A0UL)))
#define bM4_AOS_PEVNTRISR1_RIS09 (*((volatile unsigned int *)(0x422122A4UL)))
#define bM4_AOS_PEVNTRISR1_RIS10 (*((volatile unsigned int *)(0x422122A8UL)))
#define bM4_AOS_PEVNTRISR1_RIS11 (*((volatile unsigned int *)(0x422122ACUL)))
#define bM4_AOS_PEVNTRISR1_RIS12 (*((volatile unsigned int *)(0x422122B0UL)))
#define bM4_AOS_PEVNTRISR1_RIS13 (*((volatile unsigned int *)(0x422122B4UL)))
#define bM4_AOS_PEVNTRISR1_RIS14 (*((volatile unsigned int *)(0x422122B8UL)))
#define bM4_AOS_PEVNTRISR1_RIS15 (*((volatile unsigned int *)(0x422122BCUL)))
#define bM4_AOS_PEVNTFAL1_FAL00 (*((volatile unsigned int *)(0x42212300UL)))
#define bM4_AOS_PEVNTFAL1_FAL01 (*((volatile unsigned int *)(0x42212304UL)))
#define bM4_AOS_PEVNTFAL1_FAL02 (*((volatile unsigned int *)(0x42212308UL)))
#define bM4_AOS_PEVNTFAL1_FAL03 (*((volatile unsigned int *)(0x4221230CUL)))
#define bM4_AOS_PEVNTFAL1_FAL04 (*((volatile unsigned int *)(0x42212310UL)))
#define bM4_AOS_PEVNTFAL1_FAL05 (*((volatile unsigned int *)(0x42212314UL)))
#define bM4_AOS_PEVNTFAL1_FAL06 (*((volatile unsigned int *)(0x42212318UL)))
#define bM4_AOS_PEVNTFAL1_FAL07 (*((volatile unsigned int *)(0x4221231CUL)))
#define bM4_AOS_PEVNTFAL1_FAL08 (*((volatile unsigned int *)(0x42212320UL)))
#define bM4_AOS_PEVNTFAL1_FAL09 (*((volatile unsigned int *)(0x42212324UL)))
#define bM4_AOS_PEVNTFAL1_FAL10 (*((volatile unsigned int *)(0x42212328UL)))
#define bM4_AOS_PEVNTFAL1_FAL11 (*((volatile unsigned int *)(0x4221232CUL)))
#define bM4_AOS_PEVNTFAL1_FAL12 (*((volatile unsigned int *)(0x42212330UL)))
#define bM4_AOS_PEVNTFAL1_FAL13 (*((volatile unsigned int *)(0x42212334UL)))
#define bM4_AOS_PEVNTFAL1_FAL14 (*((volatile unsigned int *)(0x42212338UL)))
#define bM4_AOS_PEVNTFAL1_FAL15 (*((volatile unsigned int *)(0x4221233CUL)))
#define bM4_AOS_PEVNTDIRR2_PDIR00 (*((volatile unsigned int *)(0x42212380UL)))
#define bM4_AOS_PEVNTDIRR2_PDIR01 (*((volatile unsigned int *)(0x42212384UL)))
#define bM4_AOS_PEVNTDIRR2_PDIR02 (*((volatile unsigned int *)(0x42212388UL)))
#define bM4_AOS_PEVNTDIRR2_PDIR03 (*((volatile unsigned int *)(0x4221238CUL)))
#define bM4_AOS_PEVNTDIRR2_PDIR04 (*((volatile unsigned int *)(0x42212390UL)))
#define bM4_AOS_PEVNTDIRR2_PDIR05 (*((volatile unsigned int *)(0x42212394UL)))
#define bM4_AOS_PEVNTDIRR2_PDIR06 (*((volatile unsigned int *)(0x42212398UL)))
#define bM4_AOS_PEVNTDIRR2_PDIR07 (*((volatile unsigned int *)(0x4221239CUL)))
#define bM4_AOS_PEVNTDIRR2_PDIR08 (*((volatile unsigned int *)(0x422123A0UL)))
#define bM4_AOS_PEVNTDIRR2_PDIR09 (*((volatile unsigned int *)(0x422123A4UL)))
#define bM4_AOS_PEVNTDIRR2_PDIR10 (*((volatile unsigned int *)(0x422123A8UL)))
#define bM4_AOS_PEVNTDIRR2_PDIR11 (*((volatile unsigned int *)(0x422123ACUL)))
#define bM4_AOS_PEVNTDIRR2_PDIR12 (*((volatile unsigned int *)(0x422123B0UL)))
#define bM4_AOS_PEVNTDIRR2_PDIR13 (*((volatile unsigned int *)(0x422123B4UL)))
#define bM4_AOS_PEVNTDIRR2_PDIR14 (*((volatile unsigned int *)(0x422123B8UL)))
#define bM4_AOS_PEVNTDIRR2_PDIR15 (*((volatile unsigned int *)(0x422123BCUL)))
#define bM4_AOS_PEVNTIDR2_PIN00 (*((volatile unsigned int *)(0x42212400UL)))
#define bM4_AOS_PEVNTIDR2_PIN01 (*((volatile unsigned int *)(0x42212404UL)))
#define bM4_AOS_PEVNTIDR2_PIN02 (*((volatile unsigned int *)(0x42212408UL)))
#define bM4_AOS_PEVNTIDR2_PIN03 (*((volatile unsigned int *)(0x4221240CUL)))
#define bM4_AOS_PEVNTIDR2_PIN04 (*((volatile unsigned int *)(0x42212410UL)))
#define bM4_AOS_PEVNTIDR2_PIN05 (*((volatile unsigned int *)(0x42212414UL)))
#define bM4_AOS_PEVNTIDR2_PIN06 (*((volatile unsigned int *)(0x42212418UL)))
#define bM4_AOS_PEVNTIDR2_PIN07 (*((volatile unsigned int *)(0x4221241CUL)))
#define bM4_AOS_PEVNTIDR2_PIN08 (*((volatile unsigned int *)(0x42212420UL)))
#define bM4_AOS_PEVNTIDR2_PIN09 (*((volatile unsigned int *)(0x42212424UL)))
#define bM4_AOS_PEVNTIDR2_PIN10 (*((volatile unsigned int *)(0x42212428UL)))
#define bM4_AOS_PEVNTIDR2_PIN11 (*((volatile unsigned int *)(0x4221242CUL)))
#define bM4_AOS_PEVNTIDR2_PIN12 (*((volatile unsigned int *)(0x42212430UL)))
#define bM4_AOS_PEVNTIDR2_PIN13 (*((volatile unsigned int *)(0x42212434UL)))
#define bM4_AOS_PEVNTIDR2_PIN14 (*((volatile unsigned int *)(0x42212438UL)))
#define bM4_AOS_PEVNTIDR2_PIN15 (*((volatile unsigned int *)(0x4221243CUL)))
#define bM4_AOS_PEVNTODR2_POUT00 (*((volatile unsigned int *)(0x42212480UL)))
#define bM4_AOS_PEVNTODR2_POUT01 (*((volatile unsigned int *)(0x42212484UL)))
#define bM4_AOS_PEVNTODR2_POUT02 (*((volatile unsigned int *)(0x42212488UL)))
#define bM4_AOS_PEVNTODR2_POUT03 (*((volatile unsigned int *)(0x4221248CUL)))
#define bM4_AOS_PEVNTODR2_POUT04 (*((volatile unsigned int *)(0x42212490UL)))
#define bM4_AOS_PEVNTODR2_POUT05 (*((volatile unsigned int *)(0x42212494UL)))
#define bM4_AOS_PEVNTODR2_POUT06 (*((volatile unsigned int *)(0x42212498UL)))
#define bM4_AOS_PEVNTODR2_POUT07 (*((volatile unsigned int *)(0x4221249CUL)))
#define bM4_AOS_PEVNTODR2_POUT08 (*((volatile unsigned int *)(0x422124A0UL)))
#define bM4_AOS_PEVNTODR2_POUT09 (*((volatile unsigned int *)(0x422124A4UL)))
#define bM4_AOS_PEVNTODR2_POUT10 (*((volatile unsigned int *)(0x422124A8UL)))
#define bM4_AOS_PEVNTODR2_POUT11 (*((volatile unsigned int *)(0x422124ACUL)))
#define bM4_AOS_PEVNTODR2_POUT12 (*((volatile unsigned int *)(0x422124B0UL)))
#define bM4_AOS_PEVNTODR2_POUT13 (*((volatile unsigned int *)(0x422124B4UL)))
#define bM4_AOS_PEVNTODR2_POUT14 (*((volatile unsigned int *)(0x422124B8UL)))
#define bM4_AOS_PEVNTODR2_POUT15 (*((volatile unsigned int *)(0x422124BCUL)))
#define bM4_AOS_PEVNTORR2_POR00 (*((volatile unsigned int *)(0x42212500UL)))
#define bM4_AOS_PEVNTORR2_POR01 (*((volatile unsigned int *)(0x42212504UL)))
#define bM4_AOS_PEVNTORR2_POR02 (*((volatile unsigned int *)(0x42212508UL)))
#define bM4_AOS_PEVNTORR2_POR03 (*((volatile unsigned int *)(0x4221250CUL)))
#define bM4_AOS_PEVNTORR2_POR04 (*((volatile unsigned int *)(0x42212510UL)))
#define bM4_AOS_PEVNTORR2_POR05 (*((volatile unsigned int *)(0x42212514UL)))
#define bM4_AOS_PEVNTORR2_POR06 (*((volatile unsigned int *)(0x42212518UL)))
#define bM4_AOS_PEVNTORR2_POR07 (*((volatile unsigned int *)(0x4221251CUL)))
#define bM4_AOS_PEVNTORR2_POR08 (*((volatile unsigned int *)(0x42212520UL)))
#define bM4_AOS_PEVNTORR2_POR09 (*((volatile unsigned int *)(0x42212524UL)))
#define bM4_AOS_PEVNTORR2_POR10 (*((volatile unsigned int *)(0x42212528UL)))
#define bM4_AOS_PEVNTORR2_POR11 (*((volatile unsigned int *)(0x4221252CUL)))
#define bM4_AOS_PEVNTORR2_POR12 (*((volatile unsigned int *)(0x42212530UL)))
#define bM4_AOS_PEVNTORR2_POR13 (*((volatile unsigned int *)(0x42212534UL)))
#define bM4_AOS_PEVNTORR2_POR14 (*((volatile unsigned int *)(0x42212538UL)))
#define bM4_AOS_PEVNTORR2_POR15 (*((volatile unsigned int *)(0x4221253CUL)))
#define bM4_AOS_PEVNTOSR2_POS00 (*((volatile unsigned int *)(0x42212580UL)))
#define bM4_AOS_PEVNTOSR2_POS01 (*((volatile unsigned int *)(0x42212584UL)))
#define bM4_AOS_PEVNTOSR2_POS02 (*((volatile unsigned int *)(0x42212588UL)))
#define bM4_AOS_PEVNTOSR2_POS03 (*((volatile unsigned int *)(0x4221258CUL)))
#define bM4_AOS_PEVNTOSR2_POS04 (*((volatile unsigned int *)(0x42212590UL)))
#define bM4_AOS_PEVNTOSR2_POS05 (*((volatile unsigned int *)(0x42212594UL)))
#define bM4_AOS_PEVNTOSR2_POS06 (*((volatile unsigned int *)(0x42212598UL)))
#define bM4_AOS_PEVNTOSR2_POS07 (*((volatile unsigned int *)(0x4221259CUL)))
#define bM4_AOS_PEVNTOSR2_POS08 (*((volatile unsigned int *)(0x422125A0UL)))
#define bM4_AOS_PEVNTOSR2_POS09 (*((volatile unsigned int *)(0x422125A4UL)))
#define bM4_AOS_PEVNTOSR2_POS10 (*((volatile unsigned int *)(0x422125A8UL)))
#define bM4_AOS_PEVNTOSR2_POS11 (*((volatile unsigned int *)(0x422125ACUL)))
#define bM4_AOS_PEVNTOSR2_POS12 (*((volatile unsigned int *)(0x422125B0UL)))
#define bM4_AOS_PEVNTOSR2_POS13 (*((volatile unsigned int *)(0x422125B4UL)))
#define bM4_AOS_PEVNTOSR2_POS14 (*((volatile unsigned int *)(0x422125B8UL)))
#define bM4_AOS_PEVNTOSR2_POS15 (*((volatile unsigned int *)(0x422125BCUL)))
#define bM4_AOS_PEVNTRISR2_RIS00 (*((volatile unsigned int *)(0x42212600UL)))
#define bM4_AOS_PEVNTRISR2_RIS01 (*((volatile unsigned int *)(0x42212604UL)))
#define bM4_AOS_PEVNTRISR2_RIS02 (*((volatile unsigned int *)(0x42212608UL)))
#define bM4_AOS_PEVNTRISR2_RIS03 (*((volatile unsigned int *)(0x4221260CUL)))
#define bM4_AOS_PEVNTRISR2_RIS04 (*((volatile unsigned int *)(0x42212610UL)))
#define bM4_AOS_PEVNTRISR2_RIS05 (*((volatile unsigned int *)(0x42212614UL)))
#define bM4_AOS_PEVNTRISR2_RIS06 (*((volatile unsigned int *)(0x42212618UL)))
#define bM4_AOS_PEVNTRISR2_RIS07 (*((volatile unsigned int *)(0x4221261CUL)))
#define bM4_AOS_PEVNTRISR2_RIS08 (*((volatile unsigned int *)(0x42212620UL)))
#define bM4_AOS_PEVNTRISR2_RIS09 (*((volatile unsigned int *)(0x42212624UL)))
#define bM4_AOS_PEVNTRISR2_RIS10 (*((volatile unsigned int *)(0x42212628UL)))
#define bM4_AOS_PEVNTRISR2_RIS11 (*((volatile unsigned int *)(0x4221262CUL)))
#define bM4_AOS_PEVNTRISR2_RIS12 (*((volatile unsigned int *)(0x42212630UL)))
#define bM4_AOS_PEVNTRISR2_RIS13 (*((volatile unsigned int *)(0x42212634UL)))
#define bM4_AOS_PEVNTRISR2_RIS14 (*((volatile unsigned int *)(0x42212638UL)))
#define bM4_AOS_PEVNTRISR2_RIS15 (*((volatile unsigned int *)(0x4221263CUL)))
#define bM4_AOS_PEVNTFAL2_FAL00 (*((volatile unsigned int *)(0x42212680UL)))
#define bM4_AOS_PEVNTFAL2_FAL01 (*((volatile unsigned int *)(0x42212684UL)))
#define bM4_AOS_PEVNTFAL2_FAL02 (*((volatile unsigned int *)(0x42212688UL)))
#define bM4_AOS_PEVNTFAL2_FAL03 (*((volatile unsigned int *)(0x4221268CUL)))
#define bM4_AOS_PEVNTFAL2_FAL04 (*((volatile unsigned int *)(0x42212690UL)))
#define bM4_AOS_PEVNTFAL2_FAL05 (*((volatile unsigned int *)(0x42212694UL)))
#define bM4_AOS_PEVNTFAL2_FAL06 (*((volatile unsigned int *)(0x42212698UL)))
#define bM4_AOS_PEVNTFAL2_FAL07 (*((volatile unsigned int *)(0x4221269CUL)))
#define bM4_AOS_PEVNTFAL2_FAL08 (*((volatile unsigned int *)(0x422126A0UL)))
#define bM4_AOS_PEVNTFAL2_FAL09 (*((volatile unsigned int *)(0x422126A4UL)))
#define bM4_AOS_PEVNTFAL2_FAL10 (*((volatile unsigned int *)(0x422126A8UL)))
#define bM4_AOS_PEVNTFAL2_FAL11 (*((volatile unsigned int *)(0x422126ACUL)))
#define bM4_AOS_PEVNTFAL2_FAL12 (*((volatile unsigned int *)(0x422126B0UL)))
#define bM4_AOS_PEVNTFAL2_FAL13 (*((volatile unsigned int *)(0x422126B4UL)))
#define bM4_AOS_PEVNTFAL2_FAL14 (*((volatile unsigned int *)(0x422126B8UL)))
#define bM4_AOS_PEVNTFAL2_FAL15 (*((volatile unsigned int *)(0x422126BCUL)))
#define bM4_AOS_PEVNTDIRR3_PDIR00 (*((volatile unsigned int *)(0x42212700UL)))
#define bM4_AOS_PEVNTDIRR3_PDIR01 (*((volatile unsigned int *)(0x42212704UL)))
#define bM4_AOS_PEVNTDIRR3_PDIR02 (*((volatile unsigned int *)(0x42212708UL)))
#define bM4_AOS_PEVNTDIRR3_PDIR03 (*((volatile unsigned int *)(0x4221270CUL)))
#define bM4_AOS_PEVNTDIRR3_PDIR04 (*((volatile unsigned int *)(0x42212710UL)))
#define bM4_AOS_PEVNTDIRR3_PDIR05 (*((volatile unsigned int *)(0x42212714UL)))
#define bM4_AOS_PEVNTDIRR3_PDIR06 (*((volatile unsigned int *)(0x42212718UL)))
#define bM4_AOS_PEVNTDIRR3_PDIR07 (*((volatile unsigned int *)(0x4221271CUL)))
#define bM4_AOS_PEVNTDIRR3_PDIR08 (*((volatile unsigned int *)(0x42212720UL)))
#define bM4_AOS_PEVNTDIRR3_PDIR09 (*((volatile unsigned int *)(0x42212724UL)))
#define bM4_AOS_PEVNTDIRR3_PDIR10 (*((volatile unsigned int *)(0x42212728UL)))
#define bM4_AOS_PEVNTDIRR3_PDIR11 (*((volatile unsigned int *)(0x4221272CUL)))
#define bM4_AOS_PEVNTDIRR3_PDIR12 (*((volatile unsigned int *)(0x42212730UL)))
#define bM4_AOS_PEVNTDIRR3_PDIR13 (*((volatile unsigned int *)(0x42212734UL)))
#define bM4_AOS_PEVNTDIRR3_PDIR14 (*((volatile unsigned int *)(0x42212738UL)))
#define bM4_AOS_PEVNTDIRR3_PDIR15 (*((volatile unsigned int *)(0x4221273CUL)))
#define bM4_AOS_PEVNTIDR3_PIN00 (*((volatile unsigned int *)(0x42212780UL)))
#define bM4_AOS_PEVNTIDR3_PIN01 (*((volatile unsigned int *)(0x42212784UL)))
#define bM4_AOS_PEVNTIDR3_PIN02 (*((volatile unsigned int *)(0x42212788UL)))
#define bM4_AOS_PEVNTIDR3_PIN03 (*((volatile unsigned int *)(0x4221278CUL)))
#define bM4_AOS_PEVNTIDR3_PIN04 (*((volatile unsigned int *)(0x42212790UL)))
#define bM4_AOS_PEVNTIDR3_PIN05 (*((volatile unsigned int *)(0x42212794UL)))
#define bM4_AOS_PEVNTIDR3_PIN06 (*((volatile unsigned int *)(0x42212798UL)))
#define bM4_AOS_PEVNTIDR3_PIN07 (*((volatile unsigned int *)(0x4221279CUL)))
#define bM4_AOS_PEVNTIDR3_PIN08 (*((volatile unsigned int *)(0x422127A0UL)))
#define bM4_AOS_PEVNTIDR3_PIN09 (*((volatile unsigned int *)(0x422127A4UL)))
#define bM4_AOS_PEVNTIDR3_PIN10 (*((volatile unsigned int *)(0x422127A8UL)))
#define bM4_AOS_PEVNTIDR3_PIN11 (*((volatile unsigned int *)(0x422127ACUL)))
#define bM4_AOS_PEVNTIDR3_PIN12 (*((volatile unsigned int *)(0x422127B0UL)))
#define bM4_AOS_PEVNTIDR3_PIN13 (*((volatile unsigned int *)(0x422127B4UL)))
#define bM4_AOS_PEVNTIDR3_PIN14 (*((volatile unsigned int *)(0x422127B8UL)))
#define bM4_AOS_PEVNTIDR3_PIN15 (*((volatile unsigned int *)(0x422127BCUL)))
#define bM4_AOS_PEVNTODR3_POUT00 (*((volatile unsigned int *)(0x42212800UL)))
#define bM4_AOS_PEVNTODR3_POUT01 (*((volatile unsigned int *)(0x42212804UL)))
#define bM4_AOS_PEVNTODR3_POUT02 (*((volatile unsigned int *)(0x42212808UL)))
#define bM4_AOS_PEVNTODR3_POUT03 (*((volatile unsigned int *)(0x4221280CUL)))
#define bM4_AOS_PEVNTODR3_POUT04 (*((volatile unsigned int *)(0x42212810UL)))
#define bM4_AOS_PEVNTODR3_POUT05 (*((volatile unsigned int *)(0x42212814UL)))
#define bM4_AOS_PEVNTODR3_POUT06 (*((volatile unsigned int *)(0x42212818UL)))
#define bM4_AOS_PEVNTODR3_POUT07 (*((volatile unsigned int *)(0x4221281CUL)))
#define bM4_AOS_PEVNTODR3_POUT08 (*((volatile unsigned int *)(0x42212820UL)))
#define bM4_AOS_PEVNTODR3_POUT09 (*((volatile unsigned int *)(0x42212824UL)))
#define bM4_AOS_PEVNTODR3_POUT10 (*((volatile unsigned int *)(0x42212828UL)))
#define bM4_AOS_PEVNTODR3_POUT11 (*((volatile unsigned int *)(0x4221282CUL)))
#define bM4_AOS_PEVNTODR3_POUT12 (*((volatile unsigned int *)(0x42212830UL)))
#define bM4_AOS_PEVNTODR3_POUT13 (*((volatile unsigned int *)(0x42212834UL)))
#define bM4_AOS_PEVNTODR3_POUT14 (*((volatile unsigned int *)(0x42212838UL)))
#define bM4_AOS_PEVNTODR3_POUT15 (*((volatile unsigned int *)(0x4221283CUL)))
#define bM4_AOS_PEVNTORR3_POR00 (*((volatile unsigned int *)(0x42212880UL)))
#define bM4_AOS_PEVNTORR3_POR01 (*((volatile unsigned int *)(0x42212884UL)))
#define bM4_AOS_PEVNTORR3_POR02 (*((volatile unsigned int *)(0x42212888UL)))
#define bM4_AOS_PEVNTORR3_POR03 (*((volatile unsigned int *)(0x4221288CUL)))
#define bM4_AOS_PEVNTORR3_POR04 (*((volatile unsigned int *)(0x42212890UL)))
#define bM4_AOS_PEVNTORR3_POR05 (*((volatile unsigned int *)(0x42212894UL)))
#define bM4_AOS_PEVNTORR3_POR06 (*((volatile unsigned int *)(0x42212898UL)))
#define bM4_AOS_PEVNTORR3_POR07 (*((volatile unsigned int *)(0x4221289CUL)))
#define bM4_AOS_PEVNTORR3_POR08 (*((volatile unsigned int *)(0x422128A0UL)))
#define bM4_AOS_PEVNTORR3_POR09 (*((volatile unsigned int *)(0x422128A4UL)))
#define bM4_AOS_PEVNTORR3_POR10 (*((volatile unsigned int *)(0x422128A8UL)))
#define bM4_AOS_PEVNTORR3_POR11 (*((volatile unsigned int *)(0x422128ACUL)))
#define bM4_AOS_PEVNTORR3_POR12 (*((volatile unsigned int *)(0x422128B0UL)))
#define bM4_AOS_PEVNTORR3_POR13 (*((volatile unsigned int *)(0x422128B4UL)))
#define bM4_AOS_PEVNTORR3_POR14 (*((volatile unsigned int *)(0x422128B8UL)))
#define bM4_AOS_PEVNTORR3_POR15 (*((volatile unsigned int *)(0x422128BCUL)))
#define bM4_AOS_PEVNTOSR3_POS00 (*((volatile unsigned int *)(0x42212900UL)))
#define bM4_AOS_PEVNTOSR3_POS01 (*((volatile unsigned int *)(0x42212904UL)))
#define bM4_AOS_PEVNTOSR3_POS02 (*((volatile unsigned int *)(0x42212908UL)))
#define bM4_AOS_PEVNTOSR3_POS03 (*((volatile unsigned int *)(0x4221290CUL)))
#define bM4_AOS_PEVNTOSR3_POS04 (*((volatile unsigned int *)(0x42212910UL)))
#define bM4_AOS_PEVNTOSR3_POS05 (*((volatile unsigned int *)(0x42212914UL)))
#define bM4_AOS_PEVNTOSR3_POS06 (*((volatile unsigned int *)(0x42212918UL)))
#define bM4_AOS_PEVNTOSR3_POS07 (*((volatile unsigned int *)(0x4221291CUL)))
#define bM4_AOS_PEVNTOSR3_POS08 (*((volatile unsigned int *)(0x42212920UL)))
#define bM4_AOS_PEVNTOSR3_POS09 (*((volatile unsigned int *)(0x42212924UL)))
#define bM4_AOS_PEVNTOSR3_POS10 (*((volatile unsigned int *)(0x42212928UL)))
#define bM4_AOS_PEVNTOSR3_POS11 (*((volatile unsigned int *)(0x4221292CUL)))
#define bM4_AOS_PEVNTOSR3_POS12 (*((volatile unsigned int *)(0x42212930UL)))
#define bM4_AOS_PEVNTOSR3_POS13 (*((volatile unsigned int *)(0x42212934UL)))
#define bM4_AOS_PEVNTOSR3_POS14 (*((volatile unsigned int *)(0x42212938UL)))
#define bM4_AOS_PEVNTOSR3_POS15 (*((volatile unsigned int *)(0x4221293CUL)))
#define bM4_AOS_PEVNTRISR3_RIS00 (*((volatile unsigned int *)(0x42212980UL)))
#define bM4_AOS_PEVNTRISR3_RIS01 (*((volatile unsigned int *)(0x42212984UL)))
#define bM4_AOS_PEVNTRISR3_RIS02 (*((volatile unsigned int *)(0x42212988UL)))
#define bM4_AOS_PEVNTRISR3_RIS03 (*((volatile unsigned int *)(0x4221298CUL)))
#define bM4_AOS_PEVNTRISR3_RIS04 (*((volatile unsigned int *)(0x42212990UL)))
#define bM4_AOS_PEVNTRISR3_RIS05 (*((volatile unsigned int *)(0x42212994UL)))
#define bM4_AOS_PEVNTRISR3_RIS06 (*((volatile unsigned int *)(0x42212998UL)))
#define bM4_AOS_PEVNTRISR3_RIS07 (*((volatile unsigned int *)(0x4221299CUL)))
#define bM4_AOS_PEVNTRISR3_RIS08 (*((volatile unsigned int *)(0x422129A0UL)))
#define bM4_AOS_PEVNTRISR3_RIS09 (*((volatile unsigned int *)(0x422129A4UL)))
#define bM4_AOS_PEVNTRISR3_RIS10 (*((volatile unsigned int *)(0x422129A8UL)))
#define bM4_AOS_PEVNTRISR3_RIS11 (*((volatile unsigned int *)(0x422129ACUL)))
#define bM4_AOS_PEVNTRISR3_RIS12 (*((volatile unsigned int *)(0x422129B0UL)))
#define bM4_AOS_PEVNTRISR3_RIS13 (*((volatile unsigned int *)(0x422129B4UL)))
#define bM4_AOS_PEVNTRISR3_RIS14 (*((volatile unsigned int *)(0x422129B8UL)))
#define bM4_AOS_PEVNTRISR3_RIS15 (*((volatile unsigned int *)(0x422129BCUL)))
#define bM4_AOS_PEVNTFAL3_FAL00 (*((volatile unsigned int *)(0x42212A00UL)))
#define bM4_AOS_PEVNTFAL3_FAL01 (*((volatile unsigned int *)(0x42212A04UL)))
#define bM4_AOS_PEVNTFAL3_FAL02 (*((volatile unsigned int *)(0x42212A08UL)))
#define bM4_AOS_PEVNTFAL3_FAL03 (*((volatile unsigned int *)(0x42212A0CUL)))
#define bM4_AOS_PEVNTFAL3_FAL04 (*((volatile unsigned int *)(0x42212A10UL)))
#define bM4_AOS_PEVNTFAL3_FAL05 (*((volatile unsigned int *)(0x42212A14UL)))
#define bM4_AOS_PEVNTFAL3_FAL06 (*((volatile unsigned int *)(0x42212A18UL)))
#define bM4_AOS_PEVNTFAL3_FAL07 (*((volatile unsigned int *)(0x42212A1CUL)))
#define bM4_AOS_PEVNTFAL3_FAL08 (*((volatile unsigned int *)(0x42212A20UL)))
#define bM4_AOS_PEVNTFAL3_FAL09 (*((volatile unsigned int *)(0x42212A24UL)))
#define bM4_AOS_PEVNTFAL3_FAL10 (*((volatile unsigned int *)(0x42212A28UL)))
#define bM4_AOS_PEVNTFAL3_FAL11 (*((volatile unsigned int *)(0x42212A2CUL)))
#define bM4_AOS_PEVNTFAL3_FAL12 (*((volatile unsigned int *)(0x42212A30UL)))
#define bM4_AOS_PEVNTFAL3_FAL13 (*((volatile unsigned int *)(0x42212A34UL)))
#define bM4_AOS_PEVNTFAL3_FAL14 (*((volatile unsigned int *)(0x42212A38UL)))
#define bM4_AOS_PEVNTFAL3_FAL15 (*((volatile unsigned int *)(0x42212A3CUL)))
#define bM4_AOS_PEVNTDIRR4_PDIR00 (*((volatile unsigned int *)(0x42212A80UL)))
#define bM4_AOS_PEVNTDIRR4_PDIR01 (*((volatile unsigned int *)(0x42212A84UL)))
#define bM4_AOS_PEVNTDIRR4_PDIR02 (*((volatile unsigned int *)(0x42212A88UL)))
#define bM4_AOS_PEVNTDIRR4_PDIR03 (*((volatile unsigned int *)(0x42212A8CUL)))
#define bM4_AOS_PEVNTDIRR4_PDIR04 (*((volatile unsigned int *)(0x42212A90UL)))
#define bM4_AOS_PEVNTDIRR4_PDIR05 (*((volatile unsigned int *)(0x42212A94UL)))
#define bM4_AOS_PEVNTDIRR4_PDIR06 (*((volatile unsigned int *)(0x42212A98UL)))
#define bM4_AOS_PEVNTDIRR4_PDIR07 (*((volatile unsigned int *)(0x42212A9CUL)))
#define bM4_AOS_PEVNTDIRR4_PDIR08 (*((volatile unsigned int *)(0x42212AA0UL)))
#define bM4_AOS_PEVNTDIRR4_PDIR09 (*((volatile unsigned int *)(0x42212AA4UL)))
#define bM4_AOS_PEVNTDIRR4_PDIR10 (*((volatile unsigned int *)(0x42212AA8UL)))
#define bM4_AOS_PEVNTDIRR4_PDIR11 (*((volatile unsigned int *)(0x42212AACUL)))
#define bM4_AOS_PEVNTDIRR4_PDIR12 (*((volatile unsigned int *)(0x42212AB0UL)))
#define bM4_AOS_PEVNTDIRR4_PDIR13 (*((volatile unsigned int *)(0x42212AB4UL)))
#define bM4_AOS_PEVNTDIRR4_PDIR14 (*((volatile unsigned int *)(0x42212AB8UL)))
#define bM4_AOS_PEVNTDIRR4_PDIR15 (*((volatile unsigned int *)(0x42212ABCUL)))
#define bM4_AOS_PEVNTIDR4_PIN00 (*((volatile unsigned int *)(0x42212B00UL)))
#define bM4_AOS_PEVNTIDR4_PIN01 (*((volatile unsigned int *)(0x42212B04UL)))
#define bM4_AOS_PEVNTIDR4_PIN02 (*((volatile unsigned int *)(0x42212B08UL)))
#define bM4_AOS_PEVNTIDR4_PIN03 (*((volatile unsigned int *)(0x42212B0CUL)))
#define bM4_AOS_PEVNTIDR4_PIN04 (*((volatile unsigned int *)(0x42212B10UL)))
#define bM4_AOS_PEVNTIDR4_PIN05 (*((volatile unsigned int *)(0x42212B14UL)))
#define bM4_AOS_PEVNTIDR4_PIN06 (*((volatile unsigned int *)(0x42212B18UL)))
#define bM4_AOS_PEVNTIDR4_PIN07 (*((volatile unsigned int *)(0x42212B1CUL)))
#define bM4_AOS_PEVNTIDR4_PIN08 (*((volatile unsigned int *)(0x42212B20UL)))
#define bM4_AOS_PEVNTIDR4_PIN09 (*((volatile unsigned int *)(0x42212B24UL)))
