MarlinFirmware/Marlin/Marlin/lib/h32_core/main/hdsc32core/common/hc32f46x.h
#define bM4_AOS_PEVNTIDR4_PIN10 (*((volatile unsigned int *)(0x42212B28UL)))
#define bM4_AOS_PEVNTIDR4_PIN11 (*((volatile unsigned int *)(0x42212B2CUL)))
#define bM4_AOS_PEVNTIDR4_PIN12 (*((volatile unsigned int *)(0x42212B30UL)))
#define bM4_AOS_PEVNTIDR4_PIN13 (*((volatile unsigned int *)(0x42212B34UL)))
#define bM4_AOS_PEVNTIDR4_PIN14 (*((volatile unsigned int *)(0x42212B38UL)))
#define bM4_AOS_PEVNTIDR4_PIN15 (*((volatile unsigned int *)(0x42212B3CUL)))
#define bM4_AOS_PEVNTODR4_POUT00 (*((volatile unsigned int *)(0x42212B80UL)))
#define bM4_AOS_PEVNTODR4_POUT01 (*((volatile unsigned int *)(0x42212B84UL)))
#define bM4_AOS_PEVNTODR4_POUT02 (*((volatile unsigned int *)(0x42212B88UL)))
#define bM4_AOS_PEVNTODR4_POUT03 (*((volatile unsigned int *)(0x42212B8CUL)))
#define bM4_AOS_PEVNTODR4_POUT04 (*((volatile unsigned int *)(0x42212B90UL)))
#define bM4_AOS_PEVNTODR4_POUT05 (*((volatile unsigned int *)(0x42212B94UL)))
#define bM4_AOS_PEVNTODR4_POUT06 (*((volatile unsigned int *)(0x42212B98UL)))
#define bM4_AOS_PEVNTODR4_POUT07 (*((volatile unsigned int *)(0x42212B9CUL)))
#define bM4_AOS_PEVNTODR4_POUT08 (*((volatile unsigned int *)(0x42212BA0UL)))
#define bM4_AOS_PEVNTODR4_POUT09 (*((volatile unsigned int *)(0x42212BA4UL)))
#define bM4_AOS_PEVNTODR4_POUT10 (*((volatile unsigned int *)(0x42212BA8UL)))
#define bM4_AOS_PEVNTODR4_POUT11 (*((volatile unsigned int *)(0x42212BACUL)))
#define bM4_AOS_PEVNTODR4_POUT12 (*((volatile unsigned int *)(0x42212BB0UL)))
#define bM4_AOS_PEVNTODR4_POUT13 (*((volatile unsigned int *)(0x42212BB4UL)))
#define bM4_AOS_PEVNTODR4_POUT14 (*((volatile unsigned int *)(0x42212BB8UL)))
#define bM4_AOS_PEVNTODR4_POUT15 (*((volatile unsigned int *)(0x42212BBCUL)))
#define bM4_AOS_PEVNTORR4_POR00 (*((volatile unsigned int *)(0x42212C00UL)))
#define bM4_AOS_PEVNTORR4_POR01 (*((volatile unsigned int *)(0x42212C04UL)))
#define bM4_AOS_PEVNTORR4_POR02 (*((volatile unsigned int *)(0x42212C08UL)))
#define bM4_AOS_PEVNTORR4_POR03 (*((volatile unsigned int *)(0x42212C0CUL)))
#define bM4_AOS_PEVNTORR4_POR04 (*((volatile unsigned int *)(0x42212C10UL)))
#define bM4_AOS_PEVNTORR4_POR05 (*((volatile unsigned int *)(0x42212C14UL)))
#define bM4_AOS_PEVNTORR4_POR06 (*((volatile unsigned int *)(0x42212C18UL)))
#define bM4_AOS_PEVNTORR4_POR07 (*((volatile unsigned int *)(0x42212C1CUL)))
#define bM4_AOS_PEVNTORR4_POR08 (*((volatile unsigned int *)(0x42212C20UL)))
#define bM4_AOS_PEVNTORR4_POR09 (*((volatile unsigned int *)(0x42212C24UL)))
#define bM4_AOS_PEVNTORR4_POR10 (*((volatile unsigned int *)(0x42212C28UL)))
#define bM4_AOS_PEVNTORR4_POR11 (*((volatile unsigned int *)(0x42212C2CUL)))
#define bM4_AOS_PEVNTORR4_POR12 (*((volatile unsigned int *)(0x42212C30UL)))
#define bM4_AOS_PEVNTORR4_POR13 (*((volatile unsigned int *)(0x42212C34UL)))
#define bM4_AOS_PEVNTORR4_POR14 (*((volatile unsigned int *)(0x42212C38UL)))
#define bM4_AOS_PEVNTORR4_POR15 (*((volatile unsigned int *)(0x42212C3CUL)))
#define bM4_AOS_PEVNTOSR4_POS00 (*((volatile unsigned int *)(0x42212C80UL)))
#define bM4_AOS_PEVNTOSR4_POS01 (*((volatile unsigned int *)(0x42212C84UL)))
#define bM4_AOS_PEVNTOSR4_POS02 (*((volatile unsigned int *)(0x42212C88UL)))
#define bM4_AOS_PEVNTOSR4_POS03 (*((volatile unsigned int *)(0x42212C8CUL)))
#define bM4_AOS_PEVNTOSR4_POS04 (*((volatile unsigned int *)(0x42212C90UL)))
#define bM4_AOS_PEVNTOSR4_POS05 (*((volatile unsigned int *)(0x42212C94UL)))
#define bM4_AOS_PEVNTOSR4_POS06 (*((volatile unsigned int *)(0x42212C98UL)))
#define bM4_AOS_PEVNTOSR4_POS07 (*((volatile unsigned int *)(0x42212C9CUL)))
#define bM4_AOS_PEVNTOSR4_POS08 (*((volatile unsigned int *)(0x42212CA0UL)))
#define bM4_AOS_PEVNTOSR4_POS09 (*((volatile unsigned int *)(0x42212CA4UL)))
#define bM4_AOS_PEVNTOSR4_POS10 (*((volatile unsigned int *)(0x42212CA8UL)))
#define bM4_AOS_PEVNTOSR4_POS11 (*((volatile unsigned int *)(0x42212CACUL)))
#define bM4_AOS_PEVNTOSR4_POS12 (*((volatile unsigned int *)(0x42212CB0UL)))
#define bM4_AOS_PEVNTOSR4_POS13 (*((volatile unsigned int *)(0x42212CB4UL)))
#define bM4_AOS_PEVNTOSR4_POS14 (*((volatile unsigned int *)(0x42212CB8UL)))
#define bM4_AOS_PEVNTOSR4_POS15 (*((volatile unsigned int *)(0x42212CBCUL)))
#define bM4_AOS_PEVNTRISR4_RIS00 (*((volatile unsigned int *)(0x42212D00UL)))
#define bM4_AOS_PEVNTRISR4_RIS01 (*((volatile unsigned int *)(0x42212D04UL)))
#define bM4_AOS_PEVNTRISR4_RIS02 (*((volatile unsigned int *)(0x42212D08UL)))
#define bM4_AOS_PEVNTRISR4_RIS03 (*((volatile unsigned int *)(0x42212D0CUL)))
#define bM4_AOS_PEVNTRISR4_RIS04 (*((volatile unsigned int *)(0x42212D10UL)))
#define bM4_AOS_PEVNTRISR4_RIS05 (*((volatile unsigned int *)(0x42212D14UL)))
#define bM4_AOS_PEVNTRISR4_RIS06 (*((volatile unsigned int *)(0x42212D18UL)))
#define bM4_AOS_PEVNTRISR4_RIS07 (*((volatile unsigned int *)(0x42212D1CUL)))
#define bM4_AOS_PEVNTRISR4_RIS08 (*((volatile unsigned int *)(0x42212D20UL)))
#define bM4_AOS_PEVNTRISR4_RIS09 (*((volatile unsigned int *)(0x42212D24UL)))
#define bM4_AOS_PEVNTRISR4_RIS10 (*((volatile unsigned int *)(0x42212D28UL)))
#define bM4_AOS_PEVNTRISR4_RIS11 (*((volatile unsigned int *)(0x42212D2CUL)))
#define bM4_AOS_PEVNTRISR4_RIS12 (*((volatile unsigned int *)(0x42212D30UL)))
#define bM4_AOS_PEVNTRISR4_RIS13 (*((volatile unsigned int *)(0x42212D34UL)))
#define bM4_AOS_PEVNTRISR4_RIS14 (*((volatile unsigned int *)(0x42212D38UL)))
#define bM4_AOS_PEVNTRISR4_RIS15 (*((volatile unsigned int *)(0x42212D3CUL)))
#define bM4_AOS_PEVNTFAL4_FAL00 (*((volatile unsigned int *)(0x42212D80UL)))
#define bM4_AOS_PEVNTFAL4_FAL01 (*((volatile unsigned int *)(0x42212D84UL)))
#define bM4_AOS_PEVNTFAL4_FAL02 (*((volatile unsigned int *)(0x42212D88UL)))
#define bM4_AOS_PEVNTFAL4_FAL03 (*((volatile unsigned int *)(0x42212D8CUL)))
#define bM4_AOS_PEVNTFAL4_FAL04 (*((volatile unsigned int *)(0x42212D90UL)))
#define bM4_AOS_PEVNTFAL4_FAL05 (*((volatile unsigned int *)(0x42212D94UL)))
#define bM4_AOS_PEVNTFAL4_FAL06 (*((volatile unsigned int *)(0x42212D98UL)))
#define bM4_AOS_PEVNTFAL4_FAL07 (*((volatile unsigned int *)(0x42212D9CUL)))
#define bM4_AOS_PEVNTFAL4_FAL08 (*((volatile unsigned int *)(0x42212DA0UL)))
#define bM4_AOS_PEVNTFAL4_FAL09 (*((volatile unsigned int *)(0x42212DA4UL)))
#define bM4_AOS_PEVNTFAL4_FAL10 (*((volatile unsigned int *)(0x42212DA8UL)))
#define bM4_AOS_PEVNTFAL4_FAL11 (*((volatile unsigned int *)(0x42212DACUL)))
#define bM4_AOS_PEVNTFAL4_FAL12 (*((volatile unsigned int *)(0x42212DB0UL)))
#define bM4_AOS_PEVNTFAL4_FAL13 (*((volatile unsigned int *)(0x42212DB4UL)))
#define bM4_AOS_PEVNTFAL4_FAL14 (*((volatile unsigned int *)(0x42212DB8UL)))
#define bM4_AOS_PEVNTFAL4_FAL15 (*((volatile unsigned int *)(0x42212DBCUL)))
#define bM4_AOS_PEVNTNFCR_NFEN1 (*((volatile unsigned int *)(0x42212E00UL)))
#define bM4_AOS_PEVNTNFCR_DIVS10 (*((volatile unsigned int *)(0x42212E04UL)))
#define bM4_AOS_PEVNTNFCR_DIVS11 (*((volatile unsigned int *)(0x42212E08UL)))
#define bM4_AOS_PEVNTNFCR_NFEN2 (*((volatile unsigned int *)(0x42212E20UL)))
#define bM4_AOS_PEVNTNFCR_DIVS20 (*((volatile unsigned int *)(0x42212E24UL)))
#define bM4_AOS_PEVNTNFCR_DIVS21 (*((volatile unsigned int *)(0x42212E28UL)))
#define bM4_AOS_PEVNTNFCR_NFEN3 (*((volatile unsigned int *)(0x42212E40UL)))
#define bM4_AOS_PEVNTNFCR_DIVS30 (*((volatile unsigned int *)(0x42212E44UL)))
#define bM4_AOS_PEVNTNFCR_DIVS31 (*((volatile unsigned int *)(0x42212E48UL)))
#define bM4_AOS_PEVNTNFCR_NFEN4 (*((volatile unsigned int *)(0x42212E60UL)))
#define bM4_AOS_PEVNTNFCR_DIVS40 (*((volatile unsigned int *)(0x42212E64UL)))
#define bM4_AOS_PEVNTNFCR_DIVS41 (*((volatile unsigned int *)(0x42212E68UL)))
#define bM4_CAN_CFG_STAT_BUSOFF (*((volatile unsigned int *)(0x42E09400UL)))
#define bM4_CAN_CFG_STAT_TACTIVE (*((volatile unsigned int *)(0x42E09404UL)))
#define bM4_CAN_CFG_STAT_RACTIVE (*((volatile unsigned int *)(0x42E09408UL)))
#define bM4_CAN_CFG_STAT_TSSS (*((volatile unsigned int *)(0x42E0940CUL)))
#define bM4_CAN_CFG_STAT_TPSS (*((volatile unsigned int *)(0x42E09410UL)))
#define bM4_CAN_CFG_STAT_LBMI (*((volatile unsigned int *)(0x42E09414UL)))
#define bM4_CAN_CFG_STAT_LBME (*((volatile unsigned int *)(0x42E09418UL)))
#define bM4_CAN_CFG_STAT_RESET (*((volatile unsigned int *)(0x42E0941CUL)))
#define bM4_CAN_TCMD_TSA (*((volatile unsigned int *)(0x42E09420UL)))
#define bM4_CAN_TCMD_TSALL (*((volatile unsigned int *)(0x42E09424UL)))
#define bM4_CAN_TCMD_TSONE (*((volatile unsigned int *)(0x42E09428UL)))
#define bM4_CAN_TCMD_TPA (*((volatile unsigned int *)(0x42E0942CUL)))
#define bM4_CAN_TCMD_TPE (*((volatile unsigned int *)(0x42E09430UL)))
#define bM4_CAN_TCMD_STBY (*((volatile unsigned int *)(0x42E09434UL)))
#define bM4_CAN_TCMD_LOM (*((volatile unsigned int *)(0x42E09438UL)))
#define bM4_CAN_TCMD_TBSEL (*((volatile unsigned int *)(0x42E0943CUL)))
#define bM4_CAN_TCTRL_TSSTAT0 (*((volatile unsigned int *)(0x42E09440UL)))
#define bM4_CAN_TCTRL_TSSTAT1 (*((volatile unsigned int *)(0x42E09444UL)))
#define bM4_CAN_TCTRL_TTBM (*((volatile unsigned int *)(0x42E09450UL)))
#define bM4_CAN_TCTRL_TSMODE (*((volatile unsigned int *)(0x42E09454UL)))
#define bM4_CAN_TCTRL_TSNEXT (*((volatile unsigned int *)(0x42E09458UL)))
#define bM4_CAN_RCTRL_RSSTAT0 (*((volatile unsigned int *)(0x42E09460UL)))
#define bM4_CAN_RCTRL_RSSTAT1 (*((volatile unsigned int *)(0x42E09464UL)))
#define bM4_CAN_RCTRL_RBALL (*((volatile unsigned int *)(0x42E0946CUL)))
#define bM4_CAN_RCTRL_RREL (*((volatile unsigned int *)(0x42E09470UL)))
#define bM4_CAN_RCTRL_ROV (*((volatile unsigned int *)(0x42E09474UL)))
#define bM4_CAN_RCTRL_ROM (*((volatile unsigned int *)(0x42E09478UL)))
#define bM4_CAN_RCTRL_SACK (*((volatile unsigned int *)(0x42E0947CUL)))
#define bM4_CAN_RTIE_TSFF (*((volatile unsigned int *)(0x42E09480UL)))
#define bM4_CAN_RTIE_EIE (*((volatile unsigned int *)(0x42E09484UL)))
#define bM4_CAN_RTIE_TSIE (*((volatile unsigned int *)(0x42E09488UL)))
#define bM4_CAN_RTIE_TPIE (*((volatile unsigned int *)(0x42E0948CUL)))
#define bM4_CAN_RTIE_RAFIE (*((volatile unsigned int *)(0x42E09490UL)))
#define bM4_CAN_RTIE_RFIE (*((volatile unsigned int *)(0x42E09494UL)))
#define bM4_CAN_RTIE_ROIE (*((volatile unsigned int *)(0x42E09498UL)))
#define bM4_CAN_RTIE_RIE (*((volatile unsigned int *)(0x42E0949CUL)))
#define bM4_CAN_RTIF_AIF (*((volatile unsigned int *)(0x42E094A0UL)))
#define bM4_CAN_RTIF_EIF (*((volatile unsigned int *)(0x42E094A4UL)))
#define bM4_CAN_RTIF_TSIF (*((volatile unsigned int *)(0x42E094A8UL)))
#define bM4_CAN_RTIF_TPIF (*((volatile unsigned int *)(0x42E094ACUL)))
#define bM4_CAN_RTIF_RAFIF (*((volatile unsigned int *)(0x42E094B0UL)))
#define bM4_CAN_RTIF_RFIF (*((volatile unsigned int *)(0x42E094B4UL)))
#define bM4_CAN_RTIF_ROIF (*((volatile unsigned int *)(0x42E094B8UL)))
#define bM4_CAN_RTIF_RIF (*((volatile unsigned int *)(0x42E094BCUL)))
#define bM4_CAN_ERRINT_BEIF (*((volatile unsigned int *)(0x42E094C0UL)))
#define bM4_CAN_ERRINT_BEIE (*((volatile unsigned int *)(0x42E094C4UL)))
#define bM4_CAN_ERRINT_ALIF (*((volatile unsigned int *)(0x42E094C8UL)))
#define bM4_CAN_ERRINT_ALIE (*((volatile unsigned int *)(0x42E094CCUL)))
#define bM4_CAN_ERRINT_EPIF (*((volatile unsigned int *)(0x42E094D0UL)))
#define bM4_CAN_ERRINT_EPIE (*((volatile unsigned int *)(0x42E094D4UL)))
#define bM4_CAN_ERRINT_EPASS (*((volatile unsigned int *)(0x42E094D8UL)))
#define bM4_CAN_ERRINT_EWARN (*((volatile unsigned int *)(0x42E094DCUL)))
#define bM4_CAN_LIMIT_EWL0 (*((volatile unsigned int *)(0x42E094E0UL)))
#define bM4_CAN_LIMIT_EWL1 (*((volatile unsigned int *)(0x42E094E4UL)))
#define bM4_CAN_LIMIT_EWL2 (*((volatile unsigned int *)(0x42E094E8UL)))
#define bM4_CAN_LIMIT_EWL3 (*((volatile unsigned int *)(0x42E094ECUL)))
#define bM4_CAN_LIMIT_AFWL0 (*((volatile unsigned int *)(0x42E094F0UL)))
#define bM4_CAN_LIMIT_AFWL1 (*((volatile unsigned int *)(0x42E094F4UL)))
#define bM4_CAN_LIMIT_AFWL2 (*((volatile unsigned int *)(0x42E094F8UL)))
#define bM4_CAN_LIMIT_AFWL3 (*((volatile unsigned int *)(0x42E094FCUL)))
#define bM4_CAN_BT_SEG_10 (*((volatile unsigned int *)(0x42E09500UL)))
#define bM4_CAN_BT_SEG_11 (*((volatile unsigned int *)(0x42E09504UL)))
#define bM4_CAN_BT_SEG_12 (*((volatile unsigned int *)(0x42E09508UL)))
#define bM4_CAN_BT_SEG_13 (*((volatile unsigned int *)(0x42E0950CUL)))
#define bM4_CAN_BT_SEG_14 (*((volatile unsigned int *)(0x42E09510UL)))
#define bM4_CAN_BT_SEG_15 (*((volatile unsigned int *)(0x42E09514UL)))
#define bM4_CAN_BT_SEG_16 (*((volatile unsigned int *)(0x42E09518UL)))
#define bM4_CAN_BT_SEG_17 (*((volatile unsigned int *)(0x42E0951CUL)))
#define bM4_CAN_BT_SEG_20 (*((volatile unsigned int *)(0x42E09520UL)))
#define bM4_CAN_BT_SEG_21 (*((volatile unsigned int *)(0x42E09524UL)))
#define bM4_CAN_BT_SEG_22 (*((volatile unsigned int *)(0x42E09528UL)))
#define bM4_CAN_BT_SEG_23 (*((volatile unsigned int *)(0x42E0952CUL)))
#define bM4_CAN_BT_SEG_24 (*((volatile unsigned int *)(0x42E09530UL)))
#define bM4_CAN_BT_SEG_25 (*((volatile unsigned int *)(0x42E09534UL)))
#define bM4_CAN_BT_SEG_26 (*((volatile unsigned int *)(0x42E09538UL)))
#define bM4_CAN_BT_SJW0 (*((volatile unsigned int *)(0x42E09540UL)))
#define bM4_CAN_BT_SJW1 (*((volatile unsigned int *)(0x42E09544UL)))
#define bM4_CAN_BT_SJW2 (*((volatile unsigned int *)(0x42E09548UL)))
#define bM4_CAN_BT_SJW3 (*((volatile unsigned int *)(0x42E0954CUL)))
#define bM4_CAN_BT_SJW4 (*((volatile unsigned int *)(0x42E09550UL)))
#define bM4_CAN_BT_SJW5 (*((volatile unsigned int *)(0x42E09554UL)))
#define bM4_CAN_BT_SJW6 (*((volatile unsigned int *)(0x42E09558UL)))
#define bM4_CAN_BT_PRESC0 (*((volatile unsigned int *)(0x42E09560UL)))
#define bM4_CAN_BT_PRESC1 (*((volatile unsigned int *)(0x42E09564UL)))
#define bM4_CAN_BT_PRESC2 (*((volatile unsigned int *)(0x42E09568UL)))
#define bM4_CAN_BT_PRESC3 (*((volatile unsigned int *)(0x42E0956CUL)))
#define bM4_CAN_BT_PRESC4 (*((volatile unsigned int *)(0x42E09570UL)))
#define bM4_CAN_BT_PRESC5 (*((volatile unsigned int *)(0x42E09574UL)))
#define bM4_CAN_BT_PRESC6 (*((volatile unsigned int *)(0x42E09578UL)))
#define bM4_CAN_BT_PRESC7 (*((volatile unsigned int *)(0x42E0957CUL)))
#define bM4_CAN_EALCAP_ALC0 (*((volatile unsigned int *)(0x42E09600UL)))
#define bM4_CAN_EALCAP_ALC1 (*((volatile unsigned int *)(0x42E09604UL)))
#define bM4_CAN_EALCAP_ALC2 (*((volatile unsigned int *)(0x42E09608UL)))
#define bM4_CAN_EALCAP_ALC3 (*((volatile unsigned int *)(0x42E0960CUL)))
#define bM4_CAN_EALCAP_ALC4 (*((volatile unsigned int *)(0x42E09610UL)))
#define bM4_CAN_EALCAP_KOER0 (*((volatile unsigned int *)(0x42E09614UL)))
#define bM4_CAN_EALCAP_KOER1 (*((volatile unsigned int *)(0x42E09618UL)))
#define bM4_CAN_EALCAP_KOER2 (*((volatile unsigned int *)(0x42E0961CUL)))
#define bM4_CAN_ACFCTRL_ACFADR0 (*((volatile unsigned int *)(0x42E09680UL)))
#define bM4_CAN_ACFCTRL_ACFADR1 (*((volatile unsigned int *)(0x42E09684UL)))
#define bM4_CAN_ACFCTRL_ACFADR2 (*((volatile unsigned int *)(0x42E09688UL)))
#define bM4_CAN_ACFCTRL_ACFADR3 (*((volatile unsigned int *)(0x42E0968CUL)))
#define bM4_CAN_ACFCTRL_SELMASK (*((volatile unsigned int *)(0x42E09694UL)))
#define bM4_CAN_ACFEN_AE_1 (*((volatile unsigned int *)(0x42E096C0UL)))
#define bM4_CAN_ACFEN_AE_2 (*((volatile unsigned int *)(0x42E096C4UL)))
#define bM4_CAN_ACFEN_AE_3 (*((volatile unsigned int *)(0x42E096C8UL)))
#define bM4_CAN_ACFEN_AE_4 (*((volatile unsigned int *)(0x42E096CCUL)))
#define bM4_CAN_ACFEN_AE_5 (*((volatile unsigned int *)(0x42E096D0UL)))
#define bM4_CAN_ACFEN_AE_6 (*((volatile unsigned int *)(0x42E096D4UL)))
#define bM4_CAN_ACFEN_AE_7 (*((volatile unsigned int *)(0x42E096D8UL)))
#define bM4_CAN_ACFEN_AE_8 (*((volatile unsigned int *)(0x42E096DCUL)))
#define bM4_CAN_ACF_ACODEORAMASK0 (*((volatile unsigned int *)(0x42E09700UL)))
#define bM4_CAN_ACF_ACODEORAMASK1 (*((volatile unsigned int *)(0x42E09704UL)))
#define bM4_CAN_ACF_ACODEORAMASK2 (*((volatile unsigned int *)(0x42E09708UL)))
#define bM4_CAN_ACF_ACODEORAMASK3 (*((volatile unsigned int *)(0x42E0970CUL)))
#define bM4_CAN_ACF_ACODEORAMASK4 (*((volatile unsigned int *)(0x42E09710UL)))
#define bM4_CAN_ACF_ACODEORAMASK5 (*((volatile unsigned int *)(0x42E09714UL)))
#define bM4_CAN_ACF_ACODEORAMASK6 (*((volatile unsigned int *)(0x42E09718UL)))
#define bM4_CAN_ACF_ACODEORAMASK7 (*((volatile unsigned int *)(0x42E0971CUL)))
#define bM4_CAN_ACF_ACODEORAMASK8 (*((volatile unsigned int *)(0x42E09720UL)))
#define bM4_CAN_ACF_ACODEORAMASK9 (*((volatile unsigned int *)(0x42E09724UL)))
#define bM4_CAN_ACF_ACODEORAMASK10 (*((volatile unsigned int *)(0x42E09728UL)))
#define bM4_CAN_ACF_ACODEORAMASK11 (*((volatile unsigned int *)(0x42E0972CUL)))
#define bM4_CAN_ACF_ACODEORAMASK12 (*((volatile unsigned int *)(0x42E09730UL)))
#define bM4_CAN_ACF_ACODEORAMASK13 (*((volatile unsigned int *)(0x42E09734UL)))
#define bM4_CAN_ACF_ACODEORAMASK14 (*((volatile unsigned int *)(0x42E09738UL)))
#define bM4_CAN_ACF_ACODEORAMASK15 (*((volatile unsigned int *)(0x42E0973CUL)))
#define bM4_CAN_ACF_ACODEORAMASK16 (*((volatile unsigned int *)(0x42E09740UL)))
#define bM4_CAN_ACF_ACODEORAMASK17 (*((volatile unsigned int *)(0x42E09744UL)))
#define bM4_CAN_ACF_ACODEORAMASK18 (*((volatile unsigned int *)(0x42E09748UL)))
#define bM4_CAN_ACF_ACODEORAMASK19 (*((volatile unsigned int *)(0x42E0974CUL)))
#define bM4_CAN_ACF_ACODEORAMASK20 (*((volatile unsigned int *)(0x42E09750UL)))
#define bM4_CAN_ACF_ACODEORAMASK21 (*((volatile unsigned int *)(0x42E09754UL)))
#define bM4_CAN_ACF_ACODEORAMASK22 (*((volatile unsigned int *)(0x42E09758UL)))
#define bM4_CAN_ACF_ACODEORAMASK23 (*((volatile unsigned int *)(0x42E0975CUL)))
#define bM4_CAN_ACF_ACODEORAMASK24 (*((volatile unsigned int *)(0x42E09760UL)))
#define bM4_CAN_ACF_ACODEORAMASK25 (*((volatile unsigned int *)(0x42E09764UL)))
#define bM4_CAN_ACF_ACODEORAMASK26 (*((volatile unsigned int *)(0x42E09768UL)))
#define bM4_CAN_ACF_ACODEORAMASK27 (*((volatile unsigned int *)(0x42E0976CUL)))
#define bM4_CAN_ACF_ACODEORAMASK28 (*((volatile unsigned int *)(0x42E09770UL)))
#define bM4_CAN_ACF_AIDE (*((volatile unsigned int *)(0x42E09774UL)))
#define bM4_CAN_ACF_AIDEE (*((volatile unsigned int *)(0x42E09778UL)))
#define bM4_CAN_TBSLOT_TBPTR0 (*((volatile unsigned int *)(0x42E097C0UL)))
#define bM4_CAN_TBSLOT_TBPTR1 (*((volatile unsigned int *)(0x42E097C4UL)))
#define bM4_CAN_TBSLOT_TBPTR2 (*((volatile unsigned int *)(0x42E097C8UL)))
#define bM4_CAN_TBSLOT_TBPTR3 (*((volatile unsigned int *)(0x42E097CCUL)))
#define bM4_CAN_TBSLOT_TBPTR4 (*((volatile unsigned int *)(0x42E097D0UL)))
#define bM4_CAN_TBSLOT_TBPTR5 (*((volatile unsigned int *)(0x42E097D4UL)))
#define bM4_CAN_TBSLOT_TBF (*((volatile unsigned int *)(0x42E097D8UL)))
#define bM4_CAN_TBSLOT_TBE (*((volatile unsigned int *)(0x42E097DCUL)))
#define bM4_CAN_TTCFG_TTEN (*((volatile unsigned int *)(0x42E097E0UL)))
#define bM4_CAN_TTCFG_T_PRESC0 (*((volatile unsigned int *)(0x42E097E4UL)))
#define bM4_CAN_TTCFG_T_PRESC1 (*((volatile unsigned int *)(0x42E097E8UL)))
#define bM4_CAN_TTCFG_TTIF (*((volatile unsigned int *)(0x42E097ECUL)))
#define bM4_CAN_TTCFG_TTIE (*((volatile unsigned int *)(0x42E097F0UL)))
#define bM4_CAN_TTCFG_TEIF (*((volatile unsigned int *)(0x42E097F4UL)))
#define bM4_CAN_TTCFG_WTIF (*((volatile unsigned int *)(0x42E097F8UL)))
#define bM4_CAN_TTCFG_WTIE (*((volatile unsigned int *)(0x42E097FCUL)))
#define bM4_CAN_REF_MSG_REF_ID0 (*((volatile unsigned int *)(0x42E09800UL)))
#define bM4_CAN_REF_MSG_REF_ID1 (*((volatile unsigned int *)(0x42E09804UL)))
#define bM4_CAN_REF_MSG_REF_ID2 (*((volatile unsigned int *)(0x42E09808UL)))
#define bM4_CAN_REF_MSG_REF_ID3 (*((volatile unsigned int *)(0x42E0980CUL)))
#define bM4_CAN_REF_MSG_REF_ID4 (*((volatile unsigned int *)(0x42E09810UL)))
#define bM4_CAN_REF_MSG_REF_ID5 (*((volatile unsigned int *)(0x42E09814UL)))
#define bM4_CAN_REF_MSG_REF_ID6 (*((volatile unsigned int *)(0x42E09818UL)))
#define bM4_CAN_REF_MSG_REF_ID7 (*((volatile unsigned int *)(0x42E0981CUL)))
#define bM4_CAN_REF_MSG_REF_ID8 (*((volatile unsigned int *)(0x42E09820UL)))
#define bM4_CAN_REF_MSG_REF_ID9 (*((volatile unsigned int *)(0x42E09824UL)))
#define bM4_CAN_REF_MSG_REF_ID10 (*((volatile unsigned int *)(0x42E09828UL)))
#define bM4_CAN_REF_MSG_REF_ID11 (*((volatile unsigned int *)(0x42E0982CUL)))
#define bM4_CAN_REF_MSG_REF_ID12 (*((volatile unsigned int *)(0x42E09830UL)))
#define bM4_CAN_REF_MSG_REF_ID13 (*((volatile unsigned int *)(0x42E09834UL)))
#define bM4_CAN_REF_MSG_REF_ID14 (*((volatile unsigned int *)(0x42E09838UL)))
#define bM4_CAN_REF_MSG_REF_ID15 (*((volatile unsigned int *)(0x42E0983CUL)))
#define bM4_CAN_REF_MSG_REF_ID16 (*((volatile unsigned int *)(0x42E09840UL)))
#define bM4_CAN_REF_MSG_REF_ID17 (*((volatile unsigned int *)(0x42E09844UL)))
#define bM4_CAN_REF_MSG_REF_ID18 (*((volatile unsigned int *)(0x42E09848UL)))
#define bM4_CAN_REF_MSG_REF_ID19 (*((volatile unsigned int *)(0x42E0984CUL)))
#define bM4_CAN_REF_MSG_REF_ID20 (*((volatile unsigned int *)(0x42E09850UL)))
#define bM4_CAN_REF_MSG_REF_ID21 (*((volatile unsigned int *)(0x42E09854UL)))
#define bM4_CAN_REF_MSG_REF_ID22 (*((volatile unsigned int *)(0x42E09858UL)))
#define bM4_CAN_REF_MSG_REF_ID23 (*((volatile unsigned int *)(0x42E0985CUL)))
#define bM4_CAN_REF_MSG_REF_ID24 (*((volatile unsigned int *)(0x42E09860UL)))
#define bM4_CAN_REF_MSG_REF_ID25 (*((volatile unsigned int *)(0x42E09864UL)))
#define bM4_CAN_REF_MSG_REF_ID26 (*((volatile unsigned int *)(0x42E09868UL)))
#define bM4_CAN_REF_MSG_REF_ID27 (*((volatile unsigned int *)(0x42E0986CUL)))
#define bM4_CAN_REF_MSG_REF_ID28 (*((volatile unsigned int *)(0x42E09870UL)))
#define bM4_CAN_REF_MSG_REF_IDE (*((volatile unsigned int *)(0x42E0987CUL)))
#define bM4_CAN_TRG_CFG_TTPTR0 (*((volatile unsigned int *)(0x42E09880UL)))
#define bM4_CAN_TRG_CFG_TTPTR1 (*((volatile unsigned int *)(0x42E09884UL)))
#define bM4_CAN_TRG_CFG_TTPTR2 (*((volatile unsigned int *)(0x42E09888UL)))
#define bM4_CAN_TRG_CFG_TTPTR3 (*((volatile unsigned int *)(0x42E0988CUL)))
#define bM4_CAN_TRG_CFG_TTPTR4 (*((volatile unsigned int *)(0x42E09890UL)))
#define bM4_CAN_TRG_CFG_TTPTR5 (*((volatile unsigned int *)(0x42E09894UL)))
#define bM4_CAN_TRG_CFG_TTYPE0 (*((volatile unsigned int *)(0x42E098A0UL)))
#define bM4_CAN_TRG_CFG_TTYPE1 (*((volatile unsigned int *)(0x42E098A4UL)))
#define bM4_CAN_TRG_CFG_TTYPE2 (*((volatile unsigned int *)(0x42E098A8UL)))
#define bM4_CAN_TRG_CFG_TEW0 (*((volatile unsigned int *)(0x42E098B0UL)))
#define bM4_CAN_TRG_CFG_TEW1 (*((volatile unsigned int *)(0x42E098B4UL)))
#define bM4_CAN_TRG_CFG_TEW2 (*((volatile unsigned int *)(0x42E098B8UL)))
#define bM4_CAN_TRG_CFG_TEW3 (*((volatile unsigned int *)(0x42E098BCUL)))
#define bM4_CMP1_CTRL_FLTSL0 (*((volatile unsigned int *)(0x42940000UL)))
#define bM4_CMP1_CTRL_FLTSL1 (*((volatile unsigned int *)(0x42940004UL)))
#define bM4_CMP1_CTRL_FLTSL2 (*((volatile unsigned int *)(0x42940008UL)))
#define bM4_CMP1_CTRL_EDGSL0 (*((volatile unsigned int *)(0x42940014UL)))
#define bM4_CMP1_CTRL_EDGSL1 (*((volatile unsigned int *)(0x42940018UL)))
#define bM4_CMP1_CTRL_IEN (*((volatile unsigned int *)(0x4294001CUL)))
#define bM4_CMP1_CTRL_CVSEN (*((volatile unsigned int *)(0x42940020UL)))
#define bM4_CMP1_CTRL_OUTEN (*((volatile unsigned int *)(0x42940030UL)))
#define bM4_CMP1_CTRL_INV (*((volatile unsigned int *)(0x42940034UL)))
#define bM4_CMP1_CTRL_CMPOE (*((volatile unsigned int *)(0x42940038UL)))
#define bM4_CMP1_CTRL_CMPON (*((volatile unsigned int *)(0x4294003CUL)))
#define bM4_CMP1_VLTSEL_RVSL0 (*((volatile unsigned int *)(0x42940040UL)))
#define bM4_CMP1_VLTSEL_RVSL1 (*((volatile unsigned int *)(0x42940044UL)))
#define bM4_CMP1_VLTSEL_RVSL2 (*((volatile unsigned int *)(0x42940048UL)))
#define bM4_CMP1_VLTSEL_RVSL3 (*((volatile unsigned int *)(0x4294004CUL)))
#define bM4_CMP1_VLTSEL_CVSL0 (*((volatile unsigned int *)(0x42940060UL)))
#define bM4_CMP1_VLTSEL_CVSL1 (*((volatile unsigned int *)(0x42940064UL)))
#define bM4_CMP1_VLTSEL_CVSL2 (*((volatile unsigned int *)(0x42940068UL)))
#define bM4_CMP1_VLTSEL_CVSL3 (*((volatile unsigned int *)(0x4294006CUL)))
