MarlinFirmware/Marlin/Marlin/lib/h32_core/main/hdsc32core/common/hc32f46x.h
#define bM4_DMA1_DTCTL0_BLKSIZE1 (*((volatile unsigned int *)(0x42A60904UL)))
#define bM4_DMA1_DTCTL0_BLKSIZE2 (*((volatile unsigned int *)(0x42A60908UL)))
#define bM4_DMA1_DTCTL0_BLKSIZE3 (*((volatile unsigned int *)(0x42A6090CUL)))
#define bM4_DMA1_DTCTL0_BLKSIZE4 (*((volatile unsigned int *)(0x42A60910UL)))
#define bM4_DMA1_DTCTL0_BLKSIZE5 (*((volatile unsigned int *)(0x42A60914UL)))
#define bM4_DMA1_DTCTL0_BLKSIZE6 (*((volatile unsigned int *)(0x42A60918UL)))
#define bM4_DMA1_DTCTL0_BLKSIZE7 (*((volatile unsigned int *)(0x42A6091CUL)))
#define bM4_DMA1_DTCTL0_BLKSIZE8 (*((volatile unsigned int *)(0x42A60920UL)))
#define bM4_DMA1_DTCTL0_BLKSIZE9 (*((volatile unsigned int *)(0x42A60924UL)))
#define bM4_DMA1_DTCTL0_CNT0 (*((volatile unsigned int *)(0x42A60940UL)))
#define bM4_DMA1_DTCTL0_CNT1 (*((volatile unsigned int *)(0x42A60944UL)))
#define bM4_DMA1_DTCTL0_CNT2 (*((volatile unsigned int *)(0x42A60948UL)))
#define bM4_DMA1_DTCTL0_CNT3 (*((volatile unsigned int *)(0x42A6094CUL)))
#define bM4_DMA1_DTCTL0_CNT4 (*((volatile unsigned int *)(0x42A60950UL)))
#define bM4_DMA1_DTCTL0_CNT5 (*((volatile unsigned int *)(0x42A60954UL)))
#define bM4_DMA1_DTCTL0_CNT6 (*((volatile unsigned int *)(0x42A60958UL)))
#define bM4_DMA1_DTCTL0_CNT7 (*((volatile unsigned int *)(0x42A6095CUL)))
#define bM4_DMA1_DTCTL0_CNT8 (*((volatile unsigned int *)(0x42A60960UL)))
#define bM4_DMA1_DTCTL0_CNT9 (*((volatile unsigned int *)(0x42A60964UL)))
#define bM4_DMA1_DTCTL0_CNT10 (*((volatile unsigned int *)(0x42A60968UL)))
#define bM4_DMA1_DTCTL0_CNT11 (*((volatile unsigned int *)(0x42A6096CUL)))
#define bM4_DMA1_DTCTL0_CNT12 (*((volatile unsigned int *)(0x42A60970UL)))
#define bM4_DMA1_DTCTL0_CNT13 (*((volatile unsigned int *)(0x42A60974UL)))
#define bM4_DMA1_DTCTL0_CNT14 (*((volatile unsigned int *)(0x42A60978UL)))
#define bM4_DMA1_DTCTL0_CNT15 (*((volatile unsigned int *)(0x42A6097CUL)))
#define bM4_DMA1_RPT0_SRPT0 (*((volatile unsigned int *)(0x42A60980UL)))
#define bM4_DMA1_RPT0_SRPT1 (*((volatile unsigned int *)(0x42A60984UL)))
#define bM4_DMA1_RPT0_SRPT2 (*((volatile unsigned int *)(0x42A60988UL)))
#define bM4_DMA1_RPT0_SRPT3 (*((volatile unsigned int *)(0x42A6098CUL)))
#define bM4_DMA1_RPT0_SRPT4 (*((volatile unsigned int *)(0x42A60990UL)))
#define bM4_DMA1_RPT0_SRPT5 (*((volatile unsigned int *)(0x42A60994UL)))
#define bM4_DMA1_RPT0_SRPT6 (*((volatile unsigned int *)(0x42A60998UL)))
#define bM4_DMA1_RPT0_SRPT7 (*((volatile unsigned int *)(0x42A6099CUL)))
#define bM4_DMA1_RPT0_SRPT8 (*((volatile unsigned int *)(0x42A609A0UL)))
#define bM4_DMA1_RPT0_SRPT9 (*((volatile unsigned int *)(0x42A609A4UL)))
#define bM4_DMA1_RPT0_DRPT0 (*((volatile unsigned int *)(0x42A609C0UL)))
#define bM4_DMA1_RPT0_DRPT1 (*((volatile unsigned int *)(0x42A609C4UL)))
#define bM4_DMA1_RPT0_DRPT2 (*((volatile unsigned int *)(0x42A609C8UL)))
#define bM4_DMA1_RPT0_DRPT3 (*((volatile unsigned int *)(0x42A609CCUL)))
#define bM4_DMA1_RPT0_DRPT4 (*((volatile unsigned int *)(0x42A609D0UL)))
#define bM4_DMA1_RPT0_DRPT5 (*((volatile unsigned int *)(0x42A609D4UL)))
#define bM4_DMA1_RPT0_DRPT6 (*((volatile unsigned int *)(0x42A609D8UL)))
#define bM4_DMA1_RPT0_DRPT7 (*((volatile unsigned int *)(0x42A609DCUL)))
#define bM4_DMA1_RPT0_DRPT8 (*((volatile unsigned int *)(0x42A609E0UL)))
#define bM4_DMA1_RPT0_DRPT9 (*((volatile unsigned int *)(0x42A609E4UL)))
#define bM4_DMA1_RPTB0_SRPTB0 (*((volatile unsigned int *)(0x42A60980UL)))
#define bM4_DMA1_RPTB0_SRPTB1 (*((volatile unsigned int *)(0x42A60984UL)))
#define bM4_DMA1_RPTB0_SRPTB2 (*((volatile unsigned int *)(0x42A60988UL)))
#define bM4_DMA1_RPTB0_SRPTB3 (*((volatile unsigned int *)(0x42A6098CUL)))
#define bM4_DMA1_RPTB0_SRPTB4 (*((volatile unsigned int *)(0x42A60990UL)))
#define bM4_DMA1_RPTB0_SRPTB5 (*((volatile unsigned int *)(0x42A60994UL)))
#define bM4_DMA1_RPTB0_SRPTB6 (*((volatile unsigned int *)(0x42A60998UL)))
#define bM4_DMA1_RPTB0_SRPTB7 (*((volatile unsigned int *)(0x42A6099CUL)))
#define bM4_DMA1_RPTB0_SRPTB8 (*((volatile unsigned int *)(0x42A609A0UL)))
#define bM4_DMA1_RPTB0_SRPTB9 (*((volatile unsigned int *)(0x42A609A4UL)))
#define bM4_DMA1_RPTB0_DRPTB0 (*((volatile unsigned int *)(0x42A609C0UL)))
#define bM4_DMA1_RPTB0_DRPTB1 (*((volatile unsigned int *)(0x42A609C4UL)))
#define bM4_DMA1_RPTB0_DRPTB2 (*((volatile unsigned int *)(0x42A609C8UL)))
#define bM4_DMA1_RPTB0_DRPTB3 (*((volatile unsigned int *)(0x42A609CCUL)))
#define bM4_DMA1_RPTB0_DRPTB4 (*((volatile unsigned int *)(0x42A609D0UL)))
#define bM4_DMA1_RPTB0_DRPTB5 (*((volatile unsigned int *)(0x42A609D4UL)))
#define bM4_DMA1_RPTB0_DRPTB6 (*((volatile unsigned int *)(0x42A609D8UL)))
#define bM4_DMA1_RPTB0_DRPTB7 (*((volatile unsigned int *)(0x42A609DCUL)))
#define bM4_DMA1_RPTB0_DRPTB8 (*((volatile unsigned int *)(0x42A609E0UL)))
#define bM4_DMA1_RPTB0_DRPTB9 (*((volatile unsigned int *)(0x42A609E4UL)))
#define bM4_DMA1_SNSEQCTL0_SOFFSET0 (*((volatile unsigned int *)(0x42A60A00UL)))
#define bM4_DMA1_SNSEQCTL0_SOFFSET1 (*((volatile unsigned int *)(0x42A60A04UL)))
#define bM4_DMA1_SNSEQCTL0_SOFFSET2 (*((volatile unsigned int *)(0x42A60A08UL)))
#define bM4_DMA1_SNSEQCTL0_SOFFSET3 (*((volatile unsigned int *)(0x42A60A0CUL)))
#define bM4_DMA1_SNSEQCTL0_SOFFSET4 (*((volatile unsigned int *)(0x42A60A10UL)))
#define bM4_DMA1_SNSEQCTL0_SOFFSET5 (*((volatile unsigned int *)(0x42A60A14UL)))
#define bM4_DMA1_SNSEQCTL0_SOFFSET6 (*((volatile unsigned int *)(0x42A60A18UL)))
#define bM4_DMA1_SNSEQCTL0_SOFFSET7 (*((volatile unsigned int *)(0x42A60A1CUL)))
#define bM4_DMA1_SNSEQCTL0_SOFFSET8 (*((volatile unsigned int *)(0x42A60A20UL)))
#define bM4_DMA1_SNSEQCTL0_SOFFSET9 (*((volatile unsigned int *)(0x42A60A24UL)))
#define bM4_DMA1_SNSEQCTL0_SOFFSET10 (*((volatile unsigned int *)(0x42A60A28UL)))
#define bM4_DMA1_SNSEQCTL0_SOFFSET11 (*((volatile unsigned int *)(0x42A60A2CUL)))
#define bM4_DMA1_SNSEQCTL0_SOFFSET12 (*((volatile unsigned int *)(0x42A60A30UL)))
#define bM4_DMA1_SNSEQCTL0_SOFFSET13 (*((volatile unsigned int *)(0x42A60A34UL)))
#define bM4_DMA1_SNSEQCTL0_SOFFSET14 (*((volatile unsigned int *)(0x42A60A38UL)))
#define bM4_DMA1_SNSEQCTL0_SOFFSET15 (*((volatile unsigned int *)(0x42A60A3CUL)))
#define bM4_DMA1_SNSEQCTL0_SOFFSET16 (*((volatile unsigned int *)(0x42A60A40UL)))
#define bM4_DMA1_SNSEQCTL0_SOFFSET17 (*((volatile unsigned int *)(0x42A60A44UL)))
#define bM4_DMA1_SNSEQCTL0_SOFFSET18 (*((volatile unsigned int *)(0x42A60A48UL)))
#define bM4_DMA1_SNSEQCTL0_SOFFSET19 (*((volatile unsigned int *)(0x42A60A4CUL)))
#define bM4_DMA1_SNSEQCTL0_SNSCNT0 (*((volatile unsigned int *)(0x42A60A50UL)))
#define bM4_DMA1_SNSEQCTL0_SNSCNT1 (*((volatile unsigned int *)(0x42A60A54UL)))
#define bM4_DMA1_SNSEQCTL0_SNSCNT2 (*((volatile unsigned int *)(0x42A60A58UL)))
#define bM4_DMA1_SNSEQCTL0_SNSCNT3 (*((volatile unsigned int *)(0x42A60A5CUL)))
#define bM4_DMA1_SNSEQCTL0_SNSCNT4 (*((volatile unsigned int *)(0x42A60A60UL)))
#define bM4_DMA1_SNSEQCTL0_SNSCNT5 (*((volatile unsigned int *)(0x42A60A64UL)))
#define bM4_DMA1_SNSEQCTL0_SNSCNT6 (*((volatile unsigned int *)(0x42A60A68UL)))
#define bM4_DMA1_SNSEQCTL0_SNSCNT7 (*((volatile unsigned int *)(0x42A60A6CUL)))
#define bM4_DMA1_SNSEQCTL0_SNSCNT8 (*((volatile unsigned int *)(0x42A60A70UL)))
#define bM4_DMA1_SNSEQCTL0_SNSCNT9 (*((volatile unsigned int *)(0x42A60A74UL)))
#define bM4_DMA1_SNSEQCTL0_SNSCNT10 (*((volatile unsigned int *)(0x42A60A78UL)))
#define bM4_DMA1_SNSEQCTL0_SNSCNT11 (*((volatile unsigned int *)(0x42A60A7CUL)))
#define bM4_DMA1_SNSEQCTLB0_SNSDIST0 (*((volatile unsigned int *)(0x42A60A00UL)))
#define bM4_DMA1_SNSEQCTLB0_SNSDIST1 (*((volatile unsigned int *)(0x42A60A04UL)))
#define bM4_DMA1_SNSEQCTLB0_SNSDIST2 (*((volatile unsigned int *)(0x42A60A08UL)))
#define bM4_DMA1_SNSEQCTLB0_SNSDIST3 (*((volatile unsigned int *)(0x42A60A0CUL)))
#define bM4_DMA1_SNSEQCTLB0_SNSDIST4 (*((volatile unsigned int *)(0x42A60A10UL)))
#define bM4_DMA1_SNSEQCTLB0_SNSDIST5 (*((volatile unsigned int *)(0x42A60A14UL)))
#define bM4_DMA1_SNSEQCTLB0_SNSDIST6 (*((volatile unsigned int *)(0x42A60A18UL)))
#define bM4_DMA1_SNSEQCTLB0_SNSDIST7 (*((volatile unsigned int *)(0x42A60A1CUL)))
#define bM4_DMA1_SNSEQCTLB0_SNSDIST8 (*((volatile unsigned int *)(0x42A60A20UL)))
#define bM4_DMA1_SNSEQCTLB0_SNSDIST9 (*((volatile unsigned int *)(0x42A60A24UL)))
#define bM4_DMA1_SNSEQCTLB0_SNSDIST10 (*((volatile unsigned int *)(0x42A60A28UL)))
#define bM4_DMA1_SNSEQCTLB0_SNSDIST11 (*((volatile unsigned int *)(0x42A60A2CUL)))
#define bM4_DMA1_SNSEQCTLB0_SNSDIST12 (*((volatile unsigned int *)(0x42A60A30UL)))
#define bM4_DMA1_SNSEQCTLB0_SNSDIST13 (*((volatile unsigned int *)(0x42A60A34UL)))
#define bM4_DMA1_SNSEQCTLB0_SNSDIST14 (*((volatile unsigned int *)(0x42A60A38UL)))
#define bM4_DMA1_SNSEQCTLB0_SNSDIST15 (*((volatile unsigned int *)(0x42A60A3CUL)))
#define bM4_DMA1_SNSEQCTLB0_SNSDIST16 (*((volatile unsigned int *)(0x42A60A40UL)))
#define bM4_DMA1_SNSEQCTLB0_SNSDIST17 (*((volatile unsigned int *)(0x42A60A44UL)))
#define bM4_DMA1_SNSEQCTLB0_SNSDIST18 (*((volatile unsigned int *)(0x42A60A48UL)))
#define bM4_DMA1_SNSEQCTLB0_SNSDIST19 (*((volatile unsigned int *)(0x42A60A4CUL)))
#define bM4_DMA1_SNSEQCTLB0_SNSCNTB0 (*((volatile unsigned int *)(0x42A60A50UL)))
#define bM4_DMA1_SNSEQCTLB0_SNSCNTB1 (*((volatile unsigned int *)(0x42A60A54UL)))
#define bM4_DMA1_SNSEQCTLB0_SNSCNTB2 (*((volatile unsigned int *)(0x42A60A58UL)))
#define bM4_DMA1_SNSEQCTLB0_SNSCNTB3 (*((volatile unsigned int *)(0x42A60A5CUL)))
#define bM4_DMA1_SNSEQCTLB0_SNSCNTB4 (*((volatile unsigned int *)(0x42A60A60UL)))
#define bM4_DMA1_SNSEQCTLB0_SNSCNTB5 (*((volatile unsigned int *)(0x42A60A64UL)))
#define bM4_DMA1_SNSEQCTLB0_SNSCNTB6 (*((volatile unsigned int *)(0x42A60A68UL)))
#define bM4_DMA1_SNSEQCTLB0_SNSCNTB7 (*((volatile unsigned int *)(0x42A60A6CUL)))
#define bM4_DMA1_SNSEQCTLB0_SNSCNTB8 (*((volatile unsigned int *)(0x42A60A70UL)))
#define bM4_DMA1_SNSEQCTLB0_SNSCNTB9 (*((volatile unsigned int *)(0x42A60A74UL)))
#define bM4_DMA1_SNSEQCTLB0_SNSCNTB10 (*((volatile unsigned int *)(0x42A60A78UL)))
#define bM4_DMA1_SNSEQCTLB0_SNSCNTB11 (*((volatile unsigned int *)(0x42A60A7CUL)))
#define bM4_DMA1_DNSEQCTL0_DOFFSET0 (*((volatile unsigned int *)(0x42A60A80UL)))
#define bM4_DMA1_DNSEQCTL0_DOFFSET1 (*((volatile unsigned int *)(0x42A60A84UL)))
#define bM4_DMA1_DNSEQCTL0_DOFFSET2 (*((volatile unsigned int *)(0x42A60A88UL)))
#define bM4_DMA1_DNSEQCTL0_DOFFSET3 (*((volatile unsigned int *)(0x42A60A8CUL)))
#define bM4_DMA1_DNSEQCTL0_DOFFSET4 (*((volatile unsigned int *)(0x42A60A90UL)))
#define bM4_DMA1_DNSEQCTL0_DOFFSET5 (*((volatile unsigned int *)(0x42A60A94UL)))
#define bM4_DMA1_DNSEQCTL0_DOFFSET6 (*((volatile unsigned int *)(0x42A60A98UL)))
#define bM4_DMA1_DNSEQCTL0_DOFFSET7 (*((volatile unsigned int *)(0x42A60A9CUL)))
#define bM4_DMA1_DNSEQCTL0_DOFFSET8 (*((volatile unsigned int *)(0x42A60AA0UL)))
#define bM4_DMA1_DNSEQCTL0_DOFFSET9 (*((volatile unsigned int *)(0x42A60AA4UL)))
#define bM4_DMA1_DNSEQCTL0_DOFFSET10 (*((volatile unsigned int *)(0x42A60AA8UL)))
#define bM4_DMA1_DNSEQCTL0_DOFFSET11 (*((volatile unsigned int *)(0x42A60AACUL)))
#define bM4_DMA1_DNSEQCTL0_DOFFSET12 (*((volatile unsigned int *)(0x42A60AB0UL)))
#define bM4_DMA1_DNSEQCTL0_DOFFSET13 (*((volatile unsigned int *)(0x42A60AB4UL)))
#define bM4_DMA1_DNSEQCTL0_DOFFSET14 (*((volatile unsigned int *)(0x42A60AB8UL)))
#define bM4_DMA1_DNSEQCTL0_DOFFSET15 (*((volatile unsigned int *)(0x42A60ABCUL)))
#define bM4_DMA1_DNSEQCTL0_DOFFSET16 (*((volatile unsigned int *)(0x42A60AC0UL)))
#define bM4_DMA1_DNSEQCTL0_DOFFSET17 (*((volatile unsigned int *)(0x42A60AC4UL)))
#define bM4_DMA1_DNSEQCTL0_DOFFSET18 (*((volatile unsigned int *)(0x42A60AC8UL)))
#define bM4_DMA1_DNSEQCTL0_DOFFSET19 (*((volatile unsigned int *)(0x42A60ACCUL)))
#define bM4_DMA1_DNSEQCTL0_DNSCNT0 (*((volatile unsigned int *)(0x42A60AD0UL)))
#define bM4_DMA1_DNSEQCTL0_DNSCNT1 (*((volatile unsigned int *)(0x42A60AD4UL)))
#define bM4_DMA1_DNSEQCTL0_DNSCNT2 (*((volatile unsigned int *)(0x42A60AD8UL)))
#define bM4_DMA1_DNSEQCTL0_DNSCNT3 (*((volatile unsigned int *)(0x42A60ADCUL)))
#define bM4_DMA1_DNSEQCTL0_DNSCNT4 (*((volatile unsigned int *)(0x42A60AE0UL)))
#define bM4_DMA1_DNSEQCTL0_DNSCNT5 (*((volatile unsigned int *)(0x42A60AE4UL)))
#define bM4_DMA1_DNSEQCTL0_DNSCNT6 (*((volatile unsigned int *)(0x42A60AE8UL)))
#define bM4_DMA1_DNSEQCTL0_DNSCNT7 (*((volatile unsigned int *)(0x42A60AECUL)))
#define bM4_DMA1_DNSEQCTL0_DNSCNT8 (*((volatile unsigned int *)(0x42A60AF0UL)))
#define bM4_DMA1_DNSEQCTL0_DNSCNT9 (*((volatile unsigned int *)(0x42A60AF4UL)))
#define bM4_DMA1_DNSEQCTL0_DNSCNT10 (*((volatile unsigned int *)(0x42A60AF8UL)))
#define bM4_DMA1_DNSEQCTL0_DNSCNT11 (*((volatile unsigned int *)(0x42A60AFCUL)))
#define bM4_DMA1_DNSEQCTLB0_DNSDIST0 (*((volatile unsigned int *)(0x42A60A80UL)))
#define bM4_DMA1_DNSEQCTLB0_DNSDIST1 (*((volatile unsigned int *)(0x42A60A84UL)))
#define bM4_DMA1_DNSEQCTLB0_DNSDIST2 (*((volatile unsigned int *)(0x42A60A88UL)))
#define bM4_DMA1_DNSEQCTLB0_DNSDIST3 (*((volatile unsigned int *)(0x42A60A8CUL)))
#define bM4_DMA1_DNSEQCTLB0_DNSDIST4 (*((volatile unsigned int *)(0x42A60A90UL)))
#define bM4_DMA1_DNSEQCTLB0_DNSDIST5 (*((volatile unsigned int *)(0x42A60A94UL)))
#define bM4_DMA1_DNSEQCTLB0_DNSDIST6 (*((volatile unsigned int *)(0x42A60A98UL)))
#define bM4_DMA1_DNSEQCTLB0_DNSDIST7 (*((volatile unsigned int *)(0x42A60A9CUL)))
#define bM4_DMA1_DNSEQCTLB0_DNSDIST8 (*((volatile unsigned int *)(0x42A60AA0UL)))
#define bM4_DMA1_DNSEQCTLB0_DNSDIST9 (*((volatile unsigned int *)(0x42A60AA4UL)))
#define bM4_DMA1_DNSEQCTLB0_DNSDIST10 (*((volatile unsigned int *)(0x42A60AA8UL)))
#define bM4_DMA1_DNSEQCTLB0_DNSDIST11 (*((volatile unsigned int *)(0x42A60AACUL)))
#define bM4_DMA1_DNSEQCTLB0_DNSDIST12 (*((volatile unsigned int *)(0x42A60AB0UL)))
#define bM4_DMA1_DNSEQCTLB0_DNSDIST13 (*((volatile unsigned int *)(0x42A60AB4UL)))
#define bM4_DMA1_DNSEQCTLB0_DNSDIST14 (*((volatile unsigned int *)(0x42A60AB8UL)))
#define bM4_DMA1_DNSEQCTLB0_DNSDIST15 (*((volatile unsigned int *)(0x42A60ABCUL)))
#define bM4_DMA1_DNSEQCTLB0_DNSDIST16 (*((volatile unsigned int *)(0x42A60AC0UL)))
#define bM4_DMA1_DNSEQCTLB0_DNSDIST17 (*((volatile unsigned int *)(0x42A60AC4UL)))
#define bM4_DMA1_DNSEQCTLB0_DNSDIST18 (*((volatile unsigned int *)(0x42A60AC8UL)))
#define bM4_DMA1_DNSEQCTLB0_DNSDIST19 (*((volatile unsigned int *)(0x42A60ACCUL)))
#define bM4_DMA1_DNSEQCTLB0_DNSCNTB0 (*((volatile unsigned int *)(0x42A60AD0UL)))
#define bM4_DMA1_DNSEQCTLB0_DNSCNTB1 (*((volatile unsigned int *)(0x42A60AD4UL)))
#define bM4_DMA1_DNSEQCTLB0_DNSCNTB2 (*((volatile unsigned int *)(0x42A60AD8UL)))
#define bM4_DMA1_DNSEQCTLB0_DNSCNTB3 (*((volatile unsigned int *)(0x42A60ADCUL)))
#define bM4_DMA1_DNSEQCTLB0_DNSCNTB4 (*((volatile unsigned int *)(0x42A60AE0UL)))
#define bM4_DMA1_DNSEQCTLB0_DNSCNTB5 (*((volatile unsigned int *)(0x42A60AE4UL)))
#define bM4_DMA1_DNSEQCTLB0_DNSCNTB6 (*((volatile unsigned int *)(0x42A60AE8UL)))
#define bM4_DMA1_DNSEQCTLB0_DNSCNTB7 (*((volatile unsigned int *)(0x42A60AECUL)))
#define bM4_DMA1_DNSEQCTLB0_DNSCNTB8 (*((volatile unsigned int *)(0x42A60AF0UL)))
#define bM4_DMA1_DNSEQCTLB0_DNSCNTB9 (*((volatile unsigned int *)(0x42A60AF4UL)))
#define bM4_DMA1_DNSEQCTLB0_DNSCNTB10 (*((volatile unsigned int *)(0x42A60AF8UL)))
#define bM4_DMA1_DNSEQCTLB0_DNSCNTB11 (*((volatile unsigned int *)(0x42A60AFCUL)))
#define bM4_DMA1_LLP0_LLP0 (*((volatile unsigned int *)(0x42A60B08UL)))
#define bM4_DMA1_LLP0_LLP1 (*((volatile unsigned int *)(0x42A60B0CUL)))
#define bM4_DMA1_LLP0_LLP2 (*((volatile unsigned int *)(0x42A60B10UL)))
#define bM4_DMA1_LLP0_LLP3 (*((volatile unsigned int *)(0x42A60B14UL)))
#define bM4_DMA1_LLP0_LLP4 (*((volatile unsigned int *)(0x42A60B18UL)))
#define bM4_DMA1_LLP0_LLP5 (*((volatile unsigned int *)(0x42A60B1CUL)))
#define bM4_DMA1_LLP0_LLP6 (*((volatile unsigned int *)(0x42A60B20UL)))
#define bM4_DMA1_LLP0_LLP7 (*((volatile unsigned int *)(0x42A60B24UL)))
#define bM4_DMA1_LLP0_LLP8 (*((volatile unsigned int *)(0x42A60B28UL)))
#define bM4_DMA1_LLP0_LLP9 (*((volatile unsigned int *)(0x42A60B2CUL)))
#define bM4_DMA1_LLP0_LLP10 (*((volatile unsigned int *)(0x42A60B30UL)))
#define bM4_DMA1_LLP0_LLP11 (*((volatile unsigned int *)(0x42A60B34UL)))
#define bM4_DMA1_LLP0_LLP12 (*((volatile unsigned int *)(0x42A60B38UL)))
#define bM4_DMA1_LLP0_LLP13 (*((volatile unsigned int *)(0x42A60B3CUL)))
#define bM4_DMA1_LLP0_LLP14 (*((volatile unsigned int *)(0x42A60B40UL)))
#define bM4_DMA1_LLP0_LLP15 (*((volatile unsigned int *)(0x42A60B44UL)))
#define bM4_DMA1_LLP0_LLP16 (*((volatile unsigned int *)(0x42A60B48UL)))
#define bM4_DMA1_LLP0_LLP17 (*((volatile unsigned int *)(0x42A60B4CUL)))
#define bM4_DMA1_LLP0_LLP18 (*((volatile unsigned int *)(0x42A60B50UL)))
#define bM4_DMA1_LLP0_LLP19 (*((volatile unsigned int *)(0x42A60B54UL)))
#define bM4_DMA1_LLP0_LLP20 (*((volatile unsigned int *)(0x42A60B58UL)))
#define bM4_DMA1_LLP0_LLP21 (*((volatile unsigned int *)(0x42A60B5CUL)))
#define bM4_DMA1_LLP0_LLP22 (*((volatile unsigned int *)(0x42A60B60UL)))
#define bM4_DMA1_LLP0_LLP23 (*((volatile unsigned int *)(0x42A60B64UL)))
#define bM4_DMA1_LLP0_LLP24 (*((volatile unsigned int *)(0x42A60B68UL)))
#define bM4_DMA1_LLP0_LLP25 (*((volatile unsigned int *)(0x42A60B6CUL)))
#define bM4_DMA1_LLP0_LLP26 (*((volatile unsigned int *)(0x42A60B70UL)))
#define bM4_DMA1_LLP0_LLP27 (*((volatile unsigned int *)(0x42A60B74UL)))
#define bM4_DMA1_LLP0_LLP28 (*((volatile unsigned int *)(0x42A60B78UL)))
#define bM4_DMA1_LLP0_LLP29 (*((volatile unsigned int *)(0x42A60B7CUL)))
#define bM4_DMA1_CH0CTL_SINC0 (*((volatile unsigned int *)(0x42A60B80UL)))
#define bM4_DMA1_CH0CTL_SINC1 (*((volatile unsigned int *)(0x42A60B84UL)))
#define bM4_DMA1_CH0CTL_DINC0 (*((volatile unsigned int *)(0x42A60B88UL)))
#define bM4_DMA1_CH0CTL_DINC1 (*((volatile unsigned int *)(0x42A60B8CUL)))
#define bM4_DMA1_CH0CTL_SRTPEN (*((volatile unsigned int *)(0x42A60B90UL)))
#define bM4_DMA1_CH0CTL_DRPTEN (*((volatile unsigned int *)(0x42A60B94UL)))
#define bM4_DMA1_CH0CTL_SNSEQEN (*((volatile unsigned int *)(0x42A60B98UL)))
#define bM4_DMA1_CH0CTL_DNSEQEN (*((volatile unsigned int *)(0x42A60B9CUL)))
#define bM4_DMA1_CH0CTL_HSIZE0 (*((volatile unsigned int *)(0x42A60BA0UL)))
#define bM4_DMA1_CH0CTL_HSIZE1 (*((volatile unsigned int *)(0x42A60BA4UL)))
#define bM4_DMA1_CH0CTL_LLPEN (*((volatile unsigned int *)(0x42A60BA8UL)))
#define bM4_DMA1_CH0CTL_LLPRUN (*((volatile unsigned int *)(0x42A60BACUL)))
#define bM4_DMA1_CH0CTL_IE (*((volatile unsigned int *)(0x42A60BB0UL)))
#define bM4_DMA1_MONDTCTL0_BLKSIZE0 (*((volatile unsigned int *)(0x42A60D00UL)))
#define bM4_DMA1_MONDTCTL0_BLKSIZE1 (*((volatile unsigned int *)(0x42A60D04UL)))
#define bM4_DMA1_MONDTCTL0_BLKSIZE2 (*((volatile unsigned int *)(0x42A60D08UL)))
#define bM4_DMA1_MONDTCTL0_BLKSIZE3 (*((volatile unsigned int *)(0x42A60D0CUL)))
#define bM4_DMA1_MONDTCTL0_BLKSIZE4 (*((volatile unsigned int *)(0x42A60D10UL)))
#define bM4_DMA1_MONDTCTL0_BLKSIZE5 (*((volatile unsigned int *)(0x42A60D14UL)))
#define bM4_DMA1_MONDTCTL0_BLKSIZE6 (*((volatile unsigned int *)(0x42A60D18UL)))
#define bM4_DMA1_MONDTCTL0_BLKSIZE7 (*((volatile unsigned int *)(0x42A60D1CUL)))
#define bM4_DMA1_MONDTCTL0_BLKSIZE8 (*((volatile unsigned int *)(0x42A60D20UL)))
#define bM4_DMA1_MONDTCTL0_BLKSIZE9 (*((volatile unsigned int *)(0x42A60D24UL)))
#define bM4_DMA1_MONDTCTL0_CNT0 (*((volatile unsigned int *)(0x42A60D40UL)))
#define bM4_DMA1_MONDTCTL0_CNT1 (*((volatile unsigned int *)(0x42A60D44UL)))
#define bM4_DMA1_MONDTCTL0_CNT2 (*((volatile unsigned int *)(0x42A60D48UL)))
#define bM4_DMA1_MONDTCTL0_CNT3 (*((volatile unsigned int *)(0x42A60D4CUL)))
#define bM4_DMA1_MONDTCTL0_CNT4 (*((volatile unsigned int *)(0x42A60D50UL)))
#define bM4_DMA1_MONDTCTL0_CNT5 (*((volatile unsigned int *)(0x42A60D54UL)))
#define bM4_DMA1_MONDTCTL0_CNT6 (*((volatile unsigned int *)(0x42A60D58UL)))
#define bM4_DMA1_MONDTCTL0_CNT7 (*((volatile unsigned int *)(0x42A60D5CUL)))
#define bM4_DMA1_MONDTCTL0_CNT8 (*((volatile unsigned int *)(0x42A60D60UL)))
#define bM4_DMA1_MONDTCTL0_CNT9 (*((volatile unsigned int *)(0x42A60D64UL)))
#define bM4_DMA1_MONDTCTL0_CNT10 (*((volatile unsigned int *)(0x42A60D68UL)))
#define bM4_DMA1_MONDTCTL0_CNT11 (*((volatile unsigned int *)(0x42A60D6CUL)))
#define bM4_DMA1_MONDTCTL0_CNT12 (*((volatile unsigned int *)(0x42A60D70UL)))
#define bM4_DMA1_MONDTCTL0_CNT13 (*((volatile unsigned int *)(0x42A60D74UL)))
#define bM4_DMA1_MONDTCTL0_CNT14 (*((volatile unsigned int *)(0x42A60D78UL)))
#define bM4_DMA1_MONDTCTL0_CNT15 (*((volatile unsigned int *)(0x42A60D7CUL)))
#define bM4_DMA1_MONRPT0_SRPT0 (*((volatile unsigned int *)(0x42A60D80UL)))
#define bM4_DMA1_MONRPT0_SRPT1 (*((volatile unsigned int *)(0x42A60D84UL)))
#define bM4_DMA1_MONRPT0_SRPT2 (*((volatile unsigned int *)(0x42A60D88UL)))
#define bM4_DMA1_MONRPT0_SRPT3 (*((volatile unsigned int *)(0x42A60D8CUL)))
#define bM4_DMA1_MONRPT0_SRPT4 (*((volatile unsigned int *)(0x42A60D90UL)))
#define bM4_DMA1_MONRPT0_SRPT5 (*((volatile unsigned int *)(0x42A60D94UL)))
#define bM4_DMA1_MONRPT0_SRPT6 (*((volatile unsigned int *)(0x42A60D98UL)))
#define bM4_DMA1_MONRPT0_SRPT7 (*((volatile unsigned int *)(0x42A60D9CUL)))
#define bM4_DMA1_MONRPT0_SRPT8 (*((volatile unsigned int *)(0x42A60DA0UL)))
#define bM4_DMA1_MONRPT0_SRPT9 (*((volatile unsigned int *)(0x42A60DA4UL)))
#define bM4_DMA1_MONRPT0_DRPT0 (*((volatile unsigned int *)(0x42A60DC0UL)))
#define bM4_DMA1_MONRPT0_DRPT1 (*((volatile unsigned int *)(0x42A60DC4UL)))
#define bM4_DMA1_MONRPT0_DRPT2 (*((volatile unsigned int *)(0x42A60DC8UL)))
#define bM4_DMA1_MONRPT0_DRPT3 (*((volatile unsigned int *)(0x42A60DCCUL)))
#define bM4_DMA1_MONRPT0_DRPT4 (*((volatile unsigned int *)(0x42A60DD0UL)))
#define bM4_DMA1_MONRPT0_DRPT5 (*((volatile unsigned int *)(0x42A60DD4UL)))
#define bM4_DMA1_MONRPT0_DRPT6 (*((volatile unsigned int *)(0x42A60DD8UL)))
#define bM4_DMA1_MONRPT0_DRPT7 (*((volatile unsigned int *)(0x42A60DDCUL)))
#define bM4_DMA1_MONRPT0_DRPT8 (*((volatile unsigned int *)(0x42A60DE0UL)))
#define bM4_DMA1_MONRPT0_DRPT9 (*((volatile unsigned int *)(0x42A60DE4UL)))
#define bM4_DMA1_MONSNSEQCTL0_SOFFSET0 (*((volatile unsigned int *)(0x42A60E00UL)))
#define bM4_DMA1_MONSNSEQCTL0_SOFFSET1 (*((volatile unsigned int *)(0x42A60E04UL)))
#define bM4_DMA1_MONSNSEQCTL0_SOFFSET2 (*((volatile unsigned int *)(0x42A60E08UL)))
#define bM4_DMA1_MONSNSEQCTL0_SOFFSET3 (*((volatile unsigned int *)(0x42A60E0CUL)))
#define bM4_DMA1_MONSNSEQCTL0_SOFFSET4 (*((volatile unsigned int *)(0x42A60E10UL)))
#define bM4_DMA1_MONSNSEQCTL0_SOFFSET5 (*((volatile unsigned int *)(0x42A60E14UL)))
#define bM4_DMA1_MONSNSEQCTL0_SOFFSET6 (*((volatile unsigned int *)(0x42A60E18UL)))
#define bM4_DMA1_MONSNSEQCTL0_SOFFSET7 (*((volatile unsigned int *)(0x42A60E1CUL)))
#define bM4_DMA1_MONSNSEQCTL0_SOFFSET8 (*((volatile unsigned int *)(0x42A60E20UL)))
#define bM4_DMA1_MONSNSEQCTL0_SOFFSET9 (*((volatile unsigned int *)(0x42A60E24UL)))
#define bM4_DMA1_MONSNSEQCTL0_SOFFSET10 (*((volatile unsigned int *)(0x42A60E28UL)))
#define bM4_DMA1_MONSNSEQCTL0_SOFFSET11 (*((volatile unsigned int *)(0x42A60E2CUL)))
#define bM4_DMA1_MONSNSEQCTL0_SOFFSET12 (*((volatile unsigned int *)(0x42A60E30UL)))
#define bM4_DMA1_MONSNSEQCTL0_SOFFSET13 (*((volatile unsigned int *)(0x42A60E34UL)))
#define bM4_DMA1_MONSNSEQCTL0_SOFFSET14 (*((volatile unsigned int *)(0x42A60E38UL)))
#define bM4_DMA1_MONSNSEQCTL0_SOFFSET15 (*((volatile unsigned int *)(0x42A60E3CUL)))
#define bM4_DMA1_MONSNSEQCTL0_SOFFSET16 (*((volatile unsigned int *)(0x42A60E40UL)))
#define bM4_DMA1_MONSNSEQCTL0_SOFFSET17 (*((volatile unsigned int *)(0x42A60E44UL)))
#define bM4_DMA1_MONSNSEQCTL0_SOFFSET18 (*((volatile unsigned int *)(0x42A60E48UL)))
#define bM4_DMA1_MONSNSEQCTL0_SOFFSET19 (*((volatile unsigned int *)(0x42A60E4CUL)))
#define bM4_DMA1_MONSNSEQCTL0_SNSCNT0 (*((volatile unsigned int *)(0x42A60E50UL)))
#define bM4_DMA1_MONSNSEQCTL0_SNSCNT1 (*((volatile unsigned int *)(0x42A60E54UL)))
#define bM4_DMA1_MONSNSEQCTL0_SNSCNT2 (*((volatile unsigned int *)(0x42A60E58UL)))
