MarlinFirmware/Marlin/Marlin/lib/h32_core/main/hdsc32core/common/hc32f46x.h
#define bM4_DMA1_MONSNSEQCTL0_SNSCNT3 (*((volatile unsigned int *)(0x42A60E5CUL)))
#define bM4_DMA1_MONSNSEQCTL0_SNSCNT4 (*((volatile unsigned int *)(0x42A60E60UL)))
#define bM4_DMA1_MONSNSEQCTL0_SNSCNT5 (*((volatile unsigned int *)(0x42A60E64UL)))
#define bM4_DMA1_MONSNSEQCTL0_SNSCNT6 (*((volatile unsigned int *)(0x42A60E68UL)))
#define bM4_DMA1_MONSNSEQCTL0_SNSCNT7 (*((volatile unsigned int *)(0x42A60E6CUL)))
#define bM4_DMA1_MONSNSEQCTL0_SNSCNT8 (*((volatile unsigned int *)(0x42A60E70UL)))
#define bM4_DMA1_MONSNSEQCTL0_SNSCNT9 (*((volatile unsigned int *)(0x42A60E74UL)))
#define bM4_DMA1_MONSNSEQCTL0_SNSCNT10 (*((volatile unsigned int *)(0x42A60E78UL)))
#define bM4_DMA1_MONSNSEQCTL0_SNSCNT11 (*((volatile unsigned int *)(0x42A60E7CUL)))
#define bM4_DMA1_MONDNSEQCTL0_DOFFSET0 (*((volatile unsigned int *)(0x42A60E80UL)))
#define bM4_DMA1_MONDNSEQCTL0_DOFFSET1 (*((volatile unsigned int *)(0x42A60E84UL)))
#define bM4_DMA1_MONDNSEQCTL0_DOFFSET2 (*((volatile unsigned int *)(0x42A60E88UL)))
#define bM4_DMA1_MONDNSEQCTL0_DOFFSET3 (*((volatile unsigned int *)(0x42A60E8CUL)))
#define bM4_DMA1_MONDNSEQCTL0_DOFFSET4 (*((volatile unsigned int *)(0x42A60E90UL)))
#define bM4_DMA1_MONDNSEQCTL0_DOFFSET5 (*((volatile unsigned int *)(0x42A60E94UL)))
#define bM4_DMA1_MONDNSEQCTL0_DOFFSET6 (*((volatile unsigned int *)(0x42A60E98UL)))
#define bM4_DMA1_MONDNSEQCTL0_DOFFSET7 (*((volatile unsigned int *)(0x42A60E9CUL)))
#define bM4_DMA1_MONDNSEQCTL0_DOFFSET8 (*((volatile unsigned int *)(0x42A60EA0UL)))
#define bM4_DMA1_MONDNSEQCTL0_DOFFSET9 (*((volatile unsigned int *)(0x42A60EA4UL)))
#define bM4_DMA1_MONDNSEQCTL0_DOFFSET10 (*((volatile unsigned int *)(0x42A60EA8UL)))
#define bM4_DMA1_MONDNSEQCTL0_DOFFSET11 (*((volatile unsigned int *)(0x42A60EACUL)))
#define bM4_DMA1_MONDNSEQCTL0_DOFFSET12 (*((volatile unsigned int *)(0x42A60EB0UL)))
#define bM4_DMA1_MONDNSEQCTL0_DOFFSET13 (*((volatile unsigned int *)(0x42A60EB4UL)))
#define bM4_DMA1_MONDNSEQCTL0_DOFFSET14 (*((volatile unsigned int *)(0x42A60EB8UL)))
#define bM4_DMA1_MONDNSEQCTL0_DOFFSET15 (*((volatile unsigned int *)(0x42A60EBCUL)))
#define bM4_DMA1_MONDNSEQCTL0_DOFFSET16 (*((volatile unsigned int *)(0x42A60EC0UL)))
#define bM4_DMA1_MONDNSEQCTL0_DOFFSET17 (*((volatile unsigned int *)(0x42A60EC4UL)))
#define bM4_DMA1_MONDNSEQCTL0_DOFFSET18 (*((volatile unsigned int *)(0x42A60EC8UL)))
#define bM4_DMA1_MONDNSEQCTL0_DOFFSET19 (*((volatile unsigned int *)(0x42A60ECCUL)))
#define bM4_DMA1_MONDNSEQCTL0_DNSCNT0 (*((volatile unsigned int *)(0x42A60ED0UL)))
#define bM4_DMA1_MONDNSEQCTL0_DNSCNT1 (*((volatile unsigned int *)(0x42A60ED4UL)))
#define bM4_DMA1_MONDNSEQCTL0_DNSCNT2 (*((volatile unsigned int *)(0x42A60ED8UL)))
#define bM4_DMA1_MONDNSEQCTL0_DNSCNT3 (*((volatile unsigned int *)(0x42A60EDCUL)))
#define bM4_DMA1_MONDNSEQCTL0_DNSCNT4 (*((volatile unsigned int *)(0x42A60EE0UL)))
#define bM4_DMA1_MONDNSEQCTL0_DNSCNT5 (*((volatile unsigned int *)(0x42A60EE4UL)))
#define bM4_DMA1_MONDNSEQCTL0_DNSCNT6 (*((volatile unsigned int *)(0x42A60EE8UL)))
#define bM4_DMA1_MONDNSEQCTL0_DNSCNT7 (*((volatile unsigned int *)(0x42A60EECUL)))
#define bM4_DMA1_MONDNSEQCTL0_DNSCNT8 (*((volatile unsigned int *)(0x42A60EF0UL)))
#define bM4_DMA1_MONDNSEQCTL0_DNSCNT9 (*((volatile unsigned int *)(0x42A60EF4UL)))
#define bM4_DMA1_MONDNSEQCTL0_DNSCNT10 (*((volatile unsigned int *)(0x42A60EF8UL)))
#define bM4_DMA1_MONDNSEQCTL0_DNSCNT11 (*((volatile unsigned int *)(0x42A60EFCUL)))
#define bM4_DMA1_DTCTL1_BLKSIZE0 (*((volatile unsigned int *)(0x42A61100UL)))
#define bM4_DMA1_DTCTL1_BLKSIZE1 (*((volatile unsigned int *)(0x42A61104UL)))
#define bM4_DMA1_DTCTL1_BLKSIZE2 (*((volatile unsigned int *)(0x42A61108UL)))
#define bM4_DMA1_DTCTL1_BLKSIZE3 (*((volatile unsigned int *)(0x42A6110CUL)))
#define bM4_DMA1_DTCTL1_BLKSIZE4 (*((volatile unsigned int *)(0x42A61110UL)))
#define bM4_DMA1_DTCTL1_BLKSIZE5 (*((volatile unsigned int *)(0x42A61114UL)))
#define bM4_DMA1_DTCTL1_BLKSIZE6 (*((volatile unsigned int *)(0x42A61118UL)))
#define bM4_DMA1_DTCTL1_BLKSIZE7 (*((volatile unsigned int *)(0x42A6111CUL)))
#define bM4_DMA1_DTCTL1_BLKSIZE8 (*((volatile unsigned int *)(0x42A61120UL)))
#define bM4_DMA1_DTCTL1_BLKSIZE9 (*((volatile unsigned int *)(0x42A61124UL)))
#define bM4_DMA1_DTCTL1_CNT0 (*((volatile unsigned int *)(0x42A61140UL)))
#define bM4_DMA1_DTCTL1_CNT1 (*((volatile unsigned int *)(0x42A61144UL)))
#define bM4_DMA1_DTCTL1_CNT2 (*((volatile unsigned int *)(0x42A61148UL)))
#define bM4_DMA1_DTCTL1_CNT3 (*((volatile unsigned int *)(0x42A6114CUL)))
#define bM4_DMA1_DTCTL1_CNT4 (*((volatile unsigned int *)(0x42A61150UL)))
#define bM4_DMA1_DTCTL1_CNT5 (*((volatile unsigned int *)(0x42A61154UL)))
#define bM4_DMA1_DTCTL1_CNT6 (*((volatile unsigned int *)(0x42A61158UL)))
#define bM4_DMA1_DTCTL1_CNT7 (*((volatile unsigned int *)(0x42A6115CUL)))
#define bM4_DMA1_DTCTL1_CNT8 (*((volatile unsigned int *)(0x42A61160UL)))
#define bM4_DMA1_DTCTL1_CNT9 (*((volatile unsigned int *)(0x42A61164UL)))
#define bM4_DMA1_DTCTL1_CNT10 (*((volatile unsigned int *)(0x42A61168UL)))
#define bM4_DMA1_DTCTL1_CNT11 (*((volatile unsigned int *)(0x42A6116CUL)))
#define bM4_DMA1_DTCTL1_CNT12 (*((volatile unsigned int *)(0x42A61170UL)))
#define bM4_DMA1_DTCTL1_CNT13 (*((volatile unsigned int *)(0x42A61174UL)))
#define bM4_DMA1_DTCTL1_CNT14 (*((volatile unsigned int *)(0x42A61178UL)))
#define bM4_DMA1_DTCTL1_CNT15 (*((volatile unsigned int *)(0x42A6117CUL)))
#define bM4_DMA1_RPT1_SRPT0 (*((volatile unsigned int *)(0x42A61180UL)))
#define bM4_DMA1_RPT1_SRPT1 (*((volatile unsigned int *)(0x42A61184UL)))
#define bM4_DMA1_RPT1_SRPT2 (*((volatile unsigned int *)(0x42A61188UL)))
#define bM4_DMA1_RPT1_SRPT3 (*((volatile unsigned int *)(0x42A6118CUL)))
#define bM4_DMA1_RPT1_SRPT4 (*((volatile unsigned int *)(0x42A61190UL)))
#define bM4_DMA1_RPT1_SRPT5 (*((volatile unsigned int *)(0x42A61194UL)))
#define bM4_DMA1_RPT1_SRPT6 (*((volatile unsigned int *)(0x42A61198UL)))
#define bM4_DMA1_RPT1_SRPT7 (*((volatile unsigned int *)(0x42A6119CUL)))
#define bM4_DMA1_RPT1_SRPT8 (*((volatile unsigned int *)(0x42A611A0UL)))
#define bM4_DMA1_RPT1_SRPT9 (*((volatile unsigned int *)(0x42A611A4UL)))
#define bM4_DMA1_RPT1_DRPT0 (*((volatile unsigned int *)(0x42A611C0UL)))
#define bM4_DMA1_RPT1_DRPT1 (*((volatile unsigned int *)(0x42A611C4UL)))
#define bM4_DMA1_RPT1_DRPT2 (*((volatile unsigned int *)(0x42A611C8UL)))
#define bM4_DMA1_RPT1_DRPT3 (*((volatile unsigned int *)(0x42A611CCUL)))
#define bM4_DMA1_RPT1_DRPT4 (*((volatile unsigned int *)(0x42A611D0UL)))
#define bM4_DMA1_RPT1_DRPT5 (*((volatile unsigned int *)(0x42A611D4UL)))
#define bM4_DMA1_RPT1_DRPT6 (*((volatile unsigned int *)(0x42A611D8UL)))
#define bM4_DMA1_RPT1_DRPT7 (*((volatile unsigned int *)(0x42A611DCUL)))
#define bM4_DMA1_RPT1_DRPT8 (*((volatile unsigned int *)(0x42A611E0UL)))
#define bM4_DMA1_RPT1_DRPT9 (*((volatile unsigned int *)(0x42A611E4UL)))
#define bM4_DMA1_RPTB1_SRPTB0 (*((volatile unsigned int *)(0x42A61180UL)))
#define bM4_DMA1_RPTB1_SRPTB1 (*((volatile unsigned int *)(0x42A61184UL)))
#define bM4_DMA1_RPTB1_SRPTB2 (*((volatile unsigned int *)(0x42A61188UL)))
#define bM4_DMA1_RPTB1_SRPTB3 (*((volatile unsigned int *)(0x42A6118CUL)))
#define bM4_DMA1_RPTB1_SRPTB4 (*((volatile unsigned int *)(0x42A61190UL)))
#define bM4_DMA1_RPTB1_SRPTB5 (*((volatile unsigned int *)(0x42A61194UL)))
#define bM4_DMA1_RPTB1_SRPTB6 (*((volatile unsigned int *)(0x42A61198UL)))
#define bM4_DMA1_RPTB1_SRPTB7 (*((volatile unsigned int *)(0x42A6119CUL)))
#define bM4_DMA1_RPTB1_SRPTB8 (*((volatile unsigned int *)(0x42A611A0UL)))
#define bM4_DMA1_RPTB1_SRPTB9 (*((volatile unsigned int *)(0x42A611A4UL)))
#define bM4_DMA1_RPTB1_DRPTB0 (*((volatile unsigned int *)(0x42A611C0UL)))
#define bM4_DMA1_RPTB1_DRPTB1 (*((volatile unsigned int *)(0x42A611C4UL)))
#define bM4_DMA1_RPTB1_DRPTB2 (*((volatile unsigned int *)(0x42A611C8UL)))
#define bM4_DMA1_RPTB1_DRPTB3 (*((volatile unsigned int *)(0x42A611CCUL)))
#define bM4_DMA1_RPTB1_DRPTB4 (*((volatile unsigned int *)(0x42A611D0UL)))
#define bM4_DMA1_RPTB1_DRPTB5 (*((volatile unsigned int *)(0x42A611D4UL)))
#define bM4_DMA1_RPTB1_DRPTB6 (*((volatile unsigned int *)(0x42A611D8UL)))
#define bM4_DMA1_RPTB1_DRPTB7 (*((volatile unsigned int *)(0x42A611DCUL)))
#define bM4_DMA1_RPTB1_DRPTB8 (*((volatile unsigned int *)(0x42A611E0UL)))
#define bM4_DMA1_RPTB1_DRPTB9 (*((volatile unsigned int *)(0x42A611E4UL)))
#define bM4_DMA1_SNSEQCTL1_SOFFSET0 (*((volatile unsigned int *)(0x42A61200UL)))
#define bM4_DMA1_SNSEQCTL1_SOFFSET1 (*((volatile unsigned int *)(0x42A61204UL)))
#define bM4_DMA1_SNSEQCTL1_SOFFSET2 (*((volatile unsigned int *)(0x42A61208UL)))
#define bM4_DMA1_SNSEQCTL1_SOFFSET3 (*((volatile unsigned int *)(0x42A6120CUL)))
#define bM4_DMA1_SNSEQCTL1_SOFFSET4 (*((volatile unsigned int *)(0x42A61210UL)))
#define bM4_DMA1_SNSEQCTL1_SOFFSET5 (*((volatile unsigned int *)(0x42A61214UL)))
#define bM4_DMA1_SNSEQCTL1_SOFFSET6 (*((volatile unsigned int *)(0x42A61218UL)))
#define bM4_DMA1_SNSEQCTL1_SOFFSET7 (*((volatile unsigned int *)(0x42A6121CUL)))
#define bM4_DMA1_SNSEQCTL1_SOFFSET8 (*((volatile unsigned int *)(0x42A61220UL)))
#define bM4_DMA1_SNSEQCTL1_SOFFSET9 (*((volatile unsigned int *)(0x42A61224UL)))
#define bM4_DMA1_SNSEQCTL1_SOFFSET10 (*((volatile unsigned int *)(0x42A61228UL)))
#define bM4_DMA1_SNSEQCTL1_SOFFSET11 (*((volatile unsigned int *)(0x42A6122CUL)))
#define bM4_DMA1_SNSEQCTL1_SOFFSET12 (*((volatile unsigned int *)(0x42A61230UL)))
#define bM4_DMA1_SNSEQCTL1_SOFFSET13 (*((volatile unsigned int *)(0x42A61234UL)))
#define bM4_DMA1_SNSEQCTL1_SOFFSET14 (*((volatile unsigned int *)(0x42A61238UL)))
#define bM4_DMA1_SNSEQCTL1_SOFFSET15 (*((volatile unsigned int *)(0x42A6123CUL)))
#define bM4_DMA1_SNSEQCTL1_SOFFSET16 (*((volatile unsigned int *)(0x42A61240UL)))
#define bM4_DMA1_SNSEQCTL1_SOFFSET17 (*((volatile unsigned int *)(0x42A61244UL)))
#define bM4_DMA1_SNSEQCTL1_SOFFSET18 (*((volatile unsigned int *)(0x42A61248UL)))
#define bM4_DMA1_SNSEQCTL1_SOFFSET19 (*((volatile unsigned int *)(0x42A6124CUL)))
#define bM4_DMA1_SNSEQCTL1_SNSCNT0 (*((volatile unsigned int *)(0x42A61250UL)))
#define bM4_DMA1_SNSEQCTL1_SNSCNT1 (*((volatile unsigned int *)(0x42A61254UL)))
#define bM4_DMA1_SNSEQCTL1_SNSCNT2 (*((volatile unsigned int *)(0x42A61258UL)))
#define bM4_DMA1_SNSEQCTL1_SNSCNT3 (*((volatile unsigned int *)(0x42A6125CUL)))
#define bM4_DMA1_SNSEQCTL1_SNSCNT4 (*((volatile unsigned int *)(0x42A61260UL)))
#define bM4_DMA1_SNSEQCTL1_SNSCNT5 (*((volatile unsigned int *)(0x42A61264UL)))
#define bM4_DMA1_SNSEQCTL1_SNSCNT6 (*((volatile unsigned int *)(0x42A61268UL)))
#define bM4_DMA1_SNSEQCTL1_SNSCNT7 (*((volatile unsigned int *)(0x42A6126CUL)))
#define bM4_DMA1_SNSEQCTL1_SNSCNT8 (*((volatile unsigned int *)(0x42A61270UL)))
#define bM4_DMA1_SNSEQCTL1_SNSCNT9 (*((volatile unsigned int *)(0x42A61274UL)))
#define bM4_DMA1_SNSEQCTL1_SNSCNT10 (*((volatile unsigned int *)(0x42A61278UL)))
#define bM4_DMA1_SNSEQCTL1_SNSCNT11 (*((volatile unsigned int *)(0x42A6127CUL)))
#define bM4_DMA1_SNSEQCTLB1_SNSDIST0 (*((volatile unsigned int *)(0x42A61200UL)))
#define bM4_DMA1_SNSEQCTLB1_SNSDIST1 (*((volatile unsigned int *)(0x42A61204UL)))
#define bM4_DMA1_SNSEQCTLB1_SNSDIST2 (*((volatile unsigned int *)(0x42A61208UL)))
#define bM4_DMA1_SNSEQCTLB1_SNSDIST3 (*((volatile unsigned int *)(0x42A6120CUL)))
#define bM4_DMA1_SNSEQCTLB1_SNSDIST4 (*((volatile unsigned int *)(0x42A61210UL)))
#define bM4_DMA1_SNSEQCTLB1_SNSDIST5 (*((volatile unsigned int *)(0x42A61214UL)))
#define bM4_DMA1_SNSEQCTLB1_SNSDIST6 (*((volatile unsigned int *)(0x42A61218UL)))
#define bM4_DMA1_SNSEQCTLB1_SNSDIST7 (*((volatile unsigned int *)(0x42A6121CUL)))
#define bM4_DMA1_SNSEQCTLB1_SNSDIST8 (*((volatile unsigned int *)(0x42A61220UL)))
#define bM4_DMA1_SNSEQCTLB1_SNSDIST9 (*((volatile unsigned int *)(0x42A61224UL)))
#define bM4_DMA1_SNSEQCTLB1_SNSDIST10 (*((volatile unsigned int *)(0x42A61228UL)))
#define bM4_DMA1_SNSEQCTLB1_SNSDIST11 (*((volatile unsigned int *)(0x42A6122CUL)))
#define bM4_DMA1_SNSEQCTLB1_SNSDIST12 (*((volatile unsigned int *)(0x42A61230UL)))
#define bM4_DMA1_SNSEQCTLB1_SNSDIST13 (*((volatile unsigned int *)(0x42A61234UL)))
#define bM4_DMA1_SNSEQCTLB1_SNSDIST14 (*((volatile unsigned int *)(0x42A61238UL)))
#define bM4_DMA1_SNSEQCTLB1_SNSDIST15 (*((volatile unsigned int *)(0x42A6123CUL)))
#define bM4_DMA1_SNSEQCTLB1_SNSDIST16 (*((volatile unsigned int *)(0x42A61240UL)))
#define bM4_DMA1_SNSEQCTLB1_SNSDIST17 (*((volatile unsigned int *)(0x42A61244UL)))
#define bM4_DMA1_SNSEQCTLB1_SNSDIST18 (*((volatile unsigned int *)(0x42A61248UL)))
#define bM4_DMA1_SNSEQCTLB1_SNSDIST19 (*((volatile unsigned int *)(0x42A6124CUL)))
#define bM4_DMA1_SNSEQCTLB1_SNSCNTB0 (*((volatile unsigned int *)(0x42A61250UL)))
#define bM4_DMA1_SNSEQCTLB1_SNSCNTB1 (*((volatile unsigned int *)(0x42A61254UL)))
#define bM4_DMA1_SNSEQCTLB1_SNSCNTB2 (*((volatile unsigned int *)(0x42A61258UL)))
#define bM4_DMA1_SNSEQCTLB1_SNSCNTB3 (*((volatile unsigned int *)(0x42A6125CUL)))
#define bM4_DMA1_SNSEQCTLB1_SNSCNTB4 (*((volatile unsigned int *)(0x42A61260UL)))
#define bM4_DMA1_SNSEQCTLB1_SNSCNTB5 (*((volatile unsigned int *)(0x42A61264UL)))
#define bM4_DMA1_SNSEQCTLB1_SNSCNTB6 (*((volatile unsigned int *)(0x42A61268UL)))
#define bM4_DMA1_SNSEQCTLB1_SNSCNTB7 (*((volatile unsigned int *)(0x42A6126CUL)))
#define bM4_DMA1_SNSEQCTLB1_SNSCNTB8 (*((volatile unsigned int *)(0x42A61270UL)))
#define bM4_DMA1_SNSEQCTLB1_SNSCNTB9 (*((volatile unsigned int *)(0x42A61274UL)))
#define bM4_DMA1_SNSEQCTLB1_SNSCNTB10 (*((volatile unsigned int *)(0x42A61278UL)))
#define bM4_DMA1_SNSEQCTLB1_SNSCNTB11 (*((volatile unsigned int *)(0x42A6127CUL)))
#define bM4_DMA1_DNSEQCTL1_DOFFSET0 (*((volatile unsigned int *)(0x42A61280UL)))
#define bM4_DMA1_DNSEQCTL1_DOFFSET1 (*((volatile unsigned int *)(0x42A61284UL)))
#define bM4_DMA1_DNSEQCTL1_DOFFSET2 (*((volatile unsigned int *)(0x42A61288UL)))
#define bM4_DMA1_DNSEQCTL1_DOFFSET3 (*((volatile unsigned int *)(0x42A6128CUL)))
#define bM4_DMA1_DNSEQCTL1_DOFFSET4 (*((volatile unsigned int *)(0x42A61290UL)))
#define bM4_DMA1_DNSEQCTL1_DOFFSET5 (*((volatile unsigned int *)(0x42A61294UL)))
#define bM4_DMA1_DNSEQCTL1_DOFFSET6 (*((volatile unsigned int *)(0x42A61298UL)))
#define bM4_DMA1_DNSEQCTL1_DOFFSET7 (*((volatile unsigned int *)(0x42A6129CUL)))
#define bM4_DMA1_DNSEQCTL1_DOFFSET8 (*((volatile unsigned int *)(0x42A612A0UL)))
#define bM4_DMA1_DNSEQCTL1_DOFFSET9 (*((volatile unsigned int *)(0x42A612A4UL)))
#define bM4_DMA1_DNSEQCTL1_DOFFSET10 (*((volatile unsigned int *)(0x42A612A8UL)))
#define bM4_DMA1_DNSEQCTL1_DOFFSET11 (*((volatile unsigned int *)(0x42A612ACUL)))
#define bM4_DMA1_DNSEQCTL1_DOFFSET12 (*((volatile unsigned int *)(0x42A612B0UL)))
#define bM4_DMA1_DNSEQCTL1_DOFFSET13 (*((volatile unsigned int *)(0x42A612B4UL)))
#define bM4_DMA1_DNSEQCTL1_DOFFSET14 (*((volatile unsigned int *)(0x42A612B8UL)))
#define bM4_DMA1_DNSEQCTL1_DOFFSET15 (*((volatile unsigned int *)(0x42A612BCUL)))
#define bM4_DMA1_DNSEQCTL1_DOFFSET16 (*((volatile unsigned int *)(0x42A612C0UL)))
#define bM4_DMA1_DNSEQCTL1_DOFFSET17 (*((volatile unsigned int *)(0x42A612C4UL)))
#define bM4_DMA1_DNSEQCTL1_DOFFSET18 (*((volatile unsigned int *)(0x42A612C8UL)))
#define bM4_DMA1_DNSEQCTL1_DOFFSET19 (*((volatile unsigned int *)(0x42A612CCUL)))
#define bM4_DMA1_DNSEQCTL1_DNSCNT0 (*((volatile unsigned int *)(0x42A612D0UL)))
#define bM4_DMA1_DNSEQCTL1_DNSCNT1 (*((volatile unsigned int *)(0x42A612D4UL)))
#define bM4_DMA1_DNSEQCTL1_DNSCNT2 (*((volatile unsigned int *)(0x42A612D8UL)))
#define bM4_DMA1_DNSEQCTL1_DNSCNT3 (*((volatile unsigned int *)(0x42A612DCUL)))
#define bM4_DMA1_DNSEQCTL1_DNSCNT4 (*((volatile unsigned int *)(0x42A612E0UL)))
#define bM4_DMA1_DNSEQCTL1_DNSCNT5 (*((volatile unsigned int *)(0x42A612E4UL)))
#define bM4_DMA1_DNSEQCTL1_DNSCNT6 (*((volatile unsigned int *)(0x42A612E8UL)))
#define bM4_DMA1_DNSEQCTL1_DNSCNT7 (*((volatile unsigned int *)(0x42A612ECUL)))
#define bM4_DMA1_DNSEQCTL1_DNSCNT8 (*((volatile unsigned int *)(0x42A612F0UL)))
#define bM4_DMA1_DNSEQCTL1_DNSCNT9 (*((volatile unsigned int *)(0x42A612F4UL)))
#define bM4_DMA1_DNSEQCTL1_DNSCNT10 (*((volatile unsigned int *)(0x42A612F8UL)))
#define bM4_DMA1_DNSEQCTL1_DNSCNT11 (*((volatile unsigned int *)(0x42A612FCUL)))
#define bM4_DMA1_DNSEQCTLB1_DNSDIST0 (*((volatile unsigned int *)(0x42A61280UL)))
#define bM4_DMA1_DNSEQCTLB1_DNSDIST1 (*((volatile unsigned int *)(0x42A61284UL)))
#define bM4_DMA1_DNSEQCTLB1_DNSDIST2 (*((volatile unsigned int *)(0x42A61288UL)))
#define bM4_DMA1_DNSEQCTLB1_DNSDIST3 (*((volatile unsigned int *)(0x42A6128CUL)))
#define bM4_DMA1_DNSEQCTLB1_DNSDIST4 (*((volatile unsigned int *)(0x42A61290UL)))
#define bM4_DMA1_DNSEQCTLB1_DNSDIST5 (*((volatile unsigned int *)(0x42A61294UL)))
#define bM4_DMA1_DNSEQCTLB1_DNSDIST6 (*((volatile unsigned int *)(0x42A61298UL)))
#define bM4_DMA1_DNSEQCTLB1_DNSDIST7 (*((volatile unsigned int *)(0x42A6129CUL)))
#define bM4_DMA1_DNSEQCTLB1_DNSDIST8 (*((volatile unsigned int *)(0x42A612A0UL)))
#define bM4_DMA1_DNSEQCTLB1_DNSDIST9 (*((volatile unsigned int *)(0x42A612A4UL)))
#define bM4_DMA1_DNSEQCTLB1_DNSDIST10 (*((volatile unsigned int *)(0x42A612A8UL)))
#define bM4_DMA1_DNSEQCTLB1_DNSDIST11 (*((volatile unsigned int *)(0x42A612ACUL)))
#define bM4_DMA1_DNSEQCTLB1_DNSDIST12 (*((volatile unsigned int *)(0x42A612B0UL)))
#define bM4_DMA1_DNSEQCTLB1_DNSDIST13 (*((volatile unsigned int *)(0x42A612B4UL)))
#define bM4_DMA1_DNSEQCTLB1_DNSDIST14 (*((volatile unsigned int *)(0x42A612B8UL)))
#define bM4_DMA1_DNSEQCTLB1_DNSDIST15 (*((volatile unsigned int *)(0x42A612BCUL)))
#define bM4_DMA1_DNSEQCTLB1_DNSDIST16 (*((volatile unsigned int *)(0x42A612C0UL)))
#define bM4_DMA1_DNSEQCTLB1_DNSDIST17 (*((volatile unsigned int *)(0x42A612C4UL)))
#define bM4_DMA1_DNSEQCTLB1_DNSDIST18 (*((volatile unsigned int *)(0x42A612C8UL)))
#define bM4_DMA1_DNSEQCTLB1_DNSDIST19 (*((volatile unsigned int *)(0x42A612CCUL)))
#define bM4_DMA1_DNSEQCTLB1_DNSCNTB0 (*((volatile unsigned int *)(0x42A612D0UL)))
#define bM4_DMA1_DNSEQCTLB1_DNSCNTB1 (*((volatile unsigned int *)(0x42A612D4UL)))
#define bM4_DMA1_DNSEQCTLB1_DNSCNTB2 (*((volatile unsigned int *)(0x42A612D8UL)))
#define bM4_DMA1_DNSEQCTLB1_DNSCNTB3 (*((volatile unsigned int *)(0x42A612DCUL)))
#define bM4_DMA1_DNSEQCTLB1_DNSCNTB4 (*((volatile unsigned int *)(0x42A612E0UL)))
#define bM4_DMA1_DNSEQCTLB1_DNSCNTB5 (*((volatile unsigned int *)(0x42A612E4UL)))
#define bM4_DMA1_DNSEQCTLB1_DNSCNTB6 (*((volatile unsigned int *)(0x42A612E8UL)))
#define bM4_DMA1_DNSEQCTLB1_DNSCNTB7 (*((volatile unsigned int *)(0x42A612ECUL)))
#define bM4_DMA1_DNSEQCTLB1_DNSCNTB8 (*((volatile unsigned int *)(0x42A612F0UL)))
#define bM4_DMA1_DNSEQCTLB1_DNSCNTB9 (*((volatile unsigned int *)(0x42A612F4UL)))
#define bM4_DMA1_DNSEQCTLB1_DNSCNTB10 (*((volatile unsigned int *)(0x42A612F8UL)))
#define bM4_DMA1_DNSEQCTLB1_DNSCNTB11 (*((volatile unsigned int *)(0x42A612FCUL)))
#define bM4_DMA1_LLP1_LLP0 (*((volatile unsigned int *)(0x42A61308UL)))
#define bM4_DMA1_LLP1_LLP1 (*((volatile unsigned int *)(0x42A6130CUL)))
#define bM4_DMA1_LLP1_LLP2 (*((volatile unsigned int *)(0x42A61310UL)))
#define bM4_DMA1_LLP1_LLP3 (*((volatile unsigned int *)(0x42A61314UL)))
#define bM4_DMA1_LLP1_LLP4 (*((volatile unsigned int *)(0x42A61318UL)))
#define bM4_DMA1_LLP1_LLP5 (*((volatile unsigned int *)(0x42A6131CUL)))
#define bM4_DMA1_LLP1_LLP6 (*((volatile unsigned int *)(0x42A61320UL)))
#define bM4_DMA1_LLP1_LLP7 (*((volatile unsigned int *)(0x42A61324UL)))
#define bM4_DMA1_LLP1_LLP8 (*((volatile unsigned int *)(0x42A61328UL)))
#define bM4_DMA1_LLP1_LLP9 (*((volatile unsigned int *)(0x42A6132CUL)))
#define bM4_DMA1_LLP1_LLP10 (*((volatile unsigned int *)(0x42A61330UL)))
#define bM4_DMA1_LLP1_LLP11 (*((volatile unsigned int *)(0x42A61334UL)))
#define bM4_DMA1_LLP1_LLP12 (*((volatile unsigned int *)(0x42A61338UL)))
#define bM4_DMA1_LLP1_LLP13 (*((volatile unsigned int *)(0x42A6133CUL)))
#define bM4_DMA1_LLP1_LLP14 (*((volatile unsigned int *)(0x42A61340UL)))
#define bM4_DMA1_LLP1_LLP15 (*((volatile unsigned int *)(0x42A61344UL)))
#define bM4_DMA1_LLP1_LLP16 (*((volatile unsigned int *)(0x42A61348UL)))
#define bM4_DMA1_LLP1_LLP17 (*((volatile unsigned int *)(0x42A6134CUL)))
#define bM4_DMA1_LLP1_LLP18 (*((volatile unsigned int *)(0x42A61350UL)))
#define bM4_DMA1_LLP1_LLP19 (*((volatile unsigned int *)(0x42A61354UL)))
#define bM4_DMA1_LLP1_LLP20 (*((volatile unsigned int *)(0x42A61358UL)))
#define bM4_DMA1_LLP1_LLP21 (*((volatile unsigned int *)(0x42A6135CUL)))
#define bM4_DMA1_LLP1_LLP22 (*((volatile unsigned int *)(0x42A61360UL)))
#define bM4_DMA1_LLP1_LLP23 (*((volatile unsigned int *)(0x42A61364UL)))
#define bM4_DMA1_LLP1_LLP24 (*((volatile unsigned int *)(0x42A61368UL)))
#define bM4_DMA1_LLP1_LLP25 (*((volatile unsigned int *)(0x42A6136CUL)))
#define bM4_DMA1_LLP1_LLP26 (*((volatile unsigned int *)(0x42A61370UL)))
#define bM4_DMA1_LLP1_LLP27 (*((volatile unsigned int *)(0x42A61374UL)))
#define bM4_DMA1_LLP1_LLP28 (*((volatile unsigned int *)(0x42A61378UL)))
#define bM4_DMA1_LLP1_LLP29 (*((volatile unsigned int *)(0x42A6137CUL)))
#define bM4_DMA1_CH1CTL_SINC0 (*((volatile unsigned int *)(0x42A61380UL)))
#define bM4_DMA1_CH1CTL_SINC1 (*((volatile unsigned int *)(0x42A61384UL)))
#define bM4_DMA1_CH1CTL_DINC0 (*((volatile unsigned int *)(0x42A61388UL)))
#define bM4_DMA1_CH1CTL_DINC1 (*((volatile unsigned int *)(0x42A6138CUL)))
#define bM4_DMA1_CH1CTL_SRTPEN (*((volatile unsigned int *)(0x42A61390UL)))
#define bM4_DMA1_CH1CTL_DRPTEN (*((volatile unsigned int *)(0x42A61394UL)))
#define bM4_DMA1_CH1CTL_SNSEQEN (*((volatile unsigned int *)(0x42A61398UL)))
#define bM4_DMA1_CH1CTL_DNSEQEN (*((volatile unsigned int *)(0x42A6139CUL)))
#define bM4_DMA1_CH1CTL_HSIZE0 (*((volatile unsigned int *)(0x42A613A0UL)))
#define bM4_DMA1_CH1CTL_HSIZE1 (*((volatile unsigned int *)(0x42A613A4UL)))
#define bM4_DMA1_CH1CTL_LLPEN (*((volatile unsigned int *)(0x42A613A8UL)))
#define bM4_DMA1_CH1CTL_LLPRUN (*((volatile unsigned int *)(0x42A613ACUL)))
#define bM4_DMA1_CH1CTL_IE (*((volatile unsigned int *)(0x42A613B0UL)))
#define bM4_DMA1_MONDTCTL1_BLKSIZE0 (*((volatile unsigned int *)(0x42A61500UL)))
#define bM4_DMA1_MONDTCTL1_BLKSIZE1 (*((volatile unsigned int *)(0x42A61504UL)))
#define bM4_DMA1_MONDTCTL1_BLKSIZE2 (*((volatile unsigned int *)(0x42A61508UL)))
#define bM4_DMA1_MONDTCTL1_BLKSIZE3 (*((volatile unsigned int *)(0x42A6150CUL)))
#define bM4_DMA1_MONDTCTL1_BLKSIZE4 (*((volatile unsigned int *)(0x42A61510UL)))
#define bM4_DMA1_MONDTCTL1_BLKSIZE5 (*((volatile unsigned int *)(0x42A61514UL)))
#define bM4_DMA1_MONDTCTL1_BLKSIZE6 (*((volatile unsigned int *)(0x42A61518UL)))
#define bM4_DMA1_MONDTCTL1_BLKSIZE7 (*((volatile unsigned int *)(0x42A6151CUL)))
#define bM4_DMA1_MONDTCTL1_BLKSIZE8 (*((volatile unsigned int *)(0x42A61520UL)))
#define bM4_DMA1_MONDTCTL1_BLKSIZE9 (*((volatile unsigned int *)(0x42A61524UL)))
#define bM4_DMA1_MONDTCTL1_CNT0 (*((volatile unsigned int *)(0x42A61540UL)))
#define bM4_DMA1_MONDTCTL1_CNT1 (*((volatile unsigned int *)(0x42A61544UL)))
#define bM4_DMA1_MONDTCTL1_CNT2 (*((volatile unsigned int *)(0x42A61548UL)))
#define bM4_DMA1_MONDTCTL1_CNT3 (*((volatile unsigned int *)(0x42A6154CUL)))
#define bM4_DMA1_MONDTCTL1_CNT4 (*((volatile unsigned int *)(0x42A61550UL)))
#define bM4_DMA1_MONDTCTL1_CNT5 (*((volatile unsigned int *)(0x42A61554UL)))
#define bM4_DMA1_MONDTCTL1_CNT6 (*((volatile unsigned int *)(0x42A61558UL)))
#define bM4_DMA1_MONDTCTL1_CNT7 (*((volatile unsigned int *)(0x42A6155CUL)))
#define bM4_DMA1_MONDTCTL1_CNT8 (*((volatile unsigned int *)(0x42A61560UL)))
#define bM4_DMA1_MONDTCTL1_CNT9 (*((volatile unsigned int *)(0x42A61564UL)))
#define bM4_DMA1_MONDTCTL1_CNT10 (*((volatile unsigned int *)(0x42A61568UL)))
#define bM4_DMA1_MONDTCTL1_CNT11 (*((volatile unsigned int *)(0x42A6156CUL)))
#define bM4_DMA1_MONDTCTL1_CNT12 (*((volatile unsigned int *)(0x42A61570UL)))
#define bM4_DMA1_MONDTCTL1_CNT13 (*((volatile unsigned int *)(0x42A61574UL)))
#define bM4_DMA1_MONDTCTL1_CNT14 (*((volatile unsigned int *)(0x42A61578UL)))
