MarlinFirmware/Marlin/Marlin/lib/h32_core/main/hdsc32core/common/hc32f46x.h
#define bM4_DMA1_MONDTCTL1_CNT15 (*((volatile unsigned int *)(0x42A6157CUL)))
#define bM4_DMA1_MONRPT1_SRPT0 (*((volatile unsigned int *)(0x42A61580UL)))
#define bM4_DMA1_MONRPT1_SRPT1 (*((volatile unsigned int *)(0x42A61584UL)))
#define bM4_DMA1_MONRPT1_SRPT2 (*((volatile unsigned int *)(0x42A61588UL)))
#define bM4_DMA1_MONRPT1_SRPT3 (*((volatile unsigned int *)(0x42A6158CUL)))
#define bM4_DMA1_MONRPT1_SRPT4 (*((volatile unsigned int *)(0x42A61590UL)))
#define bM4_DMA1_MONRPT1_SRPT5 (*((volatile unsigned int *)(0x42A61594UL)))
#define bM4_DMA1_MONRPT1_SRPT6 (*((volatile unsigned int *)(0x42A61598UL)))
#define bM4_DMA1_MONRPT1_SRPT7 (*((volatile unsigned int *)(0x42A6159CUL)))
#define bM4_DMA1_MONRPT1_SRPT8 (*((volatile unsigned int *)(0x42A615A0UL)))
#define bM4_DMA1_MONRPT1_SRPT9 (*((volatile unsigned int *)(0x42A615A4UL)))
#define bM4_DMA1_MONRPT1_DRPT0 (*((volatile unsigned int *)(0x42A615C0UL)))
#define bM4_DMA1_MONRPT1_DRPT1 (*((volatile unsigned int *)(0x42A615C4UL)))
#define bM4_DMA1_MONRPT1_DRPT2 (*((volatile unsigned int *)(0x42A615C8UL)))
#define bM4_DMA1_MONRPT1_DRPT3 (*((volatile unsigned int *)(0x42A615CCUL)))
#define bM4_DMA1_MONRPT1_DRPT4 (*((volatile unsigned int *)(0x42A615D0UL)))
#define bM4_DMA1_MONRPT1_DRPT5 (*((volatile unsigned int *)(0x42A615D4UL)))
#define bM4_DMA1_MONRPT1_DRPT6 (*((volatile unsigned int *)(0x42A615D8UL)))
#define bM4_DMA1_MONRPT1_DRPT7 (*((volatile unsigned int *)(0x42A615DCUL)))
#define bM4_DMA1_MONRPT1_DRPT8 (*((volatile unsigned int *)(0x42A615E0UL)))
#define bM4_DMA1_MONRPT1_DRPT9 (*((volatile unsigned int *)(0x42A615E4UL)))
#define bM4_DMA1_MONSNSEQCTL1_SOFFSET0 (*((volatile unsigned int *)(0x42A61600UL)))
#define bM4_DMA1_MONSNSEQCTL1_SOFFSET1 (*((volatile unsigned int *)(0x42A61604UL)))
#define bM4_DMA1_MONSNSEQCTL1_SOFFSET2 (*((volatile unsigned int *)(0x42A61608UL)))
#define bM4_DMA1_MONSNSEQCTL1_SOFFSET3 (*((volatile unsigned int *)(0x42A6160CUL)))
#define bM4_DMA1_MONSNSEQCTL1_SOFFSET4 (*((volatile unsigned int *)(0x42A61610UL)))
#define bM4_DMA1_MONSNSEQCTL1_SOFFSET5 (*((volatile unsigned int *)(0x42A61614UL)))
#define bM4_DMA1_MONSNSEQCTL1_SOFFSET6 (*((volatile unsigned int *)(0x42A61618UL)))
#define bM4_DMA1_MONSNSEQCTL1_SOFFSET7 (*((volatile unsigned int *)(0x42A6161CUL)))
#define bM4_DMA1_MONSNSEQCTL1_SOFFSET8 (*((volatile unsigned int *)(0x42A61620UL)))
#define bM4_DMA1_MONSNSEQCTL1_SOFFSET9 (*((volatile unsigned int *)(0x42A61624UL)))
#define bM4_DMA1_MONSNSEQCTL1_SOFFSET10 (*((volatile unsigned int *)(0x42A61628UL)))
#define bM4_DMA1_MONSNSEQCTL1_SOFFSET11 (*((volatile unsigned int *)(0x42A6162CUL)))
#define bM4_DMA1_MONSNSEQCTL1_SOFFSET12 (*((volatile unsigned int *)(0x42A61630UL)))
#define bM4_DMA1_MONSNSEQCTL1_SOFFSET13 (*((volatile unsigned int *)(0x42A61634UL)))
#define bM4_DMA1_MONSNSEQCTL1_SOFFSET14 (*((volatile unsigned int *)(0x42A61638UL)))
#define bM4_DMA1_MONSNSEQCTL1_SOFFSET15 (*((volatile unsigned int *)(0x42A6163CUL)))
#define bM4_DMA1_MONSNSEQCTL1_SOFFSET16 (*((volatile unsigned int *)(0x42A61640UL)))
#define bM4_DMA1_MONSNSEQCTL1_SOFFSET17 (*((volatile unsigned int *)(0x42A61644UL)))
#define bM4_DMA1_MONSNSEQCTL1_SOFFSET18 (*((volatile unsigned int *)(0x42A61648UL)))
#define bM4_DMA1_MONSNSEQCTL1_SOFFSET19 (*((volatile unsigned int *)(0x42A6164CUL)))
#define bM4_DMA1_MONSNSEQCTL1_SNSCNT0 (*((volatile unsigned int *)(0x42A61650UL)))
#define bM4_DMA1_MONSNSEQCTL1_SNSCNT1 (*((volatile unsigned int *)(0x42A61654UL)))
#define bM4_DMA1_MONSNSEQCTL1_SNSCNT2 (*((volatile unsigned int *)(0x42A61658UL)))
#define bM4_DMA1_MONSNSEQCTL1_SNSCNT3 (*((volatile unsigned int *)(0x42A6165CUL)))
#define bM4_DMA1_MONSNSEQCTL1_SNSCNT4 (*((volatile unsigned int *)(0x42A61660UL)))
#define bM4_DMA1_MONSNSEQCTL1_SNSCNT5 (*((volatile unsigned int *)(0x42A61664UL)))
#define bM4_DMA1_MONSNSEQCTL1_SNSCNT6 (*((volatile unsigned int *)(0x42A61668UL)))
#define bM4_DMA1_MONSNSEQCTL1_SNSCNT7 (*((volatile unsigned int *)(0x42A6166CUL)))
#define bM4_DMA1_MONSNSEQCTL1_SNSCNT8 (*((volatile unsigned int *)(0x42A61670UL)))
#define bM4_DMA1_MONSNSEQCTL1_SNSCNT9 (*((volatile unsigned int *)(0x42A61674UL)))
#define bM4_DMA1_MONSNSEQCTL1_SNSCNT10 (*((volatile unsigned int *)(0x42A61678UL)))
#define bM4_DMA1_MONSNSEQCTL1_SNSCNT11 (*((volatile unsigned int *)(0x42A6167CUL)))
#define bM4_DMA1_MONDNSEQCTL1_DOFFSET0 (*((volatile unsigned int *)(0x42A61680UL)))
#define bM4_DMA1_MONDNSEQCTL1_DOFFSET1 (*((volatile unsigned int *)(0x42A61684UL)))
#define bM4_DMA1_MONDNSEQCTL1_DOFFSET2 (*((volatile unsigned int *)(0x42A61688UL)))
#define bM4_DMA1_MONDNSEQCTL1_DOFFSET3 (*((volatile unsigned int *)(0x42A6168CUL)))
#define bM4_DMA1_MONDNSEQCTL1_DOFFSET4 (*((volatile unsigned int *)(0x42A61690UL)))
#define bM4_DMA1_MONDNSEQCTL1_DOFFSET5 (*((volatile unsigned int *)(0x42A61694UL)))
#define bM4_DMA1_MONDNSEQCTL1_DOFFSET6 (*((volatile unsigned int *)(0x42A61698UL)))
#define bM4_DMA1_MONDNSEQCTL1_DOFFSET7 (*((volatile unsigned int *)(0x42A6169CUL)))
#define bM4_DMA1_MONDNSEQCTL1_DOFFSET8 (*((volatile unsigned int *)(0x42A616A0UL)))
#define bM4_DMA1_MONDNSEQCTL1_DOFFSET9 (*((volatile unsigned int *)(0x42A616A4UL)))
#define bM4_DMA1_MONDNSEQCTL1_DOFFSET10 (*((volatile unsigned int *)(0x42A616A8UL)))
#define bM4_DMA1_MONDNSEQCTL1_DOFFSET11 (*((volatile unsigned int *)(0x42A616ACUL)))
#define bM4_DMA1_MONDNSEQCTL1_DOFFSET12 (*((volatile unsigned int *)(0x42A616B0UL)))
#define bM4_DMA1_MONDNSEQCTL1_DOFFSET13 (*((volatile unsigned int *)(0x42A616B4UL)))
#define bM4_DMA1_MONDNSEQCTL1_DOFFSET14 (*((volatile unsigned int *)(0x42A616B8UL)))
#define bM4_DMA1_MONDNSEQCTL1_DOFFSET15 (*((volatile unsigned int *)(0x42A616BCUL)))
#define bM4_DMA1_MONDNSEQCTL1_DOFFSET16 (*((volatile unsigned int *)(0x42A616C0UL)))
#define bM4_DMA1_MONDNSEQCTL1_DOFFSET17 (*((volatile unsigned int *)(0x42A616C4UL)))
#define bM4_DMA1_MONDNSEQCTL1_DOFFSET18 (*((volatile unsigned int *)(0x42A616C8UL)))
#define bM4_DMA1_MONDNSEQCTL1_DOFFSET19 (*((volatile unsigned int *)(0x42A616CCUL)))
#define bM4_DMA1_MONDNSEQCTL1_DNSCNT0 (*((volatile unsigned int *)(0x42A616D0UL)))
#define bM4_DMA1_MONDNSEQCTL1_DNSCNT1 (*((volatile unsigned int *)(0x42A616D4UL)))
#define bM4_DMA1_MONDNSEQCTL1_DNSCNT2 (*((volatile unsigned int *)(0x42A616D8UL)))
#define bM4_DMA1_MONDNSEQCTL1_DNSCNT3 (*((volatile unsigned int *)(0x42A616DCUL)))
#define bM4_DMA1_MONDNSEQCTL1_DNSCNT4 (*((volatile unsigned int *)(0x42A616E0UL)))
#define bM4_DMA1_MONDNSEQCTL1_DNSCNT5 (*((volatile unsigned int *)(0x42A616E4UL)))
#define bM4_DMA1_MONDNSEQCTL1_DNSCNT6 (*((volatile unsigned int *)(0x42A616E8UL)))
#define bM4_DMA1_MONDNSEQCTL1_DNSCNT7 (*((volatile unsigned int *)(0x42A616ECUL)))
#define bM4_DMA1_MONDNSEQCTL1_DNSCNT8 (*((volatile unsigned int *)(0x42A616F0UL)))
#define bM4_DMA1_MONDNSEQCTL1_DNSCNT9 (*((volatile unsigned int *)(0x42A616F4UL)))
#define bM4_DMA1_MONDNSEQCTL1_DNSCNT10 (*((volatile unsigned int *)(0x42A616F8UL)))
#define bM4_DMA1_MONDNSEQCTL1_DNSCNT11 (*((volatile unsigned int *)(0x42A616FCUL)))
#define bM4_DMA1_DTCTL2_BLKSIZE0 (*((volatile unsigned int *)(0x42A61900UL)))
#define bM4_DMA1_DTCTL2_BLKSIZE1 (*((volatile unsigned int *)(0x42A61904UL)))
#define bM4_DMA1_DTCTL2_BLKSIZE2 (*((volatile unsigned int *)(0x42A61908UL)))
#define bM4_DMA1_DTCTL2_BLKSIZE3 (*((volatile unsigned int *)(0x42A6190CUL)))
#define bM4_DMA1_DTCTL2_BLKSIZE4 (*((volatile unsigned int *)(0x42A61910UL)))
#define bM4_DMA1_DTCTL2_BLKSIZE5 (*((volatile unsigned int *)(0x42A61914UL)))
#define bM4_DMA1_DTCTL2_BLKSIZE6 (*((volatile unsigned int *)(0x42A61918UL)))
#define bM4_DMA1_DTCTL2_BLKSIZE7 (*((volatile unsigned int *)(0x42A6191CUL)))
#define bM4_DMA1_DTCTL2_BLKSIZE8 (*((volatile unsigned int *)(0x42A61920UL)))
#define bM4_DMA1_DTCTL2_BLKSIZE9 (*((volatile unsigned int *)(0x42A61924UL)))
#define bM4_DMA1_DTCTL2_CNT0 (*((volatile unsigned int *)(0x42A61940UL)))
#define bM4_DMA1_DTCTL2_CNT1 (*((volatile unsigned int *)(0x42A61944UL)))
#define bM4_DMA1_DTCTL2_CNT2 (*((volatile unsigned int *)(0x42A61948UL)))
#define bM4_DMA1_DTCTL2_CNT3 (*((volatile unsigned int *)(0x42A6194CUL)))
#define bM4_DMA1_DTCTL2_CNT4 (*((volatile unsigned int *)(0x42A61950UL)))
#define bM4_DMA1_DTCTL2_CNT5 (*((volatile unsigned int *)(0x42A61954UL)))
#define bM4_DMA1_DTCTL2_CNT6 (*((volatile unsigned int *)(0x42A61958UL)))
#define bM4_DMA1_DTCTL2_CNT7 (*((volatile unsigned int *)(0x42A6195CUL)))
#define bM4_DMA1_DTCTL2_CNT8 (*((volatile unsigned int *)(0x42A61960UL)))
#define bM4_DMA1_DTCTL2_CNT9 (*((volatile unsigned int *)(0x42A61964UL)))
#define bM4_DMA1_DTCTL2_CNT10 (*((volatile unsigned int *)(0x42A61968UL)))
#define bM4_DMA1_DTCTL2_CNT11 (*((volatile unsigned int *)(0x42A6196CUL)))
#define bM4_DMA1_DTCTL2_CNT12 (*((volatile unsigned int *)(0x42A61970UL)))
#define bM4_DMA1_DTCTL2_CNT13 (*((volatile unsigned int *)(0x42A61974UL)))
#define bM4_DMA1_DTCTL2_CNT14 (*((volatile unsigned int *)(0x42A61978UL)))
#define bM4_DMA1_DTCTL2_CNT15 (*((volatile unsigned int *)(0x42A6197CUL)))
#define bM4_DMA1_RPT2_SRPT0 (*((volatile unsigned int *)(0x42A61980UL)))
#define bM4_DMA1_RPT2_SRPT1 (*((volatile unsigned int *)(0x42A61984UL)))
#define bM4_DMA1_RPT2_SRPT2 (*((volatile unsigned int *)(0x42A61988UL)))
#define bM4_DMA1_RPT2_SRPT3 (*((volatile unsigned int *)(0x42A6198CUL)))
#define bM4_DMA1_RPT2_SRPT4 (*((volatile unsigned int *)(0x42A61990UL)))
#define bM4_DMA1_RPT2_SRPT5 (*((volatile unsigned int *)(0x42A61994UL)))
#define bM4_DMA1_RPT2_SRPT6 (*((volatile unsigned int *)(0x42A61998UL)))
#define bM4_DMA1_RPT2_SRPT7 (*((volatile unsigned int *)(0x42A6199CUL)))
#define bM4_DMA1_RPT2_SRPT8 (*((volatile unsigned int *)(0x42A619A0UL)))
#define bM4_DMA1_RPT2_SRPT9 (*((volatile unsigned int *)(0x42A619A4UL)))
#define bM4_DMA1_RPT2_DRPT0 (*((volatile unsigned int *)(0x42A619C0UL)))
#define bM4_DMA1_RPT2_DRPT1 (*((volatile unsigned int *)(0x42A619C4UL)))
#define bM4_DMA1_RPT2_DRPT2 (*((volatile unsigned int *)(0x42A619C8UL)))
#define bM4_DMA1_RPT2_DRPT3 (*((volatile unsigned int *)(0x42A619CCUL)))
#define bM4_DMA1_RPT2_DRPT4 (*((volatile unsigned int *)(0x42A619D0UL)))
#define bM4_DMA1_RPT2_DRPT5 (*((volatile unsigned int *)(0x42A619D4UL)))
#define bM4_DMA1_RPT2_DRPT6 (*((volatile unsigned int *)(0x42A619D8UL)))
#define bM4_DMA1_RPT2_DRPT7 (*((volatile unsigned int *)(0x42A619DCUL)))
#define bM4_DMA1_RPT2_DRPT8 (*((volatile unsigned int *)(0x42A619E0UL)))
#define bM4_DMA1_RPT2_DRPT9 (*((volatile unsigned int *)(0x42A619E4UL)))
#define bM4_DMA1_RPTB2_SRPTB0 (*((volatile unsigned int *)(0x42A61980UL)))
#define bM4_DMA1_RPTB2_SRPTB1 (*((volatile unsigned int *)(0x42A61984UL)))
#define bM4_DMA1_RPTB2_SRPTB2 (*((volatile unsigned int *)(0x42A61988UL)))
#define bM4_DMA1_RPTB2_SRPTB3 (*((volatile unsigned int *)(0x42A6198CUL)))
#define bM4_DMA1_RPTB2_SRPTB4 (*((volatile unsigned int *)(0x42A61990UL)))
#define bM4_DMA1_RPTB2_SRPTB5 (*((volatile unsigned int *)(0x42A61994UL)))
#define bM4_DMA1_RPTB2_SRPTB6 (*((volatile unsigned int *)(0x42A61998UL)))
#define bM4_DMA1_RPTB2_SRPTB7 (*((volatile unsigned int *)(0x42A6199CUL)))
#define bM4_DMA1_RPTB2_SRPTB8 (*((volatile unsigned int *)(0x42A619A0UL)))
#define bM4_DMA1_RPTB2_SRPTB9 (*((volatile unsigned int *)(0x42A619A4UL)))
#define bM4_DMA1_RPTB2_DRPTB0 (*((volatile unsigned int *)(0x42A619C0UL)))
#define bM4_DMA1_RPTB2_DRPTB1 (*((volatile unsigned int *)(0x42A619C4UL)))
#define bM4_DMA1_RPTB2_DRPTB2 (*((volatile unsigned int *)(0x42A619C8UL)))
#define bM4_DMA1_RPTB2_DRPTB3 (*((volatile unsigned int *)(0x42A619CCUL)))
#define bM4_DMA1_RPTB2_DRPTB4 (*((volatile unsigned int *)(0x42A619D0UL)))
#define bM4_DMA1_RPTB2_DRPTB5 (*((volatile unsigned int *)(0x42A619D4UL)))
#define bM4_DMA1_RPTB2_DRPTB6 (*((volatile unsigned int *)(0x42A619D8UL)))
#define bM4_DMA1_RPTB2_DRPTB7 (*((volatile unsigned int *)(0x42A619DCUL)))
#define bM4_DMA1_RPTB2_DRPTB8 (*((volatile unsigned int *)(0x42A619E0UL)))
#define bM4_DMA1_RPTB2_DRPTB9 (*((volatile unsigned int *)(0x42A619E4UL)))
#define bM4_DMA1_SNSEQCTL2_SOFFSET0 (*((volatile unsigned int *)(0x42A61A00UL)))
#define bM4_DMA1_SNSEQCTL2_SOFFSET1 (*((volatile unsigned int *)(0x42A61A04UL)))
#define bM4_DMA1_SNSEQCTL2_SOFFSET2 (*((volatile unsigned int *)(0x42A61A08UL)))
#define bM4_DMA1_SNSEQCTL2_SOFFSET3 (*((volatile unsigned int *)(0x42A61A0CUL)))
#define bM4_DMA1_SNSEQCTL2_SOFFSET4 (*((volatile unsigned int *)(0x42A61A10UL)))
#define bM4_DMA1_SNSEQCTL2_SOFFSET5 (*((volatile unsigned int *)(0x42A61A14UL)))
#define bM4_DMA1_SNSEQCTL2_SOFFSET6 (*((volatile unsigned int *)(0x42A61A18UL)))
#define bM4_DMA1_SNSEQCTL2_SOFFSET7 (*((volatile unsigned int *)(0x42A61A1CUL)))
#define bM4_DMA1_SNSEQCTL2_SOFFSET8 (*((volatile unsigned int *)(0x42A61A20UL)))
#define bM4_DMA1_SNSEQCTL2_SOFFSET9 (*((volatile unsigned int *)(0x42A61A24UL)))
#define bM4_DMA1_SNSEQCTL2_SOFFSET10 (*((volatile unsigned int *)(0x42A61A28UL)))
#define bM4_DMA1_SNSEQCTL2_SOFFSET11 (*((volatile unsigned int *)(0x42A61A2CUL)))
#define bM4_DMA1_SNSEQCTL2_SOFFSET12 (*((volatile unsigned int *)(0x42A61A30UL)))
#define bM4_DMA1_SNSEQCTL2_SOFFSET13 (*((volatile unsigned int *)(0x42A61A34UL)))
#define bM4_DMA1_SNSEQCTL2_SOFFSET14 (*((volatile unsigned int *)(0x42A61A38UL)))
#define bM4_DMA1_SNSEQCTL2_SOFFSET15 (*((volatile unsigned int *)(0x42A61A3CUL)))
#define bM4_DMA1_SNSEQCTL2_SOFFSET16 (*((volatile unsigned int *)(0x42A61A40UL)))
#define bM4_DMA1_SNSEQCTL2_SOFFSET17 (*((volatile unsigned int *)(0x42A61A44UL)))
#define bM4_DMA1_SNSEQCTL2_SOFFSET18 (*((volatile unsigned int *)(0x42A61A48UL)))
#define bM4_DMA1_SNSEQCTL2_SOFFSET19 (*((volatile unsigned int *)(0x42A61A4CUL)))
#define bM4_DMA1_SNSEQCTL2_SNSCNT0 (*((volatile unsigned int *)(0x42A61A50UL)))
#define bM4_DMA1_SNSEQCTL2_SNSCNT1 (*((volatile unsigned int *)(0x42A61A54UL)))
#define bM4_DMA1_SNSEQCTL2_SNSCNT2 (*((volatile unsigned int *)(0x42A61A58UL)))
#define bM4_DMA1_SNSEQCTL2_SNSCNT3 (*((volatile unsigned int *)(0x42A61A5CUL)))
#define bM4_DMA1_SNSEQCTL2_SNSCNT4 (*((volatile unsigned int *)(0x42A61A60UL)))
#define bM4_DMA1_SNSEQCTL2_SNSCNT5 (*((volatile unsigned int *)(0x42A61A64UL)))
#define bM4_DMA1_SNSEQCTL2_SNSCNT6 (*((volatile unsigned int *)(0x42A61A68UL)))
#define bM4_DMA1_SNSEQCTL2_SNSCNT7 (*((volatile unsigned int *)(0x42A61A6CUL)))
#define bM4_DMA1_SNSEQCTL2_SNSCNT8 (*((volatile unsigned int *)(0x42A61A70UL)))
#define bM4_DMA1_SNSEQCTL2_SNSCNT9 (*((volatile unsigned int *)(0x42A61A74UL)))
#define bM4_DMA1_SNSEQCTL2_SNSCNT10 (*((volatile unsigned int *)(0x42A61A78UL)))
#define bM4_DMA1_SNSEQCTL2_SNSCNT11 (*((volatile unsigned int *)(0x42A61A7CUL)))
#define bM4_DMA1_SNSEQCTLB2_SNSDIST0 (*((volatile unsigned int *)(0x42A61A00UL)))
#define bM4_DMA1_SNSEQCTLB2_SNSDIST1 (*((volatile unsigned int *)(0x42A61A04UL)))
#define bM4_DMA1_SNSEQCTLB2_SNSDIST2 (*((volatile unsigned int *)(0x42A61A08UL)))
#define bM4_DMA1_SNSEQCTLB2_SNSDIST3 (*((volatile unsigned int *)(0x42A61A0CUL)))
#define bM4_DMA1_SNSEQCTLB2_SNSDIST4 (*((volatile unsigned int *)(0x42A61A10UL)))
#define bM4_DMA1_SNSEQCTLB2_SNSDIST5 (*((volatile unsigned int *)(0x42A61A14UL)))
#define bM4_DMA1_SNSEQCTLB2_SNSDIST6 (*((volatile unsigned int *)(0x42A61A18UL)))
#define bM4_DMA1_SNSEQCTLB2_SNSDIST7 (*((volatile unsigned int *)(0x42A61A1CUL)))
#define bM4_DMA1_SNSEQCTLB2_SNSDIST8 (*((volatile unsigned int *)(0x42A61A20UL)))
#define bM4_DMA1_SNSEQCTLB2_SNSDIST9 (*((volatile unsigned int *)(0x42A61A24UL)))
#define bM4_DMA1_SNSEQCTLB2_SNSDIST10 (*((volatile unsigned int *)(0x42A61A28UL)))
#define bM4_DMA1_SNSEQCTLB2_SNSDIST11 (*((volatile unsigned int *)(0x42A61A2CUL)))
#define bM4_DMA1_SNSEQCTLB2_SNSDIST12 (*((volatile unsigned int *)(0x42A61A30UL)))
#define bM4_DMA1_SNSEQCTLB2_SNSDIST13 (*((volatile unsigned int *)(0x42A61A34UL)))
#define bM4_DMA1_SNSEQCTLB2_SNSDIST14 (*((volatile unsigned int *)(0x42A61A38UL)))
#define bM4_DMA1_SNSEQCTLB2_SNSDIST15 (*((volatile unsigned int *)(0x42A61A3CUL)))
#define bM4_DMA1_SNSEQCTLB2_SNSDIST16 (*((volatile unsigned int *)(0x42A61A40UL)))
#define bM4_DMA1_SNSEQCTLB2_SNSDIST17 (*((volatile unsigned int *)(0x42A61A44UL)))
#define bM4_DMA1_SNSEQCTLB2_SNSDIST18 (*((volatile unsigned int *)(0x42A61A48UL)))
#define bM4_DMA1_SNSEQCTLB2_SNSDIST19 (*((volatile unsigned int *)(0x42A61A4CUL)))
#define bM4_DMA1_SNSEQCTLB2_SNSCNTB0 (*((volatile unsigned int *)(0x42A61A50UL)))
#define bM4_DMA1_SNSEQCTLB2_SNSCNTB1 (*((volatile unsigned int *)(0x42A61A54UL)))
#define bM4_DMA1_SNSEQCTLB2_SNSCNTB2 (*((volatile unsigned int *)(0x42A61A58UL)))
#define bM4_DMA1_SNSEQCTLB2_SNSCNTB3 (*((volatile unsigned int *)(0x42A61A5CUL)))
#define bM4_DMA1_SNSEQCTLB2_SNSCNTB4 (*((volatile unsigned int *)(0x42A61A60UL)))
#define bM4_DMA1_SNSEQCTLB2_SNSCNTB5 (*((volatile unsigned int *)(0x42A61A64UL)))
#define bM4_DMA1_SNSEQCTLB2_SNSCNTB6 (*((volatile unsigned int *)(0x42A61A68UL)))
#define bM4_DMA1_SNSEQCTLB2_SNSCNTB7 (*((volatile unsigned int *)(0x42A61A6CUL)))
#define bM4_DMA1_SNSEQCTLB2_SNSCNTB8 (*((volatile unsigned int *)(0x42A61A70UL)))
#define bM4_DMA1_SNSEQCTLB2_SNSCNTB9 (*((volatile unsigned int *)(0x42A61A74UL)))
#define bM4_DMA1_SNSEQCTLB2_SNSCNTB10 (*((volatile unsigned int *)(0x42A61A78UL)))
#define bM4_DMA1_SNSEQCTLB2_SNSCNTB11 (*((volatile unsigned int *)(0x42A61A7CUL)))
#define bM4_DMA1_DNSEQCTL2_DOFFSET0 (*((volatile unsigned int *)(0x42A61A80UL)))
#define bM4_DMA1_DNSEQCTL2_DOFFSET1 (*((volatile unsigned int *)(0x42A61A84UL)))
#define bM4_DMA1_DNSEQCTL2_DOFFSET2 (*((volatile unsigned int *)(0x42A61A88UL)))
#define bM4_DMA1_DNSEQCTL2_DOFFSET3 (*((volatile unsigned int *)(0x42A61A8CUL)))
#define bM4_DMA1_DNSEQCTL2_DOFFSET4 (*((volatile unsigned int *)(0x42A61A90UL)))
#define bM4_DMA1_DNSEQCTL2_DOFFSET5 (*((volatile unsigned int *)(0x42A61A94UL)))
#define bM4_DMA1_DNSEQCTL2_DOFFSET6 (*((volatile unsigned int *)(0x42A61A98UL)))
#define bM4_DMA1_DNSEQCTL2_DOFFSET7 (*((volatile unsigned int *)(0x42A61A9CUL)))
#define bM4_DMA1_DNSEQCTL2_DOFFSET8 (*((volatile unsigned int *)(0x42A61AA0UL)))
#define bM4_DMA1_DNSEQCTL2_DOFFSET9 (*((volatile unsigned int *)(0x42A61AA4UL)))
#define bM4_DMA1_DNSEQCTL2_DOFFSET10 (*((volatile unsigned int *)(0x42A61AA8UL)))
#define bM4_DMA1_DNSEQCTL2_DOFFSET11 (*((volatile unsigned int *)(0x42A61AACUL)))
#define bM4_DMA1_DNSEQCTL2_DOFFSET12 (*((volatile unsigned int *)(0x42A61AB0UL)))
#define bM4_DMA1_DNSEQCTL2_DOFFSET13 (*((volatile unsigned int *)(0x42A61AB4UL)))
#define bM4_DMA1_DNSEQCTL2_DOFFSET14 (*((volatile unsigned int *)(0x42A61AB8UL)))
#define bM4_DMA1_DNSEQCTL2_DOFFSET15 (*((volatile unsigned int *)(0x42A61ABCUL)))
#define bM4_DMA1_DNSEQCTL2_DOFFSET16 (*((volatile unsigned int *)(0x42A61AC0UL)))
#define bM4_DMA1_DNSEQCTL2_DOFFSET17 (*((volatile unsigned int *)(0x42A61AC4UL)))
#define bM4_DMA1_DNSEQCTL2_DOFFSET18 (*((volatile unsigned int *)(0x42A61AC8UL)))
#define bM4_DMA1_DNSEQCTL2_DOFFSET19 (*((volatile unsigned int *)(0x42A61ACCUL)))
#define bM4_DMA1_DNSEQCTL2_DNSCNT0 (*((volatile unsigned int *)(0x42A61AD0UL)))
#define bM4_DMA1_DNSEQCTL2_DNSCNT1 (*((volatile unsigned int *)(0x42A61AD4UL)))
#define bM4_DMA1_DNSEQCTL2_DNSCNT2 (*((volatile unsigned int *)(0x42A61AD8UL)))
#define bM4_DMA1_DNSEQCTL2_DNSCNT3 (*((volatile unsigned int *)(0x42A61ADCUL)))
#define bM4_DMA1_DNSEQCTL2_DNSCNT4 (*((volatile unsigned int *)(0x42A61AE0UL)))
#define bM4_DMA1_DNSEQCTL2_DNSCNT5 (*((volatile unsigned int *)(0x42A61AE4UL)))
#define bM4_DMA1_DNSEQCTL2_DNSCNT6 (*((volatile unsigned int *)(0x42A61AE8UL)))
#define bM4_DMA1_DNSEQCTL2_DNSCNT7 (*((volatile unsigned int *)(0x42A61AECUL)))
#define bM4_DMA1_DNSEQCTL2_DNSCNT8 (*((volatile unsigned int *)(0x42A61AF0UL)))
#define bM4_DMA1_DNSEQCTL2_DNSCNT9 (*((volatile unsigned int *)(0x42A61AF4UL)))
#define bM4_DMA1_DNSEQCTL2_DNSCNT10 (*((volatile unsigned int *)(0x42A61AF8UL)))
#define bM4_DMA1_DNSEQCTL2_DNSCNT11 (*((volatile unsigned int *)(0x42A61AFCUL)))
#define bM4_DMA1_DNSEQCTLB2_DNSDIST0 (*((volatile unsigned int *)(0x42A61A80UL)))
#define bM4_DMA1_DNSEQCTLB2_DNSDIST1 (*((volatile unsigned int *)(0x42A61A84UL)))
#define bM4_DMA1_DNSEQCTLB2_DNSDIST2 (*((volatile unsigned int *)(0x42A61A88UL)))
#define bM4_DMA1_DNSEQCTLB2_DNSDIST3 (*((volatile unsigned int *)(0x42A61A8CUL)))
#define bM4_DMA1_DNSEQCTLB2_DNSDIST4 (*((volatile unsigned int *)(0x42A61A90UL)))
#define bM4_DMA1_DNSEQCTLB2_DNSDIST5 (*((volatile unsigned int *)(0x42A61A94UL)))
#define bM4_DMA1_DNSEQCTLB2_DNSDIST6 (*((volatile unsigned int *)(0x42A61A98UL)))
#define bM4_DMA1_DNSEQCTLB2_DNSDIST7 (*((volatile unsigned int *)(0x42A61A9CUL)))
#define bM4_DMA1_DNSEQCTLB2_DNSDIST8 (*((volatile unsigned int *)(0x42A61AA0UL)))
#define bM4_DMA1_DNSEQCTLB2_DNSDIST9 (*((volatile unsigned int *)(0x42A61AA4UL)))
#define bM4_DMA1_DNSEQCTLB2_DNSDIST10 (*((volatile unsigned int *)(0x42A61AA8UL)))
#define bM4_DMA1_DNSEQCTLB2_DNSDIST11 (*((volatile unsigned int *)(0x42A61AACUL)))
#define bM4_DMA1_DNSEQCTLB2_DNSDIST12 (*((volatile unsigned int *)(0x42A61AB0UL)))
#define bM4_DMA1_DNSEQCTLB2_DNSDIST13 (*((volatile unsigned int *)(0x42A61AB4UL)))
#define bM4_DMA1_DNSEQCTLB2_DNSDIST14 (*((volatile unsigned int *)(0x42A61AB8UL)))
#define bM4_DMA1_DNSEQCTLB2_DNSDIST15 (*((volatile unsigned int *)(0x42A61ABCUL)))
#define bM4_DMA1_DNSEQCTLB2_DNSDIST16 (*((volatile unsigned int *)(0x42A61AC0UL)))
#define bM4_DMA1_DNSEQCTLB2_DNSDIST17 (*((volatile unsigned int *)(0x42A61AC4UL)))
#define bM4_DMA1_DNSEQCTLB2_DNSDIST18 (*((volatile unsigned int *)(0x42A61AC8UL)))
#define bM4_DMA1_DNSEQCTLB2_DNSDIST19 (*((volatile unsigned int *)(0x42A61ACCUL)))
#define bM4_DMA1_DNSEQCTLB2_DNSCNTB0 (*((volatile unsigned int *)(0x42A61AD0UL)))
#define bM4_DMA1_DNSEQCTLB2_DNSCNTB1 (*((volatile unsigned int *)(0x42A61AD4UL)))
#define bM4_DMA1_DNSEQCTLB2_DNSCNTB2 (*((volatile unsigned int *)(0x42A61AD8UL)))
#define bM4_DMA1_DNSEQCTLB2_DNSCNTB3 (*((volatile unsigned int *)(0x42A61ADCUL)))
#define bM4_DMA1_DNSEQCTLB2_DNSCNTB4 (*((volatile unsigned int *)(0x42A61AE0UL)))
#define bM4_DMA1_DNSEQCTLB2_DNSCNTB5 (*((volatile unsigned int *)(0x42A61AE4UL)))
#define bM4_DMA1_DNSEQCTLB2_DNSCNTB6 (*((volatile unsigned int *)(0x42A61AE8UL)))
#define bM4_DMA1_DNSEQCTLB2_DNSCNTB7 (*((volatile unsigned int *)(0x42A61AECUL)))
#define bM4_DMA1_DNSEQCTLB2_DNSCNTB8 (*((volatile unsigned int *)(0x42A61AF0UL)))
#define bM4_DMA1_DNSEQCTLB2_DNSCNTB9 (*((volatile unsigned int *)(0x42A61AF4UL)))
#define bM4_DMA1_DNSEQCTLB2_DNSCNTB10 (*((volatile unsigned int *)(0x42A61AF8UL)))
#define bM4_DMA1_DNSEQCTLB2_DNSCNTB11 (*((volatile unsigned int *)(0x42A61AFCUL)))
#define bM4_DMA1_LLP2_LLP0 (*((volatile unsigned int *)(0x42A61B08UL)))
#define bM4_DMA1_LLP2_LLP1 (*((volatile unsigned int *)(0x42A61B0CUL)))
#define bM4_DMA1_LLP2_LLP2 (*((volatile unsigned int *)(0x42A61B10UL)))
#define bM4_DMA1_LLP2_LLP3 (*((volatile unsigned int *)(0x42A61B14UL)))
#define bM4_DMA1_LLP2_LLP4 (*((volatile unsigned int *)(0x42A61B18UL)))
#define bM4_DMA1_LLP2_LLP5 (*((volatile unsigned int *)(0x42A61B1CUL)))
#define bM4_DMA1_LLP2_LLP6 (*((volatile unsigned int *)(0x42A61B20UL)))
#define bM4_DMA1_LLP2_LLP7 (*((volatile unsigned int *)(0x42A61B24UL)))
#define bM4_DMA1_LLP2_LLP8 (*((volatile unsigned int *)(0x42A61B28UL)))
#define bM4_DMA1_LLP2_LLP9 (*((volatile unsigned int *)(0x42A61B2CUL)))
#define bM4_DMA1_LLP2_LLP10 (*((volatile unsigned int *)(0x42A61B30UL)))
#define bM4_DMA1_LLP2_LLP11 (*((volatile unsigned int *)(0x42A61B34UL)))
#define bM4_DMA1_LLP2_LLP12 (*((volatile unsigned int *)(0x42A61B38UL)))
#define bM4_DMA1_LLP2_LLP13 (*((volatile unsigned int *)(0x42A61B3CUL)))
#define bM4_DMA1_LLP2_LLP14 (*((volatile unsigned int *)(0x42A61B40UL)))
#define bM4_DMA1_LLP2_LLP15 (*((volatile unsigned int *)(0x42A61B44UL)))
#define bM4_DMA1_LLP2_LLP16 (*((volatile unsigned int *)(0x42A61B48UL)))
#define bM4_DMA1_LLP2_LLP17 (*((volatile unsigned int *)(0x42A61B4CUL)))
#define bM4_DMA1_LLP2_LLP18 (*((volatile unsigned int *)(0x42A61B50UL)))
#define bM4_DMA1_LLP2_LLP19 (*((volatile unsigned int *)(0x42A61B54UL)))
#define bM4_DMA1_LLP2_LLP20 (*((volatile unsigned int *)(0x42A61B58UL)))
#define bM4_DMA1_LLP2_LLP21 (*((volatile unsigned int *)(0x42A61B5CUL)))
