MarlinFirmware/Marlin/Marlin/lib/h32_core/main/hdsc32core/common/hc32f46x.h
#define bM4_DMA1_LLP2_LLP22 (*((volatile unsigned int *)(0x42A61B60UL)))
#define bM4_DMA1_LLP2_LLP23 (*((volatile unsigned int *)(0x42A61B64UL)))
#define bM4_DMA1_LLP2_LLP24 (*((volatile unsigned int *)(0x42A61B68UL)))
#define bM4_DMA1_LLP2_LLP25 (*((volatile unsigned int *)(0x42A61B6CUL)))
#define bM4_DMA1_LLP2_LLP26 (*((volatile unsigned int *)(0x42A61B70UL)))
#define bM4_DMA1_LLP2_LLP27 (*((volatile unsigned int *)(0x42A61B74UL)))
#define bM4_DMA1_LLP2_LLP28 (*((volatile unsigned int *)(0x42A61B78UL)))
#define bM4_DMA1_LLP2_LLP29 (*((volatile unsigned int *)(0x42A61B7CUL)))
#define bM4_DMA1_CH2CTL_SINC0 (*((volatile unsigned int *)(0x42A61B80UL)))
#define bM4_DMA1_CH2CTL_SINC1 (*((volatile unsigned int *)(0x42A61B84UL)))
#define bM4_DMA1_CH2CTL_DINC0 (*((volatile unsigned int *)(0x42A61B88UL)))
#define bM4_DMA1_CH2CTL_DINC1 (*((volatile unsigned int *)(0x42A61B8CUL)))
#define bM4_DMA1_CH2CTL_SRTPEN (*((volatile unsigned int *)(0x42A61B90UL)))
#define bM4_DMA1_CH2CTL_DRPTEN (*((volatile unsigned int *)(0x42A61B94UL)))
#define bM4_DMA1_CH2CTL_SNSEQEN (*((volatile unsigned int *)(0x42A61B98UL)))
#define bM4_DMA1_CH2CTL_DNSEQEN (*((volatile unsigned int *)(0x42A61B9CUL)))
#define bM4_DMA1_CH2CTL_HSIZE0 (*((volatile unsigned int *)(0x42A61BA0UL)))
#define bM4_DMA1_CH2CTL_HSIZE1 (*((volatile unsigned int *)(0x42A61BA4UL)))
#define bM4_DMA1_CH2CTL_LLPEN (*((volatile unsigned int *)(0x42A61BA8UL)))
#define bM4_DMA1_CH2CTL_LLPRUN (*((volatile unsigned int *)(0x42A61BACUL)))
#define bM4_DMA1_CH2CTL_IE (*((volatile unsigned int *)(0x42A61BB0UL)))
#define bM4_DMA1_MONDTCTL2_BLKSIZE0 (*((volatile unsigned int *)(0x42A61D00UL)))
#define bM4_DMA1_MONDTCTL2_BLKSIZE1 (*((volatile unsigned int *)(0x42A61D04UL)))
#define bM4_DMA1_MONDTCTL2_BLKSIZE2 (*((volatile unsigned int *)(0x42A61D08UL)))
#define bM4_DMA1_MONDTCTL2_BLKSIZE3 (*((volatile unsigned int *)(0x42A61D0CUL)))
#define bM4_DMA1_MONDTCTL2_BLKSIZE4 (*((volatile unsigned int *)(0x42A61D10UL)))
#define bM4_DMA1_MONDTCTL2_BLKSIZE5 (*((volatile unsigned int *)(0x42A61D14UL)))
#define bM4_DMA1_MONDTCTL2_BLKSIZE6 (*((volatile unsigned int *)(0x42A61D18UL)))
#define bM4_DMA1_MONDTCTL2_BLKSIZE7 (*((volatile unsigned int *)(0x42A61D1CUL)))
#define bM4_DMA1_MONDTCTL2_BLKSIZE8 (*((volatile unsigned int *)(0x42A61D20UL)))
#define bM4_DMA1_MONDTCTL2_BLKSIZE9 (*((volatile unsigned int *)(0x42A61D24UL)))
#define bM4_DMA1_MONDTCTL2_CNT0 (*((volatile unsigned int *)(0x42A61D40UL)))
#define bM4_DMA1_MONDTCTL2_CNT1 (*((volatile unsigned int *)(0x42A61D44UL)))
#define bM4_DMA1_MONDTCTL2_CNT2 (*((volatile unsigned int *)(0x42A61D48UL)))
#define bM4_DMA1_MONDTCTL2_CNT3 (*((volatile unsigned int *)(0x42A61D4CUL)))
#define bM4_DMA1_MONDTCTL2_CNT4 (*((volatile unsigned int *)(0x42A61D50UL)))
#define bM4_DMA1_MONDTCTL2_CNT5 (*((volatile unsigned int *)(0x42A61D54UL)))
#define bM4_DMA1_MONDTCTL2_CNT6 (*((volatile unsigned int *)(0x42A61D58UL)))
#define bM4_DMA1_MONDTCTL2_CNT7 (*((volatile unsigned int *)(0x42A61D5CUL)))
#define bM4_DMA1_MONDTCTL2_CNT8 (*((volatile unsigned int *)(0x42A61D60UL)))
#define bM4_DMA1_MONDTCTL2_CNT9 (*((volatile unsigned int *)(0x42A61D64UL)))
#define bM4_DMA1_MONDTCTL2_CNT10 (*((volatile unsigned int *)(0x42A61D68UL)))
#define bM4_DMA1_MONDTCTL2_CNT11 (*((volatile unsigned int *)(0x42A61D6CUL)))
#define bM4_DMA1_MONDTCTL2_CNT12 (*((volatile unsigned int *)(0x42A61D70UL)))
#define bM4_DMA1_MONDTCTL2_CNT13 (*((volatile unsigned int *)(0x42A61D74UL)))
#define bM4_DMA1_MONDTCTL2_CNT14 (*((volatile unsigned int *)(0x42A61D78UL)))
#define bM4_DMA1_MONDTCTL2_CNT15 (*((volatile unsigned int *)(0x42A61D7CUL)))
#define bM4_DMA1_MONRPT2_SRPT0 (*((volatile unsigned int *)(0x42A61D80UL)))
#define bM4_DMA1_MONRPT2_SRPT1 (*((volatile unsigned int *)(0x42A61D84UL)))
#define bM4_DMA1_MONRPT2_SRPT2 (*((volatile unsigned int *)(0x42A61D88UL)))
#define bM4_DMA1_MONRPT2_SRPT3 (*((volatile unsigned int *)(0x42A61D8CUL)))
#define bM4_DMA1_MONRPT2_SRPT4 (*((volatile unsigned int *)(0x42A61D90UL)))
#define bM4_DMA1_MONRPT2_SRPT5 (*((volatile unsigned int *)(0x42A61D94UL)))
#define bM4_DMA1_MONRPT2_SRPT6 (*((volatile unsigned int *)(0x42A61D98UL)))
#define bM4_DMA1_MONRPT2_SRPT7 (*((volatile unsigned int *)(0x42A61D9CUL)))
#define bM4_DMA1_MONRPT2_SRPT8 (*((volatile unsigned int *)(0x42A61DA0UL)))
#define bM4_DMA1_MONRPT2_SRPT9 (*((volatile unsigned int *)(0x42A61DA4UL)))
#define bM4_DMA1_MONRPT2_DRPT0 (*((volatile unsigned int *)(0x42A61DC0UL)))
#define bM4_DMA1_MONRPT2_DRPT1 (*((volatile unsigned int *)(0x42A61DC4UL)))
#define bM4_DMA1_MONRPT2_DRPT2 (*((volatile unsigned int *)(0x42A61DC8UL)))
#define bM4_DMA1_MONRPT2_DRPT3 (*((volatile unsigned int *)(0x42A61DCCUL)))
#define bM4_DMA1_MONRPT2_DRPT4 (*((volatile unsigned int *)(0x42A61DD0UL)))
#define bM4_DMA1_MONRPT2_DRPT5 (*((volatile unsigned int *)(0x42A61DD4UL)))
#define bM4_DMA1_MONRPT2_DRPT6 (*((volatile unsigned int *)(0x42A61DD8UL)))
#define bM4_DMA1_MONRPT2_DRPT7 (*((volatile unsigned int *)(0x42A61DDCUL)))
#define bM4_DMA1_MONRPT2_DRPT8 (*((volatile unsigned int *)(0x42A61DE0UL)))
#define bM4_DMA1_MONRPT2_DRPT9 (*((volatile unsigned int *)(0x42A61DE4UL)))
#define bM4_DMA1_MONSNSEQCTL2_SOFFSET0 (*((volatile unsigned int *)(0x42A61E00UL)))
#define bM4_DMA1_MONSNSEQCTL2_SOFFSET1 (*((volatile unsigned int *)(0x42A61E04UL)))
#define bM4_DMA1_MONSNSEQCTL2_SOFFSET2 (*((volatile unsigned int *)(0x42A61E08UL)))
#define bM4_DMA1_MONSNSEQCTL2_SOFFSET3 (*((volatile unsigned int *)(0x42A61E0CUL)))
#define bM4_DMA1_MONSNSEQCTL2_SOFFSET4 (*((volatile unsigned int *)(0x42A61E10UL)))
#define bM4_DMA1_MONSNSEQCTL2_SOFFSET5 (*((volatile unsigned int *)(0x42A61E14UL)))
#define bM4_DMA1_MONSNSEQCTL2_SOFFSET6 (*((volatile unsigned int *)(0x42A61E18UL)))
#define bM4_DMA1_MONSNSEQCTL2_SOFFSET7 (*((volatile unsigned int *)(0x42A61E1CUL)))
#define bM4_DMA1_MONSNSEQCTL2_SOFFSET8 (*((volatile unsigned int *)(0x42A61E20UL)))
#define bM4_DMA1_MONSNSEQCTL2_SOFFSET9 (*((volatile unsigned int *)(0x42A61E24UL)))
#define bM4_DMA1_MONSNSEQCTL2_SOFFSET10 (*((volatile unsigned int *)(0x42A61E28UL)))
#define bM4_DMA1_MONSNSEQCTL2_SOFFSET11 (*((volatile unsigned int *)(0x42A61E2CUL)))
#define bM4_DMA1_MONSNSEQCTL2_SOFFSET12 (*((volatile unsigned int *)(0x42A61E30UL)))
#define bM4_DMA1_MONSNSEQCTL2_SOFFSET13 (*((volatile unsigned int *)(0x42A61E34UL)))
#define bM4_DMA1_MONSNSEQCTL2_SOFFSET14 (*((volatile unsigned int *)(0x42A61E38UL)))
#define bM4_DMA1_MONSNSEQCTL2_SOFFSET15 (*((volatile unsigned int *)(0x42A61E3CUL)))
#define bM4_DMA1_MONSNSEQCTL2_SOFFSET16 (*((volatile unsigned int *)(0x42A61E40UL)))
#define bM4_DMA1_MONSNSEQCTL2_SOFFSET17 (*((volatile unsigned int *)(0x42A61E44UL)))
#define bM4_DMA1_MONSNSEQCTL2_SOFFSET18 (*((volatile unsigned int *)(0x42A61E48UL)))
#define bM4_DMA1_MONSNSEQCTL2_SOFFSET19 (*((volatile unsigned int *)(0x42A61E4CUL)))
#define bM4_DMA1_MONSNSEQCTL2_SNSCNT0 (*((volatile unsigned int *)(0x42A61E50UL)))
#define bM4_DMA1_MONSNSEQCTL2_SNSCNT1 (*((volatile unsigned int *)(0x42A61E54UL)))
#define bM4_DMA1_MONSNSEQCTL2_SNSCNT2 (*((volatile unsigned int *)(0x42A61E58UL)))
#define bM4_DMA1_MONSNSEQCTL2_SNSCNT3 (*((volatile unsigned int *)(0x42A61E5CUL)))
#define bM4_DMA1_MONSNSEQCTL2_SNSCNT4 (*((volatile unsigned int *)(0x42A61E60UL)))
#define bM4_DMA1_MONSNSEQCTL2_SNSCNT5 (*((volatile unsigned int *)(0x42A61E64UL)))
#define bM4_DMA1_MONSNSEQCTL2_SNSCNT6 (*((volatile unsigned int *)(0x42A61E68UL)))
#define bM4_DMA1_MONSNSEQCTL2_SNSCNT7 (*((volatile unsigned int *)(0x42A61E6CUL)))
#define bM4_DMA1_MONSNSEQCTL2_SNSCNT8 (*((volatile unsigned int *)(0x42A61E70UL)))
#define bM4_DMA1_MONSNSEQCTL2_SNSCNT9 (*((volatile unsigned int *)(0x42A61E74UL)))
#define bM4_DMA1_MONSNSEQCTL2_SNSCNT10 (*((volatile unsigned int *)(0x42A61E78UL)))
#define bM4_DMA1_MONSNSEQCTL2_SNSCNT11 (*((volatile unsigned int *)(0x42A61E7CUL)))
#define bM4_DMA1_MONDNSEQCTL2_DOFFSET0 (*((volatile unsigned int *)(0x42A61E80UL)))
#define bM4_DMA1_MONDNSEQCTL2_DOFFSET1 (*((volatile unsigned int *)(0x42A61E84UL)))
#define bM4_DMA1_MONDNSEQCTL2_DOFFSET2 (*((volatile unsigned int *)(0x42A61E88UL)))
#define bM4_DMA1_MONDNSEQCTL2_DOFFSET3 (*((volatile unsigned int *)(0x42A61E8CUL)))
#define bM4_DMA1_MONDNSEQCTL2_DOFFSET4 (*((volatile unsigned int *)(0x42A61E90UL)))
#define bM4_DMA1_MONDNSEQCTL2_DOFFSET5 (*((volatile unsigned int *)(0x42A61E94UL)))
#define bM4_DMA1_MONDNSEQCTL2_DOFFSET6 (*((volatile unsigned int *)(0x42A61E98UL)))
#define bM4_DMA1_MONDNSEQCTL2_DOFFSET7 (*((volatile unsigned int *)(0x42A61E9CUL)))
#define bM4_DMA1_MONDNSEQCTL2_DOFFSET8 (*((volatile unsigned int *)(0x42A61EA0UL)))
#define bM4_DMA1_MONDNSEQCTL2_DOFFSET9 (*((volatile unsigned int *)(0x42A61EA4UL)))
#define bM4_DMA1_MONDNSEQCTL2_DOFFSET10 (*((volatile unsigned int *)(0x42A61EA8UL)))
#define bM4_DMA1_MONDNSEQCTL2_DOFFSET11 (*((volatile unsigned int *)(0x42A61EACUL)))
#define bM4_DMA1_MONDNSEQCTL2_DOFFSET12 (*((volatile unsigned int *)(0x42A61EB0UL)))
#define bM4_DMA1_MONDNSEQCTL2_DOFFSET13 (*((volatile unsigned int *)(0x42A61EB4UL)))
#define bM4_DMA1_MONDNSEQCTL2_DOFFSET14 (*((volatile unsigned int *)(0x42A61EB8UL)))
#define bM4_DMA1_MONDNSEQCTL2_DOFFSET15 (*((volatile unsigned int *)(0x42A61EBCUL)))
#define bM4_DMA1_MONDNSEQCTL2_DOFFSET16 (*((volatile unsigned int *)(0x42A61EC0UL)))
#define bM4_DMA1_MONDNSEQCTL2_DOFFSET17 (*((volatile unsigned int *)(0x42A61EC4UL)))
#define bM4_DMA1_MONDNSEQCTL2_DOFFSET18 (*((volatile unsigned int *)(0x42A61EC8UL)))
#define bM4_DMA1_MONDNSEQCTL2_DOFFSET19 (*((volatile unsigned int *)(0x42A61ECCUL)))
#define bM4_DMA1_MONDNSEQCTL2_DNSCNT0 (*((volatile unsigned int *)(0x42A61ED0UL)))
#define bM4_DMA1_MONDNSEQCTL2_DNSCNT1 (*((volatile unsigned int *)(0x42A61ED4UL)))
#define bM4_DMA1_MONDNSEQCTL2_DNSCNT2 (*((volatile unsigned int *)(0x42A61ED8UL)))
#define bM4_DMA1_MONDNSEQCTL2_DNSCNT3 (*((volatile unsigned int *)(0x42A61EDCUL)))
#define bM4_DMA1_MONDNSEQCTL2_DNSCNT4 (*((volatile unsigned int *)(0x42A61EE0UL)))
#define bM4_DMA1_MONDNSEQCTL2_DNSCNT5 (*((volatile unsigned int *)(0x42A61EE4UL)))
#define bM4_DMA1_MONDNSEQCTL2_DNSCNT6 (*((volatile unsigned int *)(0x42A61EE8UL)))
#define bM4_DMA1_MONDNSEQCTL2_DNSCNT7 (*((volatile unsigned int *)(0x42A61EECUL)))
#define bM4_DMA1_MONDNSEQCTL2_DNSCNT8 (*((volatile unsigned int *)(0x42A61EF0UL)))
#define bM4_DMA1_MONDNSEQCTL2_DNSCNT9 (*((volatile unsigned int *)(0x42A61EF4UL)))
#define bM4_DMA1_MONDNSEQCTL2_DNSCNT10 (*((volatile unsigned int *)(0x42A61EF8UL)))
#define bM4_DMA1_MONDNSEQCTL2_DNSCNT11 (*((volatile unsigned int *)(0x42A61EFCUL)))
#define bM4_DMA1_DTCTL3_BLKSIZE0 (*((volatile unsigned int *)(0x42A62100UL)))
#define bM4_DMA1_DTCTL3_BLKSIZE1 (*((volatile unsigned int *)(0x42A62104UL)))
#define bM4_DMA1_DTCTL3_BLKSIZE2 (*((volatile unsigned int *)(0x42A62108UL)))
#define bM4_DMA1_DTCTL3_BLKSIZE3 (*((volatile unsigned int *)(0x42A6210CUL)))
#define bM4_DMA1_DTCTL3_BLKSIZE4 (*((volatile unsigned int *)(0x42A62110UL)))
#define bM4_DMA1_DTCTL3_BLKSIZE5 (*((volatile unsigned int *)(0x42A62114UL)))
#define bM4_DMA1_DTCTL3_BLKSIZE6 (*((volatile unsigned int *)(0x42A62118UL)))
#define bM4_DMA1_DTCTL3_BLKSIZE7 (*((volatile unsigned int *)(0x42A6211CUL)))
#define bM4_DMA1_DTCTL3_BLKSIZE8 (*((volatile unsigned int *)(0x42A62120UL)))
#define bM4_DMA1_DTCTL3_BLKSIZE9 (*((volatile unsigned int *)(0x42A62124UL)))
#define bM4_DMA1_DTCTL3_CNT0 (*((volatile unsigned int *)(0x42A62140UL)))
#define bM4_DMA1_DTCTL3_CNT1 (*((volatile unsigned int *)(0x42A62144UL)))
#define bM4_DMA1_DTCTL3_CNT2 (*((volatile unsigned int *)(0x42A62148UL)))
#define bM4_DMA1_DTCTL3_CNT3 (*((volatile unsigned int *)(0x42A6214CUL)))
#define bM4_DMA1_DTCTL3_CNT4 (*((volatile unsigned int *)(0x42A62150UL)))
#define bM4_DMA1_DTCTL3_CNT5 (*((volatile unsigned int *)(0x42A62154UL)))
#define bM4_DMA1_DTCTL3_CNT6 (*((volatile unsigned int *)(0x42A62158UL)))
#define bM4_DMA1_DTCTL3_CNT7 (*((volatile unsigned int *)(0x42A6215CUL)))
#define bM4_DMA1_DTCTL3_CNT8 (*((volatile unsigned int *)(0x42A62160UL)))
#define bM4_DMA1_DTCTL3_CNT9 (*((volatile unsigned int *)(0x42A62164UL)))
#define bM4_DMA1_DTCTL3_CNT10 (*((volatile unsigned int *)(0x42A62168UL)))
#define bM4_DMA1_DTCTL3_CNT11 (*((volatile unsigned int *)(0x42A6216CUL)))
#define bM4_DMA1_DTCTL3_CNT12 (*((volatile unsigned int *)(0x42A62170UL)))
#define bM4_DMA1_DTCTL3_CNT13 (*((volatile unsigned int *)(0x42A62174UL)))
#define bM4_DMA1_DTCTL3_CNT14 (*((volatile unsigned int *)(0x42A62178UL)))
#define bM4_DMA1_DTCTL3_CNT15 (*((volatile unsigned int *)(0x42A6217CUL)))
#define bM4_DMA1_RPT3_SRPT0 (*((volatile unsigned int *)(0x42A62180UL)))
#define bM4_DMA1_RPT3_SRPT1 (*((volatile unsigned int *)(0x42A62184UL)))
#define bM4_DMA1_RPT3_SRPT2 (*((volatile unsigned int *)(0x42A62188UL)))
#define bM4_DMA1_RPT3_SRPT3 (*((volatile unsigned int *)(0x42A6218CUL)))
#define bM4_DMA1_RPT3_SRPT4 (*((volatile unsigned int *)(0x42A62190UL)))
#define bM4_DMA1_RPT3_SRPT5 (*((volatile unsigned int *)(0x42A62194UL)))
#define bM4_DMA1_RPT3_SRPT6 (*((volatile unsigned int *)(0x42A62198UL)))
#define bM4_DMA1_RPT3_SRPT7 (*((volatile unsigned int *)(0x42A6219CUL)))
#define bM4_DMA1_RPT3_SRPT8 (*((volatile unsigned int *)(0x42A621A0UL)))
#define bM4_DMA1_RPT3_SRPT9 (*((volatile unsigned int *)(0x42A621A4UL)))
#define bM4_DMA1_RPT3_DRPT0 (*((volatile unsigned int *)(0x42A621C0UL)))
#define bM4_DMA1_RPT3_DRPT1 (*((volatile unsigned int *)(0x42A621C4UL)))
#define bM4_DMA1_RPT3_DRPT2 (*((volatile unsigned int *)(0x42A621C8UL)))
#define bM4_DMA1_RPT3_DRPT3 (*((volatile unsigned int *)(0x42A621CCUL)))
#define bM4_DMA1_RPT3_DRPT4 (*((volatile unsigned int *)(0x42A621D0UL)))
#define bM4_DMA1_RPT3_DRPT5 (*((volatile unsigned int *)(0x42A621D4UL)))
#define bM4_DMA1_RPT3_DRPT6 (*((volatile unsigned int *)(0x42A621D8UL)))
#define bM4_DMA1_RPT3_DRPT7 (*((volatile unsigned int *)(0x42A621DCUL)))
#define bM4_DMA1_RPT3_DRPT8 (*((volatile unsigned int *)(0x42A621E0UL)))
#define bM4_DMA1_RPT3_DRPT9 (*((volatile unsigned int *)(0x42A621E4UL)))
#define bM4_DMA1_RPTB3_SRPTB0 (*((volatile unsigned int *)(0x42A62180UL)))
#define bM4_DMA1_RPTB3_SRPTB1 (*((volatile unsigned int *)(0x42A62184UL)))
#define bM4_DMA1_RPTB3_SRPTB2 (*((volatile unsigned int *)(0x42A62188UL)))
#define bM4_DMA1_RPTB3_SRPTB3 (*((volatile unsigned int *)(0x42A6218CUL)))
#define bM4_DMA1_RPTB3_SRPTB4 (*((volatile unsigned int *)(0x42A62190UL)))
#define bM4_DMA1_RPTB3_SRPTB5 (*((volatile unsigned int *)(0x42A62194UL)))
#define bM4_DMA1_RPTB3_SRPTB6 (*((volatile unsigned int *)(0x42A62198UL)))
#define bM4_DMA1_RPTB3_SRPTB7 (*((volatile unsigned int *)(0x42A6219CUL)))
#define bM4_DMA1_RPTB3_SRPTB8 (*((volatile unsigned int *)(0x42A621A0UL)))
#define bM4_DMA1_RPTB3_SRPTB9 (*((volatile unsigned int *)(0x42A621A4UL)))
#define bM4_DMA1_RPTB3_DRPTB0 (*((volatile unsigned int *)(0x42A621C0UL)))
#define bM4_DMA1_RPTB3_DRPTB1 (*((volatile unsigned int *)(0x42A621C4UL)))
#define bM4_DMA1_RPTB3_DRPTB2 (*((volatile unsigned int *)(0x42A621C8UL)))
#define bM4_DMA1_RPTB3_DRPTB3 (*((volatile unsigned int *)(0x42A621CCUL)))
#define bM4_DMA1_RPTB3_DRPTB4 (*((volatile unsigned int *)(0x42A621D0UL)))
#define bM4_DMA1_RPTB3_DRPTB5 (*((volatile unsigned int *)(0x42A621D4UL)))
#define bM4_DMA1_RPTB3_DRPTB6 (*((volatile unsigned int *)(0x42A621D8UL)))
#define bM4_DMA1_RPTB3_DRPTB7 (*((volatile unsigned int *)(0x42A621DCUL)))
#define bM4_DMA1_RPTB3_DRPTB8 (*((volatile unsigned int *)(0x42A621E0UL)))
#define bM4_DMA1_RPTB3_DRPTB9 (*((volatile unsigned int *)(0x42A621E4UL)))
#define bM4_DMA1_SNSEQCTL3_SOFFSET0 (*((volatile unsigned int *)(0x42A62200UL)))
#define bM4_DMA1_SNSEQCTL3_SOFFSET1 (*((volatile unsigned int *)(0x42A62204UL)))
#define bM4_DMA1_SNSEQCTL3_SOFFSET2 (*((volatile unsigned int *)(0x42A62208UL)))
#define bM4_DMA1_SNSEQCTL3_SOFFSET3 (*((volatile unsigned int *)(0x42A6220CUL)))
#define bM4_DMA1_SNSEQCTL3_SOFFSET4 (*((volatile unsigned int *)(0x42A62210UL)))
#define bM4_DMA1_SNSEQCTL3_SOFFSET5 (*((volatile unsigned int *)(0x42A62214UL)))
#define bM4_DMA1_SNSEQCTL3_SOFFSET6 (*((volatile unsigned int *)(0x42A62218UL)))
#define bM4_DMA1_SNSEQCTL3_SOFFSET7 (*((volatile unsigned int *)(0x42A6221CUL)))
#define bM4_DMA1_SNSEQCTL3_SOFFSET8 (*((volatile unsigned int *)(0x42A62220UL)))
#define bM4_DMA1_SNSEQCTL3_SOFFSET9 (*((volatile unsigned int *)(0x42A62224UL)))
#define bM4_DMA1_SNSEQCTL3_SOFFSET10 (*((volatile unsigned int *)(0x42A62228UL)))
#define bM4_DMA1_SNSEQCTL3_SOFFSET11 (*((volatile unsigned int *)(0x42A6222CUL)))
#define bM4_DMA1_SNSEQCTL3_SOFFSET12 (*((volatile unsigned int *)(0x42A62230UL)))
#define bM4_DMA1_SNSEQCTL3_SOFFSET13 (*((volatile unsigned int *)(0x42A62234UL)))
#define bM4_DMA1_SNSEQCTL3_SOFFSET14 (*((volatile unsigned int *)(0x42A62238UL)))
#define bM4_DMA1_SNSEQCTL3_SOFFSET15 (*((volatile unsigned int *)(0x42A6223CUL)))
#define bM4_DMA1_SNSEQCTL3_SOFFSET16 (*((volatile unsigned int *)(0x42A62240UL)))
#define bM4_DMA1_SNSEQCTL3_SOFFSET17 (*((volatile unsigned int *)(0x42A62244UL)))
#define bM4_DMA1_SNSEQCTL3_SOFFSET18 (*((volatile unsigned int *)(0x42A62248UL)))
#define bM4_DMA1_SNSEQCTL3_SOFFSET19 (*((volatile unsigned int *)(0x42A6224CUL)))
#define bM4_DMA1_SNSEQCTL3_SNSCNT0 (*((volatile unsigned int *)(0x42A62250UL)))
#define bM4_DMA1_SNSEQCTL3_SNSCNT1 (*((volatile unsigned int *)(0x42A62254UL)))
#define bM4_DMA1_SNSEQCTL3_SNSCNT2 (*((volatile unsigned int *)(0x42A62258UL)))
#define bM4_DMA1_SNSEQCTL3_SNSCNT3 (*((volatile unsigned int *)(0x42A6225CUL)))
#define bM4_DMA1_SNSEQCTL3_SNSCNT4 (*((volatile unsigned int *)(0x42A62260UL)))
#define bM4_DMA1_SNSEQCTL3_SNSCNT5 (*((volatile unsigned int *)(0x42A62264UL)))
#define bM4_DMA1_SNSEQCTL3_SNSCNT6 (*((volatile unsigned int *)(0x42A62268UL)))
#define bM4_DMA1_SNSEQCTL3_SNSCNT7 (*((volatile unsigned int *)(0x42A6226CUL)))
#define bM4_DMA1_SNSEQCTL3_SNSCNT8 (*((volatile unsigned int *)(0x42A62270UL)))
#define bM4_DMA1_SNSEQCTL3_SNSCNT9 (*((volatile unsigned int *)(0x42A62274UL)))
#define bM4_DMA1_SNSEQCTL3_SNSCNT10 (*((volatile unsigned int *)(0x42A62278UL)))
#define bM4_DMA1_SNSEQCTL3_SNSCNT11 (*((volatile unsigned int *)(0x42A6227CUL)))
#define bM4_DMA1_SNSEQCTLB3_SNSDIST0 (*((volatile unsigned int *)(0x42A62200UL)))
#define bM4_DMA1_SNSEQCTLB3_SNSDIST1 (*((volatile unsigned int *)(0x42A62204UL)))
#define bM4_DMA1_SNSEQCTLB3_SNSDIST2 (*((volatile unsigned int *)(0x42A62208UL)))
#define bM4_DMA1_SNSEQCTLB3_SNSDIST3 (*((volatile unsigned int *)(0x42A6220CUL)))
#define bM4_DMA1_SNSEQCTLB3_SNSDIST4 (*((volatile unsigned int *)(0x42A62210UL)))
#define bM4_DMA1_SNSEQCTLB3_SNSDIST5 (*((volatile unsigned int *)(0x42A62214UL)))
#define bM4_DMA1_SNSEQCTLB3_SNSDIST6 (*((volatile unsigned int *)(0x42A62218UL)))
#define bM4_DMA1_SNSEQCTLB3_SNSDIST7 (*((volatile unsigned int *)(0x42A6221CUL)))
#define bM4_DMA1_SNSEQCTLB3_SNSDIST8 (*((volatile unsigned int *)(0x42A62220UL)))
#define bM4_DMA1_SNSEQCTLB3_SNSDIST9 (*((volatile unsigned int *)(0x42A62224UL)))
#define bM4_DMA1_SNSEQCTLB3_SNSDIST10 (*((volatile unsigned int *)(0x42A62228UL)))
#define bM4_DMA1_SNSEQCTLB3_SNSDIST11 (*((volatile unsigned int *)(0x42A6222CUL)))
#define bM4_DMA1_SNSEQCTLB3_SNSDIST12 (*((volatile unsigned int *)(0x42A62230UL)))
#define bM4_DMA1_SNSEQCTLB3_SNSDIST13 (*((volatile unsigned int *)(0x42A62234UL)))
#define bM4_DMA1_SNSEQCTLB3_SNSDIST14 (*((volatile unsigned int *)(0x42A62238UL)))
#define bM4_DMA1_SNSEQCTLB3_SNSDIST15 (*((volatile unsigned int *)(0x42A6223CUL)))
#define bM4_DMA1_SNSEQCTLB3_SNSDIST16 (*((volatile unsigned int *)(0x42A62240UL)))
#define bM4_DMA1_SNSEQCTLB3_SNSDIST17 (*((volatile unsigned int *)(0x42A62244UL)))
#define bM4_DMA1_SNSEQCTLB3_SNSDIST18 (*((volatile unsigned int *)(0x42A62248UL)))
#define bM4_DMA1_SNSEQCTLB3_SNSDIST19 (*((volatile unsigned int *)(0x42A6224CUL)))
#define bM4_DMA1_SNSEQCTLB3_SNSCNTB0 (*((volatile unsigned int *)(0x42A62250UL)))
#define bM4_DMA1_SNSEQCTLB3_SNSCNTB1 (*((volatile unsigned int *)(0x42A62254UL)))
#define bM4_DMA1_SNSEQCTLB3_SNSCNTB2 (*((volatile unsigned int *)(0x42A62258UL)))
#define bM4_DMA1_SNSEQCTLB3_SNSCNTB3 (*((volatile unsigned int *)(0x42A6225CUL)))
#define bM4_DMA1_SNSEQCTLB3_SNSCNTB4 (*((volatile unsigned int *)(0x42A62260UL)))
#define bM4_DMA1_SNSEQCTLB3_SNSCNTB5 (*((volatile unsigned int *)(0x42A62264UL)))
#define bM4_DMA1_SNSEQCTLB3_SNSCNTB6 (*((volatile unsigned int *)(0x42A62268UL)))
#define bM4_DMA1_SNSEQCTLB3_SNSCNTB7 (*((volatile unsigned int *)(0x42A6226CUL)))
#define bM4_DMA1_SNSEQCTLB3_SNSCNTB8 (*((volatile unsigned int *)(0x42A62270UL)))
#define bM4_DMA1_SNSEQCTLB3_SNSCNTB9 (*((volatile unsigned int *)(0x42A62274UL)))
#define bM4_DMA1_SNSEQCTLB3_SNSCNTB10 (*((volatile unsigned int *)(0x42A62278UL)))
#define bM4_DMA1_SNSEQCTLB3_SNSCNTB11 (*((volatile unsigned int *)(0x42A6227CUL)))
#define bM4_DMA1_DNSEQCTL3_DOFFSET0 (*((volatile unsigned int *)(0x42A62280UL)))
#define bM4_DMA1_DNSEQCTL3_DOFFSET1 (*((volatile unsigned int *)(0x42A62284UL)))
#define bM4_DMA1_DNSEQCTL3_DOFFSET2 (*((volatile unsigned int *)(0x42A62288UL)))
#define bM4_DMA1_DNSEQCTL3_DOFFSET3 (*((volatile unsigned int *)(0x42A6228CUL)))
#define bM4_DMA1_DNSEQCTL3_DOFFSET4 (*((volatile unsigned int *)(0x42A62290UL)))
#define bM4_DMA1_DNSEQCTL3_DOFFSET5 (*((volatile unsigned int *)(0x42A62294UL)))
#define bM4_DMA1_DNSEQCTL3_DOFFSET6 (*((volatile unsigned int *)(0x42A62298UL)))
#define bM4_DMA1_DNSEQCTL3_DOFFSET7 (*((volatile unsigned int *)(0x42A6229CUL)))
#define bM4_DMA1_DNSEQCTL3_DOFFSET8 (*((volatile unsigned int *)(0x42A622A0UL)))
#define bM4_DMA1_DNSEQCTL3_DOFFSET9 (*((volatile unsigned int *)(0x42A622A4UL)))
#define bM4_DMA1_DNSEQCTL3_DOFFSET10 (*((volatile unsigned int *)(0x42A622A8UL)))
#define bM4_DMA1_DNSEQCTL3_DOFFSET11 (*((volatile unsigned int *)(0x42A622ACUL)))
#define bM4_DMA1_DNSEQCTL3_DOFFSET12 (*((volatile unsigned int *)(0x42A622B0UL)))
#define bM4_DMA1_DNSEQCTL3_DOFFSET13 (*((volatile unsigned int *)(0x42A622B4UL)))
#define bM4_DMA1_DNSEQCTL3_DOFFSET14 (*((volatile unsigned int *)(0x42A622B8UL)))
#define bM4_DMA1_DNSEQCTL3_DOFFSET15 (*((volatile unsigned int *)(0x42A622BCUL)))
#define bM4_DMA1_DNSEQCTL3_DOFFSET16 (*((volatile unsigned int *)(0x42A622C0UL)))
#define bM4_DMA1_DNSEQCTL3_DOFFSET17 (*((volatile unsigned int *)(0x42A622C4UL)))
#define bM4_DMA1_DNSEQCTL3_DOFFSET18 (*((volatile unsigned int *)(0x42A622C8UL)))
#define bM4_DMA1_DNSEQCTL3_DOFFSET19 (*((volatile unsigned int *)(0x42A622CCUL)))
#define bM4_DMA1_DNSEQCTL3_DNSCNT0 (*((volatile unsigned int *)(0x42A622D0UL)))
#define bM4_DMA1_DNSEQCTL3_DNSCNT1 (*((volatile unsigned int *)(0x42A622D4UL)))
#define bM4_DMA1_DNSEQCTL3_DNSCNT2 (*((volatile unsigned int *)(0x42A622D8UL)))
#define bM4_DMA1_DNSEQCTL3_DNSCNT3 (*((volatile unsigned int *)(0x42A622DCUL)))
#define bM4_DMA1_DNSEQCTL3_DNSCNT4 (*((volatile unsigned int *)(0x42A622E0UL)))
#define bM4_DMA1_DNSEQCTL3_DNSCNT5 (*((volatile unsigned int *)(0x42A622E4UL)))
#define bM4_DMA1_DNSEQCTL3_DNSCNT6 (*((volatile unsigned int *)(0x42A622E8UL)))
#define bM4_DMA1_DNSEQCTL3_DNSCNT7 (*((volatile unsigned int *)(0x42A622ECUL)))
#define bM4_DMA1_DNSEQCTL3_DNSCNT8 (*((volatile unsigned int *)(0x42A622F0UL)))
#define bM4_DMA1_DNSEQCTL3_DNSCNT9 (*((volatile unsigned int *)(0x42A622F4UL)))
#define bM4_DMA1_DNSEQCTL3_DNSCNT10 (*((volatile unsigned int *)(0x42A622F8UL)))
#define bM4_DMA1_DNSEQCTL3_DNSCNT11 (*((volatile unsigned int *)(0x42A622FCUL)))
#define bM4_DMA1_DNSEQCTLB3_DNSDIST0 (*((volatile unsigned int *)(0x42A62280UL)))
#define bM4_DMA1_DNSEQCTLB3_DNSDIST1 (*((volatile unsigned int *)(0x42A62284UL)))
#define bM4_DMA1_DNSEQCTLB3_DNSDIST2 (*((volatile unsigned int *)(0x42A62288UL)))
#define bM4_DMA1_DNSEQCTLB3_DNSDIST3 (*((volatile unsigned int *)(0x42A6228CUL)))
#define bM4_DMA1_DNSEQCTLB3_DNSDIST4 (*((volatile unsigned int *)(0x42A62290UL)))
#define bM4_DMA1_DNSEQCTLB3_DNSDIST5 (*((volatile unsigned int *)(0x42A62294UL)))
#define bM4_DMA1_DNSEQCTLB3_DNSDIST6 (*((volatile unsigned int *)(0x42A62298UL)))
#define bM4_DMA1_DNSEQCTLB3_DNSDIST7 (*((volatile unsigned int *)(0x42A6229CUL)))
#define bM4_DMA1_DNSEQCTLB3_DNSDIST8 (*((volatile unsigned int *)(0x42A622A0UL)))
