MarlinFirmware/Marlin/Marlin/lib/h32_core/main/hdsc32core/common/hc32f46x.h
#define bM4_DMA2_RPTB0_DRPTB3 (*((volatile unsigned int *)(0x42A689CCUL)))
#define bM4_DMA2_RPTB0_DRPTB4 (*((volatile unsigned int *)(0x42A689D0UL)))
#define bM4_DMA2_RPTB0_DRPTB5 (*((volatile unsigned int *)(0x42A689D4UL)))
#define bM4_DMA2_RPTB0_DRPTB6 (*((volatile unsigned int *)(0x42A689D8UL)))
#define bM4_DMA2_RPTB0_DRPTB7 (*((volatile unsigned int *)(0x42A689DCUL)))
#define bM4_DMA2_RPTB0_DRPTB8 (*((volatile unsigned int *)(0x42A689E0UL)))
#define bM4_DMA2_RPTB0_DRPTB9 (*((volatile unsigned int *)(0x42A689E4UL)))
#define bM4_DMA2_SNSEQCTL0_SOFFSET0 (*((volatile unsigned int *)(0x42A68A00UL)))
#define bM4_DMA2_SNSEQCTL0_SOFFSET1 (*((volatile unsigned int *)(0x42A68A04UL)))
#define bM4_DMA2_SNSEQCTL0_SOFFSET2 (*((volatile unsigned int *)(0x42A68A08UL)))
#define bM4_DMA2_SNSEQCTL0_SOFFSET3 (*((volatile unsigned int *)(0x42A68A0CUL)))
#define bM4_DMA2_SNSEQCTL0_SOFFSET4 (*((volatile unsigned int *)(0x42A68A10UL)))
#define bM4_DMA2_SNSEQCTL0_SOFFSET5 (*((volatile unsigned int *)(0x42A68A14UL)))
#define bM4_DMA2_SNSEQCTL0_SOFFSET6 (*((volatile unsigned int *)(0x42A68A18UL)))
#define bM4_DMA2_SNSEQCTL0_SOFFSET7 (*((volatile unsigned int *)(0x42A68A1CUL)))
#define bM4_DMA2_SNSEQCTL0_SOFFSET8 (*((volatile unsigned int *)(0x42A68A20UL)))
#define bM4_DMA2_SNSEQCTL0_SOFFSET9 (*((volatile unsigned int *)(0x42A68A24UL)))
#define bM4_DMA2_SNSEQCTL0_SOFFSET10 (*((volatile unsigned int *)(0x42A68A28UL)))
#define bM4_DMA2_SNSEQCTL0_SOFFSET11 (*((volatile unsigned int *)(0x42A68A2CUL)))
#define bM4_DMA2_SNSEQCTL0_SOFFSET12 (*((volatile unsigned int *)(0x42A68A30UL)))
#define bM4_DMA2_SNSEQCTL0_SOFFSET13 (*((volatile unsigned int *)(0x42A68A34UL)))
#define bM4_DMA2_SNSEQCTL0_SOFFSET14 (*((volatile unsigned int *)(0x42A68A38UL)))
#define bM4_DMA2_SNSEQCTL0_SOFFSET15 (*((volatile unsigned int *)(0x42A68A3CUL)))
#define bM4_DMA2_SNSEQCTL0_SOFFSET16 (*((volatile unsigned int *)(0x42A68A40UL)))
#define bM4_DMA2_SNSEQCTL0_SOFFSET17 (*((volatile unsigned int *)(0x42A68A44UL)))
#define bM4_DMA2_SNSEQCTL0_SOFFSET18 (*((volatile unsigned int *)(0x42A68A48UL)))
#define bM4_DMA2_SNSEQCTL0_SOFFSET19 (*((volatile unsigned int *)(0x42A68A4CUL)))
#define bM4_DMA2_SNSEQCTL0_SNSCNT0 (*((volatile unsigned int *)(0x42A68A50UL)))
#define bM4_DMA2_SNSEQCTL0_SNSCNT1 (*((volatile unsigned int *)(0x42A68A54UL)))
#define bM4_DMA2_SNSEQCTL0_SNSCNT2 (*((volatile unsigned int *)(0x42A68A58UL)))
#define bM4_DMA2_SNSEQCTL0_SNSCNT3 (*((volatile unsigned int *)(0x42A68A5CUL)))
#define bM4_DMA2_SNSEQCTL0_SNSCNT4 (*((volatile unsigned int *)(0x42A68A60UL)))
#define bM4_DMA2_SNSEQCTL0_SNSCNT5 (*((volatile unsigned int *)(0x42A68A64UL)))
#define bM4_DMA2_SNSEQCTL0_SNSCNT6 (*((volatile unsigned int *)(0x42A68A68UL)))
#define bM4_DMA2_SNSEQCTL0_SNSCNT7 (*((volatile unsigned int *)(0x42A68A6CUL)))
#define bM4_DMA2_SNSEQCTL0_SNSCNT8 (*((volatile unsigned int *)(0x42A68A70UL)))
#define bM4_DMA2_SNSEQCTL0_SNSCNT9 (*((volatile unsigned int *)(0x42A68A74UL)))
#define bM4_DMA2_SNSEQCTL0_SNSCNT10 (*((volatile unsigned int *)(0x42A68A78UL)))
#define bM4_DMA2_SNSEQCTL0_SNSCNT11 (*((volatile unsigned int *)(0x42A68A7CUL)))
#define bM4_DMA2_SNSEQCTLB0_SNSDIST0 (*((volatile unsigned int *)(0x42A68A00UL)))
#define bM4_DMA2_SNSEQCTLB0_SNSDIST1 (*((volatile unsigned int *)(0x42A68A04UL)))
#define bM4_DMA2_SNSEQCTLB0_SNSDIST2 (*((volatile unsigned int *)(0x42A68A08UL)))
#define bM4_DMA2_SNSEQCTLB0_SNSDIST3 (*((volatile unsigned int *)(0x42A68A0CUL)))
#define bM4_DMA2_SNSEQCTLB0_SNSDIST4 (*((volatile unsigned int *)(0x42A68A10UL)))
#define bM4_DMA2_SNSEQCTLB0_SNSDIST5 (*((volatile unsigned int *)(0x42A68A14UL)))
#define bM4_DMA2_SNSEQCTLB0_SNSDIST6 (*((volatile unsigned int *)(0x42A68A18UL)))
#define bM4_DMA2_SNSEQCTLB0_SNSDIST7 (*((volatile unsigned int *)(0x42A68A1CUL)))
#define bM4_DMA2_SNSEQCTLB0_SNSDIST8 (*((volatile unsigned int *)(0x42A68A20UL)))
#define bM4_DMA2_SNSEQCTLB0_SNSDIST9 (*((volatile unsigned int *)(0x42A68A24UL)))
#define bM4_DMA2_SNSEQCTLB0_SNSDIST10 (*((volatile unsigned int *)(0x42A68A28UL)))
#define bM4_DMA2_SNSEQCTLB0_SNSDIST11 (*((volatile unsigned int *)(0x42A68A2CUL)))
#define bM4_DMA2_SNSEQCTLB0_SNSDIST12 (*((volatile unsigned int *)(0x42A68A30UL)))
#define bM4_DMA2_SNSEQCTLB0_SNSDIST13 (*((volatile unsigned int *)(0x42A68A34UL)))
#define bM4_DMA2_SNSEQCTLB0_SNSDIST14 (*((volatile unsigned int *)(0x42A68A38UL)))
#define bM4_DMA2_SNSEQCTLB0_SNSDIST15 (*((volatile unsigned int *)(0x42A68A3CUL)))
#define bM4_DMA2_SNSEQCTLB0_SNSDIST16 (*((volatile unsigned int *)(0x42A68A40UL)))
#define bM4_DMA2_SNSEQCTLB0_SNSDIST17 (*((volatile unsigned int *)(0x42A68A44UL)))
#define bM4_DMA2_SNSEQCTLB0_SNSDIST18 (*((volatile unsigned int *)(0x42A68A48UL)))
#define bM4_DMA2_SNSEQCTLB0_SNSDIST19 (*((volatile unsigned int *)(0x42A68A4CUL)))
#define bM4_DMA2_SNSEQCTLB0_SNSCNTB0 (*((volatile unsigned int *)(0x42A68A50UL)))
#define bM4_DMA2_SNSEQCTLB0_SNSCNTB1 (*((volatile unsigned int *)(0x42A68A54UL)))
#define bM4_DMA2_SNSEQCTLB0_SNSCNTB2 (*((volatile unsigned int *)(0x42A68A58UL)))
#define bM4_DMA2_SNSEQCTLB0_SNSCNTB3 (*((volatile unsigned int *)(0x42A68A5CUL)))
#define bM4_DMA2_SNSEQCTLB0_SNSCNTB4 (*((volatile unsigned int *)(0x42A68A60UL)))
#define bM4_DMA2_SNSEQCTLB0_SNSCNTB5 (*((volatile unsigned int *)(0x42A68A64UL)))
#define bM4_DMA2_SNSEQCTLB0_SNSCNTB6 (*((volatile unsigned int *)(0x42A68A68UL)))
#define bM4_DMA2_SNSEQCTLB0_SNSCNTB7 (*((volatile unsigned int *)(0x42A68A6CUL)))
#define bM4_DMA2_SNSEQCTLB0_SNSCNTB8 (*((volatile unsigned int *)(0x42A68A70UL)))
#define bM4_DMA2_SNSEQCTLB0_SNSCNTB9 (*((volatile unsigned int *)(0x42A68A74UL)))
#define bM4_DMA2_SNSEQCTLB0_SNSCNTB10 (*((volatile unsigned int *)(0x42A68A78UL)))
#define bM4_DMA2_SNSEQCTLB0_SNSCNTB11 (*((volatile unsigned int *)(0x42A68A7CUL)))
#define bM4_DMA2_DNSEQCTL0_DOFFSET0 (*((volatile unsigned int *)(0x42A68A80UL)))
#define bM4_DMA2_DNSEQCTL0_DOFFSET1 (*((volatile unsigned int *)(0x42A68A84UL)))
#define bM4_DMA2_DNSEQCTL0_DOFFSET2 (*((volatile unsigned int *)(0x42A68A88UL)))
#define bM4_DMA2_DNSEQCTL0_DOFFSET3 (*((volatile unsigned int *)(0x42A68A8CUL)))
#define bM4_DMA2_DNSEQCTL0_DOFFSET4 (*((volatile unsigned int *)(0x42A68A90UL)))
#define bM4_DMA2_DNSEQCTL0_DOFFSET5 (*((volatile unsigned int *)(0x42A68A94UL)))
#define bM4_DMA2_DNSEQCTL0_DOFFSET6 (*((volatile unsigned int *)(0x42A68A98UL)))
#define bM4_DMA2_DNSEQCTL0_DOFFSET7 (*((volatile unsigned int *)(0x42A68A9CUL)))
#define bM4_DMA2_DNSEQCTL0_DOFFSET8 (*((volatile unsigned int *)(0x42A68AA0UL)))
#define bM4_DMA2_DNSEQCTL0_DOFFSET9 (*((volatile unsigned int *)(0x42A68AA4UL)))
#define bM4_DMA2_DNSEQCTL0_DOFFSET10 (*((volatile unsigned int *)(0x42A68AA8UL)))
#define bM4_DMA2_DNSEQCTL0_DOFFSET11 (*((volatile unsigned int *)(0x42A68AACUL)))
#define bM4_DMA2_DNSEQCTL0_DOFFSET12 (*((volatile unsigned int *)(0x42A68AB0UL)))
#define bM4_DMA2_DNSEQCTL0_DOFFSET13 (*((volatile unsigned int *)(0x42A68AB4UL)))
#define bM4_DMA2_DNSEQCTL0_DOFFSET14 (*((volatile unsigned int *)(0x42A68AB8UL)))
#define bM4_DMA2_DNSEQCTL0_DOFFSET15 (*((volatile unsigned int *)(0x42A68ABCUL)))
#define bM4_DMA2_DNSEQCTL0_DOFFSET16 (*((volatile unsigned int *)(0x42A68AC0UL)))
#define bM4_DMA2_DNSEQCTL0_DOFFSET17 (*((volatile unsigned int *)(0x42A68AC4UL)))
#define bM4_DMA2_DNSEQCTL0_DOFFSET18 (*((volatile unsigned int *)(0x42A68AC8UL)))
#define bM4_DMA2_DNSEQCTL0_DOFFSET19 (*((volatile unsigned int *)(0x42A68ACCUL)))
#define bM4_DMA2_DNSEQCTL0_DNSCNT0 (*((volatile unsigned int *)(0x42A68AD0UL)))
#define bM4_DMA2_DNSEQCTL0_DNSCNT1 (*((volatile unsigned int *)(0x42A68AD4UL)))
#define bM4_DMA2_DNSEQCTL0_DNSCNT2 (*((volatile unsigned int *)(0x42A68AD8UL)))
#define bM4_DMA2_DNSEQCTL0_DNSCNT3 (*((volatile unsigned int *)(0x42A68ADCUL)))
#define bM4_DMA2_DNSEQCTL0_DNSCNT4 (*((volatile unsigned int *)(0x42A68AE0UL)))
#define bM4_DMA2_DNSEQCTL0_DNSCNT5 (*((volatile unsigned int *)(0x42A68AE4UL)))
#define bM4_DMA2_DNSEQCTL0_DNSCNT6 (*((volatile unsigned int *)(0x42A68AE8UL)))
#define bM4_DMA2_DNSEQCTL0_DNSCNT7 (*((volatile unsigned int *)(0x42A68AECUL)))
#define bM4_DMA2_DNSEQCTL0_DNSCNT8 (*((volatile unsigned int *)(0x42A68AF0UL)))
#define bM4_DMA2_DNSEQCTL0_DNSCNT9 (*((volatile unsigned int *)(0x42A68AF4UL)))
#define bM4_DMA2_DNSEQCTL0_DNSCNT10 (*((volatile unsigned int *)(0x42A68AF8UL)))
#define bM4_DMA2_DNSEQCTL0_DNSCNT11 (*((volatile unsigned int *)(0x42A68AFCUL)))
#define bM4_DMA2_DNSEQCTLB0_DNSDIST0 (*((volatile unsigned int *)(0x42A68A80UL)))
#define bM4_DMA2_DNSEQCTLB0_DNSDIST1 (*((volatile unsigned int *)(0x42A68A84UL)))
#define bM4_DMA2_DNSEQCTLB0_DNSDIST2 (*((volatile unsigned int *)(0x42A68A88UL)))
#define bM4_DMA2_DNSEQCTLB0_DNSDIST3 (*((volatile unsigned int *)(0x42A68A8CUL)))
#define bM4_DMA2_DNSEQCTLB0_DNSDIST4 (*((volatile unsigned int *)(0x42A68A90UL)))
#define bM4_DMA2_DNSEQCTLB0_DNSDIST5 (*((volatile unsigned int *)(0x42A68A94UL)))
#define bM4_DMA2_DNSEQCTLB0_DNSDIST6 (*((volatile unsigned int *)(0x42A68A98UL)))
#define bM4_DMA2_DNSEQCTLB0_DNSDIST7 (*((volatile unsigned int *)(0x42A68A9CUL)))
#define bM4_DMA2_DNSEQCTLB0_DNSDIST8 (*((volatile unsigned int *)(0x42A68AA0UL)))
#define bM4_DMA2_DNSEQCTLB0_DNSDIST9 (*((volatile unsigned int *)(0x42A68AA4UL)))
#define bM4_DMA2_DNSEQCTLB0_DNSDIST10 (*((volatile unsigned int *)(0x42A68AA8UL)))
#define bM4_DMA2_DNSEQCTLB0_DNSDIST11 (*((volatile unsigned int *)(0x42A68AACUL)))
#define bM4_DMA2_DNSEQCTLB0_DNSDIST12 (*((volatile unsigned int *)(0x42A68AB0UL)))
#define bM4_DMA2_DNSEQCTLB0_DNSDIST13 (*((volatile unsigned int *)(0x42A68AB4UL)))
#define bM4_DMA2_DNSEQCTLB0_DNSDIST14 (*((volatile unsigned int *)(0x42A68AB8UL)))
#define bM4_DMA2_DNSEQCTLB0_DNSDIST15 (*((volatile unsigned int *)(0x42A68ABCUL)))
#define bM4_DMA2_DNSEQCTLB0_DNSDIST16 (*((volatile unsigned int *)(0x42A68AC0UL)))
#define bM4_DMA2_DNSEQCTLB0_DNSDIST17 (*((volatile unsigned int *)(0x42A68AC4UL)))
#define bM4_DMA2_DNSEQCTLB0_DNSDIST18 (*((volatile unsigned int *)(0x42A68AC8UL)))
#define bM4_DMA2_DNSEQCTLB0_DNSDIST19 (*((volatile unsigned int *)(0x42A68ACCUL)))
#define bM4_DMA2_DNSEQCTLB0_DNSCNTB0 (*((volatile unsigned int *)(0x42A68AD0UL)))
#define bM4_DMA2_DNSEQCTLB0_DNSCNTB1 (*((volatile unsigned int *)(0x42A68AD4UL)))
#define bM4_DMA2_DNSEQCTLB0_DNSCNTB2 (*((volatile unsigned int *)(0x42A68AD8UL)))
#define bM4_DMA2_DNSEQCTLB0_DNSCNTB3 (*((volatile unsigned int *)(0x42A68ADCUL)))
#define bM4_DMA2_DNSEQCTLB0_DNSCNTB4 (*((volatile unsigned int *)(0x42A68AE0UL)))
#define bM4_DMA2_DNSEQCTLB0_DNSCNTB5 (*((volatile unsigned int *)(0x42A68AE4UL)))
#define bM4_DMA2_DNSEQCTLB0_DNSCNTB6 (*((volatile unsigned int *)(0x42A68AE8UL)))
#define bM4_DMA2_DNSEQCTLB0_DNSCNTB7 (*((volatile unsigned int *)(0x42A68AECUL)))
#define bM4_DMA2_DNSEQCTLB0_DNSCNTB8 (*((volatile unsigned int *)(0x42A68AF0UL)))
#define bM4_DMA2_DNSEQCTLB0_DNSCNTB9 (*((volatile unsigned int *)(0x42A68AF4UL)))
#define bM4_DMA2_DNSEQCTLB0_DNSCNTB10 (*((volatile unsigned int *)(0x42A68AF8UL)))
#define bM4_DMA2_DNSEQCTLB0_DNSCNTB11 (*((volatile unsigned int *)(0x42A68AFCUL)))
#define bM4_DMA2_LLP0_LLP0 (*((volatile unsigned int *)(0x42A68B08UL)))
#define bM4_DMA2_LLP0_LLP1 (*((volatile unsigned int *)(0x42A68B0CUL)))
#define bM4_DMA2_LLP0_LLP2 (*((volatile unsigned int *)(0x42A68B10UL)))
#define bM4_DMA2_LLP0_LLP3 (*((volatile unsigned int *)(0x42A68B14UL)))
#define bM4_DMA2_LLP0_LLP4 (*((volatile unsigned int *)(0x42A68B18UL)))
#define bM4_DMA2_LLP0_LLP5 (*((volatile unsigned int *)(0x42A68B1CUL)))
#define bM4_DMA2_LLP0_LLP6 (*((volatile unsigned int *)(0x42A68B20UL)))
#define bM4_DMA2_LLP0_LLP7 (*((volatile unsigned int *)(0x42A68B24UL)))
#define bM4_DMA2_LLP0_LLP8 (*((volatile unsigned int *)(0x42A68B28UL)))
#define bM4_DMA2_LLP0_LLP9 (*((volatile unsigned int *)(0x42A68B2CUL)))
#define bM4_DMA2_LLP0_LLP10 (*((volatile unsigned int *)(0x42A68B30UL)))
#define bM4_DMA2_LLP0_LLP11 (*((volatile unsigned int *)(0x42A68B34UL)))
#define bM4_DMA2_LLP0_LLP12 (*((volatile unsigned int *)(0x42A68B38UL)))
#define bM4_DMA2_LLP0_LLP13 (*((volatile unsigned int *)(0x42A68B3CUL)))
#define bM4_DMA2_LLP0_LLP14 (*((volatile unsigned int *)(0x42A68B40UL)))
#define bM4_DMA2_LLP0_LLP15 (*((volatile unsigned int *)(0x42A68B44UL)))
#define bM4_DMA2_LLP0_LLP16 (*((volatile unsigned int *)(0x42A68B48UL)))
#define bM4_DMA2_LLP0_LLP17 (*((volatile unsigned int *)(0x42A68B4CUL)))
#define bM4_DMA2_LLP0_LLP18 (*((volatile unsigned int *)(0x42A68B50UL)))
#define bM4_DMA2_LLP0_LLP19 (*((volatile unsigned int *)(0x42A68B54UL)))
#define bM4_DMA2_LLP0_LLP20 (*((volatile unsigned int *)(0x42A68B58UL)))
#define bM4_DMA2_LLP0_LLP21 (*((volatile unsigned int *)(0x42A68B5CUL)))
#define bM4_DMA2_LLP0_LLP22 (*((volatile unsigned int *)(0x42A68B60UL)))
#define bM4_DMA2_LLP0_LLP23 (*((volatile unsigned int *)(0x42A68B64UL)))
#define bM4_DMA2_LLP0_LLP24 (*((volatile unsigned int *)(0x42A68B68UL)))
#define bM4_DMA2_LLP0_LLP25 (*((volatile unsigned int *)(0x42A68B6CUL)))
#define bM4_DMA2_LLP0_LLP26 (*((volatile unsigned int *)(0x42A68B70UL)))
#define bM4_DMA2_LLP0_LLP27 (*((volatile unsigned int *)(0x42A68B74UL)))
#define bM4_DMA2_LLP0_LLP28 (*((volatile unsigned int *)(0x42A68B78UL)))
#define bM4_DMA2_LLP0_LLP29 (*((volatile unsigned int *)(0x42A68B7CUL)))
#define bM4_DMA2_CH0CTL_SINC0 (*((volatile unsigned int *)(0x42A68B80UL)))
#define bM4_DMA2_CH0CTL_SINC1 (*((volatile unsigned int *)(0x42A68B84UL)))
#define bM4_DMA2_CH0CTL_DINC0 (*((volatile unsigned int *)(0x42A68B88UL)))
#define bM4_DMA2_CH0CTL_DINC1 (*((volatile unsigned int *)(0x42A68B8CUL)))
#define bM4_DMA2_CH0CTL_SRTPEN (*((volatile unsigned int *)(0x42A68B90UL)))
#define bM4_DMA2_CH0CTL_DRPTEN (*((volatile unsigned int *)(0x42A68B94UL)))
#define bM4_DMA2_CH0CTL_SNSEQEN (*((volatile unsigned int *)(0x42A68B98UL)))
#define bM4_DMA2_CH0CTL_DNSEQEN (*((volatile unsigned int *)(0x42A68B9CUL)))
#define bM4_DMA2_CH0CTL_HSIZE0 (*((volatile unsigned int *)(0x42A68BA0UL)))
#define bM4_DMA2_CH0CTL_HSIZE1 (*((volatile unsigned int *)(0x42A68BA4UL)))
#define bM4_DMA2_CH0CTL_LLPEN (*((volatile unsigned int *)(0x42A68BA8UL)))
#define bM4_DMA2_CH0CTL_LLPRUN (*((volatile unsigned int *)(0x42A68BACUL)))
#define bM4_DMA2_CH0CTL_IE (*((volatile unsigned int *)(0x42A68BB0UL)))
#define bM4_DMA2_MONDTCTL0_BLKSIZE0 (*((volatile unsigned int *)(0x42A68D00UL)))
#define bM4_DMA2_MONDTCTL0_BLKSIZE1 (*((volatile unsigned int *)(0x42A68D04UL)))
#define bM4_DMA2_MONDTCTL0_BLKSIZE2 (*((volatile unsigned int *)(0x42A68D08UL)))
#define bM4_DMA2_MONDTCTL0_BLKSIZE3 (*((volatile unsigned int *)(0x42A68D0CUL)))
#define bM4_DMA2_MONDTCTL0_BLKSIZE4 (*((volatile unsigned int *)(0x42A68D10UL)))
#define bM4_DMA2_MONDTCTL0_BLKSIZE5 (*((volatile unsigned int *)(0x42A68D14UL)))
#define bM4_DMA2_MONDTCTL0_BLKSIZE6 (*((volatile unsigned int *)(0x42A68D18UL)))
#define bM4_DMA2_MONDTCTL0_BLKSIZE7 (*((volatile unsigned int *)(0x42A68D1CUL)))
#define bM4_DMA2_MONDTCTL0_BLKSIZE8 (*((volatile unsigned int *)(0x42A68D20UL)))
#define bM4_DMA2_MONDTCTL0_BLKSIZE9 (*((volatile unsigned int *)(0x42A68D24UL)))
#define bM4_DMA2_MONDTCTL0_CNT0 (*((volatile unsigned int *)(0x42A68D40UL)))
#define bM4_DMA2_MONDTCTL0_CNT1 (*((volatile unsigned int *)(0x42A68D44UL)))
#define bM4_DMA2_MONDTCTL0_CNT2 (*((volatile unsigned int *)(0x42A68D48UL)))
#define bM4_DMA2_MONDTCTL0_CNT3 (*((volatile unsigned int *)(0x42A68D4CUL)))
#define bM4_DMA2_MONDTCTL0_CNT4 (*((volatile unsigned int *)(0x42A68D50UL)))
#define bM4_DMA2_MONDTCTL0_CNT5 (*((volatile unsigned int *)(0x42A68D54UL)))
#define bM4_DMA2_MONDTCTL0_CNT6 (*((volatile unsigned int *)(0x42A68D58UL)))
#define bM4_DMA2_MONDTCTL0_CNT7 (*((volatile unsigned int *)(0x42A68D5CUL)))
#define bM4_DMA2_MONDTCTL0_CNT8 (*((volatile unsigned int *)(0x42A68D60UL)))
#define bM4_DMA2_MONDTCTL0_CNT9 (*((volatile unsigned int *)(0x42A68D64UL)))
#define bM4_DMA2_MONDTCTL0_CNT10 (*((volatile unsigned int *)(0x42A68D68UL)))
#define bM4_DMA2_MONDTCTL0_CNT11 (*((volatile unsigned int *)(0x42A68D6CUL)))
#define bM4_DMA2_MONDTCTL0_CNT12 (*((volatile unsigned int *)(0x42A68D70UL)))
#define bM4_DMA2_MONDTCTL0_CNT13 (*((volatile unsigned int *)(0x42A68D74UL)))
#define bM4_DMA2_MONDTCTL0_CNT14 (*((volatile unsigned int *)(0x42A68D78UL)))
#define bM4_DMA2_MONDTCTL0_CNT15 (*((volatile unsigned int *)(0x42A68D7CUL)))
#define bM4_DMA2_MONRPT0_SRPT0 (*((volatile unsigned int *)(0x42A68D80UL)))
#define bM4_DMA2_MONRPT0_SRPT1 (*((volatile unsigned int *)(0x42A68D84UL)))
#define bM4_DMA2_MONRPT0_SRPT2 (*((volatile unsigned int *)(0x42A68D88UL)))
#define bM4_DMA2_MONRPT0_SRPT3 (*((volatile unsigned int *)(0x42A68D8CUL)))
#define bM4_DMA2_MONRPT0_SRPT4 (*((volatile unsigned int *)(0x42A68D90UL)))
#define bM4_DMA2_MONRPT0_SRPT5 (*((volatile unsigned int *)(0x42A68D94UL)))
#define bM4_DMA2_MONRPT0_SRPT6 (*((volatile unsigned int *)(0x42A68D98UL)))
#define bM4_DMA2_MONRPT0_SRPT7 (*((volatile unsigned int *)(0x42A68D9CUL)))
#define bM4_DMA2_MONRPT0_SRPT8 (*((volatile unsigned int *)(0x42A68DA0UL)))
#define bM4_DMA2_MONRPT0_SRPT9 (*((volatile unsigned int *)(0x42A68DA4UL)))
#define bM4_DMA2_MONRPT0_DRPT0 (*((volatile unsigned int *)(0x42A68DC0UL)))
#define bM4_DMA2_MONRPT0_DRPT1 (*((volatile unsigned int *)(0x42A68DC4UL)))
#define bM4_DMA2_MONRPT0_DRPT2 (*((volatile unsigned int *)(0x42A68DC8UL)))
#define bM4_DMA2_MONRPT0_DRPT3 (*((volatile unsigned int *)(0x42A68DCCUL)))
#define bM4_DMA2_MONRPT0_DRPT4 (*((volatile unsigned int *)(0x42A68DD0UL)))
#define bM4_DMA2_MONRPT0_DRPT5 (*((volatile unsigned int *)(0x42A68DD4UL)))
#define bM4_DMA2_MONRPT0_DRPT6 (*((volatile unsigned int *)(0x42A68DD8UL)))
#define bM4_DMA2_MONRPT0_DRPT7 (*((volatile unsigned int *)(0x42A68DDCUL)))
#define bM4_DMA2_MONRPT0_DRPT8 (*((volatile unsigned int *)(0x42A68DE0UL)))
#define bM4_DMA2_MONRPT0_DRPT9 (*((volatile unsigned int *)(0x42A68DE4UL)))
#define bM4_DMA2_MONSNSEQCTL0_SOFFSET0 (*((volatile unsigned int *)(0x42A68E00UL)))
#define bM4_DMA2_MONSNSEQCTL0_SOFFSET1 (*((volatile unsigned int *)(0x42A68E04UL)))
#define bM4_DMA2_MONSNSEQCTL0_SOFFSET2 (*((volatile unsigned int *)(0x42A68E08UL)))
#define bM4_DMA2_MONSNSEQCTL0_SOFFSET3 (*((volatile unsigned int *)(0x42A68E0CUL)))
#define bM4_DMA2_MONSNSEQCTL0_SOFFSET4 (*((volatile unsigned int *)(0x42A68E10UL)))
#define bM4_DMA2_MONSNSEQCTL0_SOFFSET5 (*((volatile unsigned int *)(0x42A68E14UL)))
#define bM4_DMA2_MONSNSEQCTL0_SOFFSET6 (*((volatile unsigned int *)(0x42A68E18UL)))
#define bM4_DMA2_MONSNSEQCTL0_SOFFSET7 (*((volatile unsigned int *)(0x42A68E1CUL)))
#define bM4_DMA2_MONSNSEQCTL0_SOFFSET8 (*((volatile unsigned int *)(0x42A68E20UL)))
#define bM4_DMA2_MONSNSEQCTL0_SOFFSET9 (*((volatile unsigned int *)(0x42A68E24UL)))
#define bM4_DMA2_MONSNSEQCTL0_SOFFSET10 (*((volatile unsigned int *)(0x42A68E28UL)))
#define bM4_DMA2_MONSNSEQCTL0_SOFFSET11 (*((volatile unsigned int *)(0x42A68E2CUL)))
#define bM4_DMA2_MONSNSEQCTL0_SOFFSET12 (*((volatile unsigned int *)(0x42A68E30UL)))
#define bM4_DMA2_MONSNSEQCTL0_SOFFSET13 (*((volatile unsigned int *)(0x42A68E34UL)))
#define bM4_DMA2_MONSNSEQCTL0_SOFFSET14 (*((volatile unsigned int *)(0x42A68E38UL)))
#define bM4_DMA2_MONSNSEQCTL0_SOFFSET15 (*((volatile unsigned int *)(0x42A68E3CUL)))
#define bM4_DMA2_MONSNSEQCTL0_SOFFSET16 (*((volatile unsigned int *)(0x42A68E40UL)))
#define bM4_DMA2_MONSNSEQCTL0_SOFFSET17 (*((volatile unsigned int *)(0x42A68E44UL)))
#define bM4_DMA2_MONSNSEQCTL0_SOFFSET18 (*((volatile unsigned int *)(0x42A68E48UL)))
#define bM4_DMA2_MONSNSEQCTL0_SOFFSET19 (*((volatile unsigned int *)(0x42A68E4CUL)))
#define bM4_DMA2_MONSNSEQCTL0_SNSCNT0 (*((volatile unsigned int *)(0x42A68E50UL)))
#define bM4_DMA2_MONSNSEQCTL0_SNSCNT1 (*((volatile unsigned int *)(0x42A68E54UL)))
#define bM4_DMA2_MONSNSEQCTL0_SNSCNT2 (*((volatile unsigned int *)(0x42A68E58UL)))
#define bM4_DMA2_MONSNSEQCTL0_SNSCNT3 (*((volatile unsigned int *)(0x42A68E5CUL)))
#define bM4_DMA2_MONSNSEQCTL0_SNSCNT4 (*((volatile unsigned int *)(0x42A68E60UL)))
#define bM4_DMA2_MONSNSEQCTL0_SNSCNT5 (*((volatile unsigned int *)(0x42A68E64UL)))
#define bM4_DMA2_MONSNSEQCTL0_SNSCNT6 (*((volatile unsigned int *)(0x42A68E68UL)))
#define bM4_DMA2_MONSNSEQCTL0_SNSCNT7 (*((volatile unsigned int *)(0x42A68E6CUL)))
#define bM4_DMA2_MONSNSEQCTL0_SNSCNT8 (*((volatile unsigned int *)(0x42A68E70UL)))
#define bM4_DMA2_MONSNSEQCTL0_SNSCNT9 (*((volatile unsigned int *)(0x42A68E74UL)))
#define bM4_DMA2_MONSNSEQCTL0_SNSCNT10 (*((volatile unsigned int *)(0x42A68E78UL)))
#define bM4_DMA2_MONSNSEQCTL0_SNSCNT11 (*((volatile unsigned int *)(0x42A68E7CUL)))
#define bM4_DMA2_MONDNSEQCTL0_DOFFSET0 (*((volatile unsigned int *)(0x42A68E80UL)))
#define bM4_DMA2_MONDNSEQCTL0_DOFFSET1 (*((volatile unsigned int *)(0x42A68E84UL)))
#define bM4_DMA2_MONDNSEQCTL0_DOFFSET2 (*((volatile unsigned int *)(0x42A68E88UL)))
#define bM4_DMA2_MONDNSEQCTL0_DOFFSET3 (*((volatile unsigned int *)(0x42A68E8CUL)))
#define bM4_DMA2_MONDNSEQCTL0_DOFFSET4 (*((volatile unsigned int *)(0x42A68E90UL)))
#define bM4_DMA2_MONDNSEQCTL0_DOFFSET5 (*((volatile unsigned int *)(0x42A68E94UL)))
#define bM4_DMA2_MONDNSEQCTL0_DOFFSET6 (*((volatile unsigned int *)(0x42A68E98UL)))
#define bM4_DMA2_MONDNSEQCTL0_DOFFSET7 (*((volatile unsigned int *)(0x42A68E9CUL)))
#define bM4_DMA2_MONDNSEQCTL0_DOFFSET8 (*((volatile unsigned int *)(0x42A68EA0UL)))
#define bM4_DMA2_MONDNSEQCTL0_DOFFSET9 (*((volatile unsigned int *)(0x42A68EA4UL)))
#define bM4_DMA2_MONDNSEQCTL0_DOFFSET10 (*((volatile unsigned int *)(0x42A68EA8UL)))
#define bM4_DMA2_MONDNSEQCTL0_DOFFSET11 (*((volatile unsigned int *)(0x42A68EACUL)))
#define bM4_DMA2_MONDNSEQCTL0_DOFFSET12 (*((volatile unsigned int *)(0x42A68EB0UL)))
#define bM4_DMA2_MONDNSEQCTL0_DOFFSET13 (*((volatile unsigned int *)(0x42A68EB4UL)))
#define bM4_DMA2_MONDNSEQCTL0_DOFFSET14 (*((volatile unsigned int *)(0x42A68EB8UL)))
#define bM4_DMA2_MONDNSEQCTL0_DOFFSET15 (*((volatile unsigned int *)(0x42A68EBCUL)))
#define bM4_DMA2_MONDNSEQCTL0_DOFFSET16 (*((volatile unsigned int *)(0x42A68EC0UL)))
#define bM4_DMA2_MONDNSEQCTL0_DOFFSET17 (*((volatile unsigned int *)(0x42A68EC4UL)))
#define bM4_DMA2_MONDNSEQCTL0_DOFFSET18 (*((volatile unsigned int *)(0x42A68EC8UL)))
#define bM4_DMA2_MONDNSEQCTL0_DOFFSET19 (*((volatile unsigned int *)(0x42A68ECCUL)))
#define bM4_DMA2_MONDNSEQCTL0_DNSCNT0 (*((volatile unsigned int *)(0x42A68ED0UL)))
#define bM4_DMA2_MONDNSEQCTL0_DNSCNT1 (*((volatile unsigned int *)(0x42A68ED4UL)))
#define bM4_DMA2_MONDNSEQCTL0_DNSCNT2 (*((volatile unsigned int *)(0x42A68ED8UL)))
#define bM4_DMA2_MONDNSEQCTL0_DNSCNT3 (*((volatile unsigned int *)(0x42A68EDCUL)))
#define bM4_DMA2_MONDNSEQCTL0_DNSCNT4 (*((volatile unsigned int *)(0x42A68EE0UL)))
#define bM4_DMA2_MONDNSEQCTL0_DNSCNT5 (*((volatile unsigned int *)(0x42A68EE4UL)))
#define bM4_DMA2_MONDNSEQCTL0_DNSCNT6 (*((volatile unsigned int *)(0x42A68EE8UL)))
#define bM4_DMA2_MONDNSEQCTL0_DNSCNT7 (*((volatile unsigned int *)(0x42A68EECUL)))
#define bM4_DMA2_MONDNSEQCTL0_DNSCNT8 (*((volatile unsigned int *)(0x42A68EF0UL)))
#define bM4_DMA2_MONDNSEQCTL0_DNSCNT9 (*((volatile unsigned int *)(0x42A68EF4UL)))
#define bM4_DMA2_MONDNSEQCTL0_DNSCNT10 (*((volatile unsigned int *)(0x42A68EF8UL)))
#define bM4_DMA2_MONDNSEQCTL0_DNSCNT11 (*((volatile unsigned int *)(0x42A68EFCUL)))
#define bM4_DMA2_DTCTL1_BLKSIZE0 (*((volatile unsigned int *)(0x42A69100UL)))
#define bM4_DMA2_DTCTL1_BLKSIZE1 (*((volatile unsigned int *)(0x42A69104UL)))
#define bM4_DMA2_DTCTL1_BLKSIZE2 (*((volatile unsigned int *)(0x42A69108UL)))
#define bM4_DMA2_DTCTL1_BLKSIZE3 (*((volatile unsigned int *)(0x42A6910CUL)))
#define bM4_DMA2_DTCTL1_BLKSIZE4 (*((volatile unsigned int *)(0x42A69110UL)))
#define bM4_DMA2_DTCTL1_BLKSIZE5 (*((volatile unsigned int *)(0x42A69114UL)))
#define bM4_DMA2_DTCTL1_BLKSIZE6 (*((volatile unsigned int *)(0x42A69118UL)))
#define bM4_DMA2_DTCTL1_BLKSIZE7 (*((volatile unsigned int *)(0x42A6911CUL)))
#define bM4_DMA2_DTCTL1_BLKSIZE8 (*((volatile unsigned int *)(0x42A69120UL)))
#define bM4_DMA2_DTCTL1_BLKSIZE9 (*((volatile unsigned int *)(0x42A69124UL)))
#define bM4_DMA2_DTCTL1_CNT0 (*((volatile unsigned int *)(0x42A69140UL)))
