MarlinFirmware/Marlin/Marlin/lib/h32_core/main/hdsc32core/common/hc32f46x.h
#define bM4_DMA2_MONDNSEQCTL1_DOFFSET0 (*((volatile unsigned int *)(0x42A69680UL)))
#define bM4_DMA2_MONDNSEQCTL1_DOFFSET1 (*((volatile unsigned int *)(0x42A69684UL)))
#define bM4_DMA2_MONDNSEQCTL1_DOFFSET2 (*((volatile unsigned int *)(0x42A69688UL)))
#define bM4_DMA2_MONDNSEQCTL1_DOFFSET3 (*((volatile unsigned int *)(0x42A6968CUL)))
#define bM4_DMA2_MONDNSEQCTL1_DOFFSET4 (*((volatile unsigned int *)(0x42A69690UL)))
#define bM4_DMA2_MONDNSEQCTL1_DOFFSET5 (*((volatile unsigned int *)(0x42A69694UL)))
#define bM4_DMA2_MONDNSEQCTL1_DOFFSET6 (*((volatile unsigned int *)(0x42A69698UL)))
#define bM4_DMA2_MONDNSEQCTL1_DOFFSET7 (*((volatile unsigned int *)(0x42A6969CUL)))
#define bM4_DMA2_MONDNSEQCTL1_DOFFSET8 (*((volatile unsigned int *)(0x42A696A0UL)))
#define bM4_DMA2_MONDNSEQCTL1_DOFFSET9 (*((volatile unsigned int *)(0x42A696A4UL)))
#define bM4_DMA2_MONDNSEQCTL1_DOFFSET10 (*((volatile unsigned int *)(0x42A696A8UL)))
#define bM4_DMA2_MONDNSEQCTL1_DOFFSET11 (*((volatile unsigned int *)(0x42A696ACUL)))
#define bM4_DMA2_MONDNSEQCTL1_DOFFSET12 (*((volatile unsigned int *)(0x42A696B0UL)))
#define bM4_DMA2_MONDNSEQCTL1_DOFFSET13 (*((volatile unsigned int *)(0x42A696B4UL)))
#define bM4_DMA2_MONDNSEQCTL1_DOFFSET14 (*((volatile unsigned int *)(0x42A696B8UL)))
#define bM4_DMA2_MONDNSEQCTL1_DOFFSET15 (*((volatile unsigned int *)(0x42A696BCUL)))
#define bM4_DMA2_MONDNSEQCTL1_DOFFSET16 (*((volatile unsigned int *)(0x42A696C0UL)))
#define bM4_DMA2_MONDNSEQCTL1_DOFFSET17 (*((volatile unsigned int *)(0x42A696C4UL)))
#define bM4_DMA2_MONDNSEQCTL1_DOFFSET18 (*((volatile unsigned int *)(0x42A696C8UL)))
#define bM4_DMA2_MONDNSEQCTL1_DOFFSET19 (*((volatile unsigned int *)(0x42A696CCUL)))
#define bM4_DMA2_MONDNSEQCTL1_DNSCNT0 (*((volatile unsigned int *)(0x42A696D0UL)))
#define bM4_DMA2_MONDNSEQCTL1_DNSCNT1 (*((volatile unsigned int *)(0x42A696D4UL)))
#define bM4_DMA2_MONDNSEQCTL1_DNSCNT2 (*((volatile unsigned int *)(0x42A696D8UL)))
#define bM4_DMA2_MONDNSEQCTL1_DNSCNT3 (*((volatile unsigned int *)(0x42A696DCUL)))
#define bM4_DMA2_MONDNSEQCTL1_DNSCNT4 (*((volatile unsigned int *)(0x42A696E0UL)))
#define bM4_DMA2_MONDNSEQCTL1_DNSCNT5 (*((volatile unsigned int *)(0x42A696E4UL)))
#define bM4_DMA2_MONDNSEQCTL1_DNSCNT6 (*((volatile unsigned int *)(0x42A696E8UL)))
#define bM4_DMA2_MONDNSEQCTL1_DNSCNT7 (*((volatile unsigned int *)(0x42A696ECUL)))
#define bM4_DMA2_MONDNSEQCTL1_DNSCNT8 (*((volatile unsigned int *)(0x42A696F0UL)))
#define bM4_DMA2_MONDNSEQCTL1_DNSCNT9 (*((volatile unsigned int *)(0x42A696F4UL)))
#define bM4_DMA2_MONDNSEQCTL1_DNSCNT10 (*((volatile unsigned int *)(0x42A696F8UL)))
#define bM4_DMA2_MONDNSEQCTL1_DNSCNT11 (*((volatile unsigned int *)(0x42A696FCUL)))
#define bM4_DMA2_DTCTL2_BLKSIZE0 (*((volatile unsigned int *)(0x42A69900UL)))
#define bM4_DMA2_DTCTL2_BLKSIZE1 (*((volatile unsigned int *)(0x42A69904UL)))
#define bM4_DMA2_DTCTL2_BLKSIZE2 (*((volatile unsigned int *)(0x42A69908UL)))
#define bM4_DMA2_DTCTL2_BLKSIZE3 (*((volatile unsigned int *)(0x42A6990CUL)))
#define bM4_DMA2_DTCTL2_BLKSIZE4 (*((volatile unsigned int *)(0x42A69910UL)))
#define bM4_DMA2_DTCTL2_BLKSIZE5 (*((volatile unsigned int *)(0x42A69914UL)))
#define bM4_DMA2_DTCTL2_BLKSIZE6 (*((volatile unsigned int *)(0x42A69918UL)))
#define bM4_DMA2_DTCTL2_BLKSIZE7 (*((volatile unsigned int *)(0x42A6991CUL)))
#define bM4_DMA2_DTCTL2_BLKSIZE8 (*((volatile unsigned int *)(0x42A69920UL)))
#define bM4_DMA2_DTCTL2_BLKSIZE9 (*((volatile unsigned int *)(0x42A69924UL)))
#define bM4_DMA2_DTCTL2_CNT0 (*((volatile unsigned int *)(0x42A69940UL)))
#define bM4_DMA2_DTCTL2_CNT1 (*((volatile unsigned int *)(0x42A69944UL)))
#define bM4_DMA2_DTCTL2_CNT2 (*((volatile unsigned int *)(0x42A69948UL)))
#define bM4_DMA2_DTCTL2_CNT3 (*((volatile unsigned int *)(0x42A6994CUL)))
#define bM4_DMA2_DTCTL2_CNT4 (*((volatile unsigned int *)(0x42A69950UL)))
#define bM4_DMA2_DTCTL2_CNT5 (*((volatile unsigned int *)(0x42A69954UL)))
#define bM4_DMA2_DTCTL2_CNT6 (*((volatile unsigned int *)(0x42A69958UL)))
#define bM4_DMA2_DTCTL2_CNT7 (*((volatile unsigned int *)(0x42A6995CUL)))
#define bM4_DMA2_DTCTL2_CNT8 (*((volatile unsigned int *)(0x42A69960UL)))
#define bM4_DMA2_DTCTL2_CNT9 (*((volatile unsigned int *)(0x42A69964UL)))
#define bM4_DMA2_DTCTL2_CNT10 (*((volatile unsigned int *)(0x42A69968UL)))
#define bM4_DMA2_DTCTL2_CNT11 (*((volatile unsigned int *)(0x42A6996CUL)))
#define bM4_DMA2_DTCTL2_CNT12 (*((volatile unsigned int *)(0x42A69970UL)))
#define bM4_DMA2_DTCTL2_CNT13 (*((volatile unsigned int *)(0x42A69974UL)))
#define bM4_DMA2_DTCTL2_CNT14 (*((volatile unsigned int *)(0x42A69978UL)))
#define bM4_DMA2_DTCTL2_CNT15 (*((volatile unsigned int *)(0x42A6997CUL)))
#define bM4_DMA2_RPT2_SRPT0 (*((volatile unsigned int *)(0x42A69980UL)))
#define bM4_DMA2_RPT2_SRPT1 (*((volatile unsigned int *)(0x42A69984UL)))
#define bM4_DMA2_RPT2_SRPT2 (*((volatile unsigned int *)(0x42A69988UL)))
#define bM4_DMA2_RPT2_SRPT3 (*((volatile unsigned int *)(0x42A6998CUL)))
#define bM4_DMA2_RPT2_SRPT4 (*((volatile unsigned int *)(0x42A69990UL)))
#define bM4_DMA2_RPT2_SRPT5 (*((volatile unsigned int *)(0x42A69994UL)))
#define bM4_DMA2_RPT2_SRPT6 (*((volatile unsigned int *)(0x42A69998UL)))
#define bM4_DMA2_RPT2_SRPT7 (*((volatile unsigned int *)(0x42A6999CUL)))
#define bM4_DMA2_RPT2_SRPT8 (*((volatile unsigned int *)(0x42A699A0UL)))
#define bM4_DMA2_RPT2_SRPT9 (*((volatile unsigned int *)(0x42A699A4UL)))
#define bM4_DMA2_RPT2_DRPT0 (*((volatile unsigned int *)(0x42A699C0UL)))
#define bM4_DMA2_RPT2_DRPT1 (*((volatile unsigned int *)(0x42A699C4UL)))
#define bM4_DMA2_RPT2_DRPT2 (*((volatile unsigned int *)(0x42A699C8UL)))
#define bM4_DMA2_RPT2_DRPT3 (*((volatile unsigned int *)(0x42A699CCUL)))
#define bM4_DMA2_RPT2_DRPT4 (*((volatile unsigned int *)(0x42A699D0UL)))
#define bM4_DMA2_RPT2_DRPT5 (*((volatile unsigned int *)(0x42A699D4UL)))
#define bM4_DMA2_RPT2_DRPT6 (*((volatile unsigned int *)(0x42A699D8UL)))
#define bM4_DMA2_RPT2_DRPT7 (*((volatile unsigned int *)(0x42A699DCUL)))
#define bM4_DMA2_RPT2_DRPT8 (*((volatile unsigned int *)(0x42A699E0UL)))
#define bM4_DMA2_RPT2_DRPT9 (*((volatile unsigned int *)(0x42A699E4UL)))
#define bM4_DMA2_RPTB2_SRPTB0 (*((volatile unsigned int *)(0x42A69980UL)))
#define bM4_DMA2_RPTB2_SRPTB1 (*((volatile unsigned int *)(0x42A69984UL)))
#define bM4_DMA2_RPTB2_SRPTB2 (*((volatile unsigned int *)(0x42A69988UL)))
#define bM4_DMA2_RPTB2_SRPTB3 (*((volatile unsigned int *)(0x42A6998CUL)))
#define bM4_DMA2_RPTB2_SRPTB4 (*((volatile unsigned int *)(0x42A69990UL)))
#define bM4_DMA2_RPTB2_SRPTB5 (*((volatile unsigned int *)(0x42A69994UL)))
#define bM4_DMA2_RPTB2_SRPTB6 (*((volatile unsigned int *)(0x42A69998UL)))
#define bM4_DMA2_RPTB2_SRPTB7 (*((volatile unsigned int *)(0x42A6999CUL)))
#define bM4_DMA2_RPTB2_SRPTB8 (*((volatile unsigned int *)(0x42A699A0UL)))
#define bM4_DMA2_RPTB2_SRPTB9 (*((volatile unsigned int *)(0x42A699A4UL)))
#define bM4_DMA2_RPTB2_DRPTB0 (*((volatile unsigned int *)(0x42A699C0UL)))
#define bM4_DMA2_RPTB2_DRPTB1 (*((volatile unsigned int *)(0x42A699C4UL)))
#define bM4_DMA2_RPTB2_DRPTB2 (*((volatile unsigned int *)(0x42A699C8UL)))
#define bM4_DMA2_RPTB2_DRPTB3 (*((volatile unsigned int *)(0x42A699CCUL)))
#define bM4_DMA2_RPTB2_DRPTB4 (*((volatile unsigned int *)(0x42A699D0UL)))
#define bM4_DMA2_RPTB2_DRPTB5 (*((volatile unsigned int *)(0x42A699D4UL)))
#define bM4_DMA2_RPTB2_DRPTB6 (*((volatile unsigned int *)(0x42A699D8UL)))
#define bM4_DMA2_RPTB2_DRPTB7 (*((volatile unsigned int *)(0x42A699DCUL)))
#define bM4_DMA2_RPTB2_DRPTB8 (*((volatile unsigned int *)(0x42A699E0UL)))
#define bM4_DMA2_RPTB2_DRPTB9 (*((volatile unsigned int *)(0x42A699E4UL)))
#define bM4_DMA2_SNSEQCTL2_SOFFSET0 (*((volatile unsigned int *)(0x42A69A00UL)))
#define bM4_DMA2_SNSEQCTL2_SOFFSET1 (*((volatile unsigned int *)(0x42A69A04UL)))
#define bM4_DMA2_SNSEQCTL2_SOFFSET2 (*((volatile unsigned int *)(0x42A69A08UL)))
#define bM4_DMA2_SNSEQCTL2_SOFFSET3 (*((volatile unsigned int *)(0x42A69A0CUL)))
#define bM4_DMA2_SNSEQCTL2_SOFFSET4 (*((volatile unsigned int *)(0x42A69A10UL)))
#define bM4_DMA2_SNSEQCTL2_SOFFSET5 (*((volatile unsigned int *)(0x42A69A14UL)))
#define bM4_DMA2_SNSEQCTL2_SOFFSET6 (*((volatile unsigned int *)(0x42A69A18UL)))
#define bM4_DMA2_SNSEQCTL2_SOFFSET7 (*((volatile unsigned int *)(0x42A69A1CUL)))
#define bM4_DMA2_SNSEQCTL2_SOFFSET8 (*((volatile unsigned int *)(0x42A69A20UL)))
#define bM4_DMA2_SNSEQCTL2_SOFFSET9 (*((volatile unsigned int *)(0x42A69A24UL)))
#define bM4_DMA2_SNSEQCTL2_SOFFSET10 (*((volatile unsigned int *)(0x42A69A28UL)))
#define bM4_DMA2_SNSEQCTL2_SOFFSET11 (*((volatile unsigned int *)(0x42A69A2CUL)))
#define bM4_DMA2_SNSEQCTL2_SOFFSET12 (*((volatile unsigned int *)(0x42A69A30UL)))
#define bM4_DMA2_SNSEQCTL2_SOFFSET13 (*((volatile unsigned int *)(0x42A69A34UL)))
#define bM4_DMA2_SNSEQCTL2_SOFFSET14 (*((volatile unsigned int *)(0x42A69A38UL)))
#define bM4_DMA2_SNSEQCTL2_SOFFSET15 (*((volatile unsigned int *)(0x42A69A3CUL)))
#define bM4_DMA2_SNSEQCTL2_SOFFSET16 (*((volatile unsigned int *)(0x42A69A40UL)))
#define bM4_DMA2_SNSEQCTL2_SOFFSET17 (*((volatile unsigned int *)(0x42A69A44UL)))
#define bM4_DMA2_SNSEQCTL2_SOFFSET18 (*((volatile unsigned int *)(0x42A69A48UL)))
#define bM4_DMA2_SNSEQCTL2_SOFFSET19 (*((volatile unsigned int *)(0x42A69A4CUL)))
#define bM4_DMA2_SNSEQCTL2_SNSCNT0 (*((volatile unsigned int *)(0x42A69A50UL)))
#define bM4_DMA2_SNSEQCTL2_SNSCNT1 (*((volatile unsigned int *)(0x42A69A54UL)))
#define bM4_DMA2_SNSEQCTL2_SNSCNT2 (*((volatile unsigned int *)(0x42A69A58UL)))
#define bM4_DMA2_SNSEQCTL2_SNSCNT3 (*((volatile unsigned int *)(0x42A69A5CUL)))
#define bM4_DMA2_SNSEQCTL2_SNSCNT4 (*((volatile unsigned int *)(0x42A69A60UL)))
#define bM4_DMA2_SNSEQCTL2_SNSCNT5 (*((volatile unsigned int *)(0x42A69A64UL)))
#define bM4_DMA2_SNSEQCTL2_SNSCNT6 (*((volatile unsigned int *)(0x42A69A68UL)))
#define bM4_DMA2_SNSEQCTL2_SNSCNT7 (*((volatile unsigned int *)(0x42A69A6CUL)))
#define bM4_DMA2_SNSEQCTL2_SNSCNT8 (*((volatile unsigned int *)(0x42A69A70UL)))
#define bM4_DMA2_SNSEQCTL2_SNSCNT9 (*((volatile unsigned int *)(0x42A69A74UL)))
#define bM4_DMA2_SNSEQCTL2_SNSCNT10 (*((volatile unsigned int *)(0x42A69A78UL)))
#define bM4_DMA2_SNSEQCTL2_SNSCNT11 (*((volatile unsigned int *)(0x42A69A7CUL)))
#define bM4_DMA2_SNSEQCTLB2_SNSDIST0 (*((volatile unsigned int *)(0x42A69A00UL)))
#define bM4_DMA2_SNSEQCTLB2_SNSDIST1 (*((volatile unsigned int *)(0x42A69A04UL)))
#define bM4_DMA2_SNSEQCTLB2_SNSDIST2 (*((volatile unsigned int *)(0x42A69A08UL)))
#define bM4_DMA2_SNSEQCTLB2_SNSDIST3 (*((volatile unsigned int *)(0x42A69A0CUL)))
#define bM4_DMA2_SNSEQCTLB2_SNSDIST4 (*((volatile unsigned int *)(0x42A69A10UL)))
#define bM4_DMA2_SNSEQCTLB2_SNSDIST5 (*((volatile unsigned int *)(0x42A69A14UL)))
#define bM4_DMA2_SNSEQCTLB2_SNSDIST6 (*((volatile unsigned int *)(0x42A69A18UL)))
#define bM4_DMA2_SNSEQCTLB2_SNSDIST7 (*((volatile unsigned int *)(0x42A69A1CUL)))
#define bM4_DMA2_SNSEQCTLB2_SNSDIST8 (*((volatile unsigned int *)(0x42A69A20UL)))
#define bM4_DMA2_SNSEQCTLB2_SNSDIST9 (*((volatile unsigned int *)(0x42A69A24UL)))
#define bM4_DMA2_SNSEQCTLB2_SNSDIST10 (*((volatile unsigned int *)(0x42A69A28UL)))
#define bM4_DMA2_SNSEQCTLB2_SNSDIST11 (*((volatile unsigned int *)(0x42A69A2CUL)))
#define bM4_DMA2_SNSEQCTLB2_SNSDIST12 (*((volatile unsigned int *)(0x42A69A30UL)))
#define bM4_DMA2_SNSEQCTLB2_SNSDIST13 (*((volatile unsigned int *)(0x42A69A34UL)))
#define bM4_DMA2_SNSEQCTLB2_SNSDIST14 (*((volatile unsigned int *)(0x42A69A38UL)))
#define bM4_DMA2_SNSEQCTLB2_SNSDIST15 (*((volatile unsigned int *)(0x42A69A3CUL)))
#define bM4_DMA2_SNSEQCTLB2_SNSDIST16 (*((volatile unsigned int *)(0x42A69A40UL)))
#define bM4_DMA2_SNSEQCTLB2_SNSDIST17 (*((volatile unsigned int *)(0x42A69A44UL)))
#define bM4_DMA2_SNSEQCTLB2_SNSDIST18 (*((volatile unsigned int *)(0x42A69A48UL)))
#define bM4_DMA2_SNSEQCTLB2_SNSDIST19 (*((volatile unsigned int *)(0x42A69A4CUL)))
#define bM4_DMA2_SNSEQCTLB2_SNSCNTB0 (*((volatile unsigned int *)(0x42A69A50UL)))
#define bM4_DMA2_SNSEQCTLB2_SNSCNTB1 (*((volatile unsigned int *)(0x42A69A54UL)))
#define bM4_DMA2_SNSEQCTLB2_SNSCNTB2 (*((volatile unsigned int *)(0x42A69A58UL)))
#define bM4_DMA2_SNSEQCTLB2_SNSCNTB3 (*((volatile unsigned int *)(0x42A69A5CUL)))
#define bM4_DMA2_SNSEQCTLB2_SNSCNTB4 (*((volatile unsigned int *)(0x42A69A60UL)))
#define bM4_DMA2_SNSEQCTLB2_SNSCNTB5 (*((volatile unsigned int *)(0x42A69A64UL)))
#define bM4_DMA2_SNSEQCTLB2_SNSCNTB6 (*((volatile unsigned int *)(0x42A69A68UL)))
#define bM4_DMA2_SNSEQCTLB2_SNSCNTB7 (*((volatile unsigned int *)(0x42A69A6CUL)))
#define bM4_DMA2_SNSEQCTLB2_SNSCNTB8 (*((volatile unsigned int *)(0x42A69A70UL)))
#define bM4_DMA2_SNSEQCTLB2_SNSCNTB9 (*((volatile unsigned int *)(0x42A69A74UL)))
#define bM4_DMA2_SNSEQCTLB2_SNSCNTB10 (*((volatile unsigned int *)(0x42A69A78UL)))
#define bM4_DMA2_SNSEQCTLB2_SNSCNTB11 (*((volatile unsigned int *)(0x42A69A7CUL)))
#define bM4_DMA2_DNSEQCTL2_DOFFSET0 (*((volatile unsigned int *)(0x42A69A80UL)))
#define bM4_DMA2_DNSEQCTL2_DOFFSET1 (*((volatile unsigned int *)(0x42A69A84UL)))
#define bM4_DMA2_DNSEQCTL2_DOFFSET2 (*((volatile unsigned int *)(0x42A69A88UL)))
#define bM4_DMA2_DNSEQCTL2_DOFFSET3 (*((volatile unsigned int *)(0x42A69A8CUL)))
#define bM4_DMA2_DNSEQCTL2_DOFFSET4 (*((volatile unsigned int *)(0x42A69A90UL)))
#define bM4_DMA2_DNSEQCTL2_DOFFSET5 (*((volatile unsigned int *)(0x42A69A94UL)))
#define bM4_DMA2_DNSEQCTL2_DOFFSET6 (*((volatile unsigned int *)(0x42A69A98UL)))
#define bM4_DMA2_DNSEQCTL2_DOFFSET7 (*((volatile unsigned int *)(0x42A69A9CUL)))
#define bM4_DMA2_DNSEQCTL2_DOFFSET8 (*((volatile unsigned int *)(0x42A69AA0UL)))
#define bM4_DMA2_DNSEQCTL2_DOFFSET9 (*((volatile unsigned int *)(0x42A69AA4UL)))
#define bM4_DMA2_DNSEQCTL2_DOFFSET10 (*((volatile unsigned int *)(0x42A69AA8UL)))
#define bM4_DMA2_DNSEQCTL2_DOFFSET11 (*((volatile unsigned int *)(0x42A69AACUL)))
#define bM4_DMA2_DNSEQCTL2_DOFFSET12 (*((volatile unsigned int *)(0x42A69AB0UL)))
#define bM4_DMA2_DNSEQCTL2_DOFFSET13 (*((volatile unsigned int *)(0x42A69AB4UL)))
#define bM4_DMA2_DNSEQCTL2_DOFFSET14 (*((volatile unsigned int *)(0x42A69AB8UL)))
#define bM4_DMA2_DNSEQCTL2_DOFFSET15 (*((volatile unsigned int *)(0x42A69ABCUL)))
#define bM4_DMA2_DNSEQCTL2_DOFFSET16 (*((volatile unsigned int *)(0x42A69AC0UL)))
#define bM4_DMA2_DNSEQCTL2_DOFFSET17 (*((volatile unsigned int *)(0x42A69AC4UL)))
#define bM4_DMA2_DNSEQCTL2_DOFFSET18 (*((volatile unsigned int *)(0x42A69AC8UL)))
#define bM4_DMA2_DNSEQCTL2_DOFFSET19 (*((volatile unsigned int *)(0x42A69ACCUL)))
#define bM4_DMA2_DNSEQCTL2_DNSCNT0 (*((volatile unsigned int *)(0x42A69AD0UL)))
#define bM4_DMA2_DNSEQCTL2_DNSCNT1 (*((volatile unsigned int *)(0x42A69AD4UL)))
#define bM4_DMA2_DNSEQCTL2_DNSCNT2 (*((volatile unsigned int *)(0x42A69AD8UL)))
#define bM4_DMA2_DNSEQCTL2_DNSCNT3 (*((volatile unsigned int *)(0x42A69ADCUL)))
#define bM4_DMA2_DNSEQCTL2_DNSCNT4 (*((volatile unsigned int *)(0x42A69AE0UL)))
#define bM4_DMA2_DNSEQCTL2_DNSCNT5 (*((volatile unsigned int *)(0x42A69AE4UL)))
#define bM4_DMA2_DNSEQCTL2_DNSCNT6 (*((volatile unsigned int *)(0x42A69AE8UL)))
#define bM4_DMA2_DNSEQCTL2_DNSCNT7 (*((volatile unsigned int *)(0x42A69AECUL)))
#define bM4_DMA2_DNSEQCTL2_DNSCNT8 (*((volatile unsigned int *)(0x42A69AF0UL)))
#define bM4_DMA2_DNSEQCTL2_DNSCNT9 (*((volatile unsigned int *)(0x42A69AF4UL)))
#define bM4_DMA2_DNSEQCTL2_DNSCNT10 (*((volatile unsigned int *)(0x42A69AF8UL)))
#define bM4_DMA2_DNSEQCTL2_DNSCNT11 (*((volatile unsigned int *)(0x42A69AFCUL)))
#define bM4_DMA2_DNSEQCTLB2_DNSDIST0 (*((volatile unsigned int *)(0x42A69A80UL)))
#define bM4_DMA2_DNSEQCTLB2_DNSDIST1 (*((volatile unsigned int *)(0x42A69A84UL)))
#define bM4_DMA2_DNSEQCTLB2_DNSDIST2 (*((volatile unsigned int *)(0x42A69A88UL)))
#define bM4_DMA2_DNSEQCTLB2_DNSDIST3 (*((volatile unsigned int *)(0x42A69A8CUL)))
#define bM4_DMA2_DNSEQCTLB2_DNSDIST4 (*((volatile unsigned int *)(0x42A69A90UL)))
#define bM4_DMA2_DNSEQCTLB2_DNSDIST5 (*((volatile unsigned int *)(0x42A69A94UL)))
#define bM4_DMA2_DNSEQCTLB2_DNSDIST6 (*((volatile unsigned int *)(0x42A69A98UL)))
#define bM4_DMA2_DNSEQCTLB2_DNSDIST7 (*((volatile unsigned int *)(0x42A69A9CUL)))
#define bM4_DMA2_DNSEQCTLB2_DNSDIST8 (*((volatile unsigned int *)(0x42A69AA0UL)))
#define bM4_DMA2_DNSEQCTLB2_DNSDIST9 (*((volatile unsigned int *)(0x42A69AA4UL)))
#define bM4_DMA2_DNSEQCTLB2_DNSDIST10 (*((volatile unsigned int *)(0x42A69AA8UL)))
#define bM4_DMA2_DNSEQCTLB2_DNSDIST11 (*((volatile unsigned int *)(0x42A69AACUL)))
#define bM4_DMA2_DNSEQCTLB2_DNSDIST12 (*((volatile unsigned int *)(0x42A69AB0UL)))
#define bM4_DMA2_DNSEQCTLB2_DNSDIST13 (*((volatile unsigned int *)(0x42A69AB4UL)))
#define bM4_DMA2_DNSEQCTLB2_DNSDIST14 (*((volatile unsigned int *)(0x42A69AB8UL)))
#define bM4_DMA2_DNSEQCTLB2_DNSDIST15 (*((volatile unsigned int *)(0x42A69ABCUL)))
#define bM4_DMA2_DNSEQCTLB2_DNSDIST16 (*((volatile unsigned int *)(0x42A69AC0UL)))
#define bM4_DMA2_DNSEQCTLB2_DNSDIST17 (*((volatile unsigned int *)(0x42A69AC4UL)))
#define bM4_DMA2_DNSEQCTLB2_DNSDIST18 (*((volatile unsigned int *)(0x42A69AC8UL)))
#define bM4_DMA2_DNSEQCTLB2_DNSDIST19 (*((volatile unsigned int *)(0x42A69ACCUL)))
#define bM4_DMA2_DNSEQCTLB2_DNSCNTB0 (*((volatile unsigned int *)(0x42A69AD0UL)))
#define bM4_DMA2_DNSEQCTLB2_DNSCNTB1 (*((volatile unsigned int *)(0x42A69AD4UL)))
#define bM4_DMA2_DNSEQCTLB2_DNSCNTB2 (*((volatile unsigned int *)(0x42A69AD8UL)))
#define bM4_DMA2_DNSEQCTLB2_DNSCNTB3 (*((volatile unsigned int *)(0x42A69ADCUL)))
#define bM4_DMA2_DNSEQCTLB2_DNSCNTB4 (*((volatile unsigned int *)(0x42A69AE0UL)))
#define bM4_DMA2_DNSEQCTLB2_DNSCNTB5 (*((volatile unsigned int *)(0x42A69AE4UL)))
#define bM4_DMA2_DNSEQCTLB2_DNSCNTB6 (*((volatile unsigned int *)(0x42A69AE8UL)))
#define bM4_DMA2_DNSEQCTLB2_DNSCNTB7 (*((volatile unsigned int *)(0x42A69AECUL)))
#define bM4_DMA2_DNSEQCTLB2_DNSCNTB8 (*((volatile unsigned int *)(0x42A69AF0UL)))
#define bM4_DMA2_DNSEQCTLB2_DNSCNTB9 (*((volatile unsigned int *)(0x42A69AF4UL)))
#define bM4_DMA2_DNSEQCTLB2_DNSCNTB10 (*((volatile unsigned int *)(0x42A69AF8UL)))
#define bM4_DMA2_DNSEQCTLB2_DNSCNTB11 (*((volatile unsigned int *)(0x42A69AFCUL)))
#define bM4_DMA2_LLP2_LLP0 (*((volatile unsigned int *)(0x42A69B08UL)))
#define bM4_DMA2_LLP2_LLP1 (*((volatile unsigned int *)(0x42A69B0CUL)))
#define bM4_DMA2_LLP2_LLP2 (*((volatile unsigned int *)(0x42A69B10UL)))
#define bM4_DMA2_LLP2_LLP3 (*((volatile unsigned int *)(0x42A69B14UL)))
#define bM4_DMA2_LLP2_LLP4 (*((volatile unsigned int *)(0x42A69B18UL)))
#define bM4_DMA2_LLP2_LLP5 (*((volatile unsigned int *)(0x42A69B1CUL)))
#define bM4_DMA2_LLP2_LLP6 (*((volatile unsigned int *)(0x42A69B20UL)))
#define bM4_DMA2_LLP2_LLP7 (*((volatile unsigned int *)(0x42A69B24UL)))
#define bM4_DMA2_LLP2_LLP8 (*((volatile unsigned int *)(0x42A69B28UL)))
#define bM4_DMA2_LLP2_LLP9 (*((volatile unsigned int *)(0x42A69B2CUL)))
#define bM4_DMA2_LLP2_LLP10 (*((volatile unsigned int *)(0x42A69B30UL)))
#define bM4_DMA2_LLP2_LLP11 (*((volatile unsigned int *)(0x42A69B34UL)))
#define bM4_DMA2_LLP2_LLP12 (*((volatile unsigned int *)(0x42A69B38UL)))
#define bM4_DMA2_LLP2_LLP13 (*((volatile unsigned int *)(0x42A69B3CUL)))
#define bM4_DMA2_LLP2_LLP14 (*((volatile unsigned int *)(0x42A69B40UL)))
#define bM4_DMA2_LLP2_LLP15 (*((volatile unsigned int *)(0x42A69B44UL)))
#define bM4_DMA2_LLP2_LLP16 (*((volatile unsigned int *)(0x42A69B48UL)))
#define bM4_DMA2_LLP2_LLP17 (*((volatile unsigned int *)(0x42A69B4CUL)))
#define bM4_DMA2_LLP2_LLP18 (*((volatile unsigned int *)(0x42A69B50UL)))
#define bM4_DMA2_LLP2_LLP19 (*((volatile unsigned int *)(0x42A69B54UL)))
#define bM4_DMA2_LLP2_LLP20 (*((volatile unsigned int *)(0x42A69B58UL)))
#define bM4_DMA2_LLP2_LLP21 (*((volatile unsigned int *)(0x42A69B5CUL)))
#define bM4_DMA2_LLP2_LLP22 (*((volatile unsigned int *)(0x42A69B60UL)))
#define bM4_DMA2_LLP2_LLP23 (*((volatile unsigned int *)(0x42A69B64UL)))
#define bM4_DMA2_LLP2_LLP24 (*((volatile unsigned int *)(0x42A69B68UL)))
#define bM4_DMA2_LLP2_LLP25 (*((volatile unsigned int *)(0x42A69B6CUL)))
#define bM4_DMA2_LLP2_LLP26 (*((volatile unsigned int *)(0x42A69B70UL)))
#define bM4_DMA2_LLP2_LLP27 (*((volatile unsigned int *)(0x42A69B74UL)))
#define bM4_DMA2_LLP2_LLP28 (*((volatile unsigned int *)(0x42A69B78UL)))
#define bM4_DMA2_LLP2_LLP29 (*((volatile unsigned int *)(0x42A69B7CUL)))
#define bM4_DMA2_CH2CTL_SINC0 (*((volatile unsigned int *)(0x42A69B80UL)))
#define bM4_DMA2_CH2CTL_SINC1 (*((volatile unsigned int *)(0x42A69B84UL)))
#define bM4_DMA2_CH2CTL_DINC0 (*((volatile unsigned int *)(0x42A69B88UL)))
#define bM4_DMA2_CH2CTL_DINC1 (*((volatile unsigned int *)(0x42A69B8CUL)))
#define bM4_DMA2_CH2CTL_SRTPEN (*((volatile unsigned int *)(0x42A69B90UL)))
#define bM4_DMA2_CH2CTL_DRPTEN (*((volatile unsigned int *)(0x42A69B94UL)))
#define bM4_DMA2_CH2CTL_SNSEQEN (*((volatile unsigned int *)(0x42A69B98UL)))
#define bM4_DMA2_CH2CTL_DNSEQEN (*((volatile unsigned int *)(0x42A69B9CUL)))
#define bM4_DMA2_CH2CTL_HSIZE0 (*((volatile unsigned int *)(0x42A69BA0UL)))
#define bM4_DMA2_CH2CTL_HSIZE1 (*((volatile unsigned int *)(0x42A69BA4UL)))
#define bM4_DMA2_CH2CTL_LLPEN (*((volatile unsigned int *)(0x42A69BA8UL)))
#define bM4_DMA2_CH2CTL_LLPRUN (*((volatile unsigned int *)(0x42A69BACUL)))
#define bM4_DMA2_CH2CTL_IE (*((volatile unsigned int *)(0x42A69BB0UL)))
#define bM4_DMA2_MONDTCTL2_BLKSIZE0 (*((volatile unsigned int *)(0x42A69D00UL)))
#define bM4_DMA2_MONDTCTL2_BLKSIZE1 (*((volatile unsigned int *)(0x42A69D04UL)))
#define bM4_DMA2_MONDTCTL2_BLKSIZE2 (*((volatile unsigned int *)(0x42A69D08UL)))
#define bM4_DMA2_MONDTCTL2_BLKSIZE3 (*((volatile unsigned int *)(0x42A69D0CUL)))
#define bM4_DMA2_MONDTCTL2_BLKSIZE4 (*((volatile unsigned int *)(0x42A69D10UL)))
#define bM4_DMA2_MONDTCTL2_BLKSIZE5 (*((volatile unsigned int *)(0x42A69D14UL)))
#define bM4_DMA2_MONDTCTL2_BLKSIZE6 (*((volatile unsigned int *)(0x42A69D18UL)))
#define bM4_DMA2_MONDTCTL2_BLKSIZE7 (*((volatile unsigned int *)(0x42A69D1CUL)))
#define bM4_DMA2_MONDTCTL2_BLKSIZE8 (*((volatile unsigned int *)(0x42A69D20UL)))
#define bM4_DMA2_MONDTCTL2_BLKSIZE9 (*((volatile unsigned int *)(0x42A69D24UL)))
#define bM4_DMA2_MONDTCTL2_CNT0 (*((volatile unsigned int *)(0x42A69D40UL)))
#define bM4_DMA2_MONDTCTL2_CNT1 (*((volatile unsigned int *)(0x42A69D44UL)))
#define bM4_DMA2_MONDTCTL2_CNT2 (*((volatile unsigned int *)(0x42A69D48UL)))
#define bM4_DMA2_MONDTCTL2_CNT3 (*((volatile unsigned int *)(0x42A69D4CUL)))
#define bM4_DMA2_MONDTCTL2_CNT4 (*((volatile unsigned int *)(0x42A69D50UL)))
#define bM4_DMA2_MONDTCTL2_CNT5 (*((volatile unsigned int *)(0x42A69D54UL)))
#define bM4_DMA2_MONDTCTL2_CNT6 (*((volatile unsigned int *)(0x42A69D58UL)))
#define bM4_DMA2_MONDTCTL2_CNT7 (*((volatile unsigned int *)(0x42A69D5CUL)))
#define bM4_DMA2_MONDTCTL2_CNT8 (*((volatile unsigned int *)(0x42A69D60UL)))
#define bM4_DMA2_MONDTCTL2_CNT9 (*((volatile unsigned int *)(0x42A69D64UL)))
#define bM4_DMA2_MONDTCTL2_CNT10 (*((volatile unsigned int *)(0x42A69D68UL)))
#define bM4_DMA2_MONDTCTL2_CNT11 (*((volatile unsigned int *)(0x42A69D6CUL)))
#define bM4_DMA2_MONDTCTL2_CNT12 (*((volatile unsigned int *)(0x42A69D70UL)))
#define bM4_DMA2_MONDTCTL2_CNT13 (*((volatile unsigned int *)(0x42A69D74UL)))
#define bM4_DMA2_MONDTCTL2_CNT14 (*((volatile unsigned int *)(0x42A69D78UL)))
#define bM4_DMA2_MONDTCTL2_CNT15 (*((volatile unsigned int *)(0x42A69D7CUL)))
#define bM4_DMA2_MONRPT2_SRPT0 (*((volatile unsigned int *)(0x42A69D80UL)))
#define bM4_DMA2_MONRPT2_SRPT1 (*((volatile unsigned int *)(0x42A69D84UL)))
#define bM4_DMA2_MONRPT2_SRPT2 (*((volatile unsigned int *)(0x42A69D88UL)))
#define bM4_DMA2_MONRPT2_SRPT3 (*((volatile unsigned int *)(0x42A69D8CUL)))
#define bM4_DMA2_MONRPT2_SRPT4 (*((volatile unsigned int *)(0x42A69D90UL)))
#define bM4_DMA2_MONRPT2_SRPT5 (*((volatile unsigned int *)(0x42A69D94UL)))
#define bM4_DMA2_MONRPT2_SRPT6 (*((volatile unsigned int *)(0x42A69D98UL)))
#define bM4_DMA2_MONRPT2_SRPT7 (*((volatile unsigned int *)(0x42A69D9CUL)))
#define bM4_DMA2_MONRPT2_SRPT8 (*((volatile unsigned int *)(0x42A69DA0UL)))
