MarlinFirmware/Marlin/Marlin/lib/h32_core/main/hdsc32core/common/hc32f46x.h
#define bM4_INTC_SEL70_INTSEL3 (*((volatile unsigned int *)(0x42A22E8CUL)))
#define bM4_INTC_SEL70_INTSEL4 (*((volatile unsigned int *)(0x42A22E90UL)))
#define bM4_INTC_SEL70_INTSEL5 (*((volatile unsigned int *)(0x42A22E94UL)))
#define bM4_INTC_SEL70_INTSEL6 (*((volatile unsigned int *)(0x42A22E98UL)))
#define bM4_INTC_SEL70_INTSEL7 (*((volatile unsigned int *)(0x42A22E9CUL)))
#define bM4_INTC_SEL70_INTSEL8 (*((volatile unsigned int *)(0x42A22EA0UL)))
#define bM4_INTC_SEL71_INTSEL0 (*((volatile unsigned int *)(0x42A22F00UL)))
#define bM4_INTC_SEL71_INTSEL1 (*((volatile unsigned int *)(0x42A22F04UL)))
#define bM4_INTC_SEL71_INTSEL2 (*((volatile unsigned int *)(0x42A22F08UL)))
#define bM4_INTC_SEL71_INTSEL3 (*((volatile unsigned int *)(0x42A22F0CUL)))
#define bM4_INTC_SEL71_INTSEL4 (*((volatile unsigned int *)(0x42A22F10UL)))
#define bM4_INTC_SEL71_INTSEL5 (*((volatile unsigned int *)(0x42A22F14UL)))
#define bM4_INTC_SEL71_INTSEL6 (*((volatile unsigned int *)(0x42A22F18UL)))
#define bM4_INTC_SEL71_INTSEL7 (*((volatile unsigned int *)(0x42A22F1CUL)))
#define bM4_INTC_SEL71_INTSEL8 (*((volatile unsigned int *)(0x42A22F20UL)))
#define bM4_INTC_SEL72_INTSEL0 (*((volatile unsigned int *)(0x42A22F80UL)))
#define bM4_INTC_SEL72_INTSEL1 (*((volatile unsigned int *)(0x42A22F84UL)))
#define bM4_INTC_SEL72_INTSEL2 (*((volatile unsigned int *)(0x42A22F88UL)))
#define bM4_INTC_SEL72_INTSEL3 (*((volatile unsigned int *)(0x42A22F8CUL)))
#define bM4_INTC_SEL72_INTSEL4 (*((volatile unsigned int *)(0x42A22F90UL)))
#define bM4_INTC_SEL72_INTSEL5 (*((volatile unsigned int *)(0x42A22F94UL)))
#define bM4_INTC_SEL72_INTSEL6 (*((volatile unsigned int *)(0x42A22F98UL)))
#define bM4_INTC_SEL72_INTSEL7 (*((volatile unsigned int *)(0x42A22F9CUL)))
#define bM4_INTC_SEL72_INTSEL8 (*((volatile unsigned int *)(0x42A22FA0UL)))
#define bM4_INTC_SEL73_INTSEL0 (*((volatile unsigned int *)(0x42A23000UL)))
#define bM4_INTC_SEL73_INTSEL1 (*((volatile unsigned int *)(0x42A23004UL)))
#define bM4_INTC_SEL73_INTSEL2 (*((volatile unsigned int *)(0x42A23008UL)))
#define bM4_INTC_SEL73_INTSEL3 (*((volatile unsigned int *)(0x42A2300CUL)))
#define bM4_INTC_SEL73_INTSEL4 (*((volatile unsigned int *)(0x42A23010UL)))
#define bM4_INTC_SEL73_INTSEL5 (*((volatile unsigned int *)(0x42A23014UL)))
#define bM4_INTC_SEL73_INTSEL6 (*((volatile unsigned int *)(0x42A23018UL)))
#define bM4_INTC_SEL73_INTSEL7 (*((volatile unsigned int *)(0x42A2301CUL)))
#define bM4_INTC_SEL73_INTSEL8 (*((volatile unsigned int *)(0x42A23020UL)))
#define bM4_INTC_SEL74_INTSEL0 (*((volatile unsigned int *)(0x42A23080UL)))
#define bM4_INTC_SEL74_INTSEL1 (*((volatile unsigned int *)(0x42A23084UL)))
#define bM4_INTC_SEL74_INTSEL2 (*((volatile unsigned int *)(0x42A23088UL)))
#define bM4_INTC_SEL74_INTSEL3 (*((volatile unsigned int *)(0x42A2308CUL)))
#define bM4_INTC_SEL74_INTSEL4 (*((volatile unsigned int *)(0x42A23090UL)))
#define bM4_INTC_SEL74_INTSEL5 (*((volatile unsigned int *)(0x42A23094UL)))
#define bM4_INTC_SEL74_INTSEL6 (*((volatile unsigned int *)(0x42A23098UL)))
#define bM4_INTC_SEL74_INTSEL7 (*((volatile unsigned int *)(0x42A2309CUL)))
#define bM4_INTC_SEL74_INTSEL8 (*((volatile unsigned int *)(0x42A230A0UL)))
#define bM4_INTC_SEL75_INTSEL0 (*((volatile unsigned int *)(0x42A23100UL)))
#define bM4_INTC_SEL75_INTSEL1 (*((volatile unsigned int *)(0x42A23104UL)))
#define bM4_INTC_SEL75_INTSEL2 (*((volatile unsigned int *)(0x42A23108UL)))
#define bM4_INTC_SEL75_INTSEL3 (*((volatile unsigned int *)(0x42A2310CUL)))
#define bM4_INTC_SEL75_INTSEL4 (*((volatile unsigned int *)(0x42A23110UL)))
#define bM4_INTC_SEL75_INTSEL5 (*((volatile unsigned int *)(0x42A23114UL)))
#define bM4_INTC_SEL75_INTSEL6 (*((volatile unsigned int *)(0x42A23118UL)))
#define bM4_INTC_SEL75_INTSEL7 (*((volatile unsigned int *)(0x42A2311CUL)))
#define bM4_INTC_SEL75_INTSEL8 (*((volatile unsigned int *)(0x42A23120UL)))
#define bM4_INTC_SEL76_INTSEL0 (*((volatile unsigned int *)(0x42A23180UL)))
#define bM4_INTC_SEL76_INTSEL1 (*((volatile unsigned int *)(0x42A23184UL)))
#define bM4_INTC_SEL76_INTSEL2 (*((volatile unsigned int *)(0x42A23188UL)))
#define bM4_INTC_SEL76_INTSEL3 (*((volatile unsigned int *)(0x42A2318CUL)))
#define bM4_INTC_SEL76_INTSEL4 (*((volatile unsigned int *)(0x42A23190UL)))
#define bM4_INTC_SEL76_INTSEL5 (*((volatile unsigned int *)(0x42A23194UL)))
#define bM4_INTC_SEL76_INTSEL6 (*((volatile unsigned int *)(0x42A23198UL)))
#define bM4_INTC_SEL76_INTSEL7 (*((volatile unsigned int *)(0x42A2319CUL)))
#define bM4_INTC_SEL76_INTSEL8 (*((volatile unsigned int *)(0x42A231A0UL)))
#define bM4_INTC_SEL77_INTSEL0 (*((volatile unsigned int *)(0x42A23200UL)))
#define bM4_INTC_SEL77_INTSEL1 (*((volatile unsigned int *)(0x42A23204UL)))
#define bM4_INTC_SEL77_INTSEL2 (*((volatile unsigned int *)(0x42A23208UL)))
#define bM4_INTC_SEL77_INTSEL3 (*((volatile unsigned int *)(0x42A2320CUL)))
#define bM4_INTC_SEL77_INTSEL4 (*((volatile unsigned int *)(0x42A23210UL)))
#define bM4_INTC_SEL77_INTSEL5 (*((volatile unsigned int *)(0x42A23214UL)))
#define bM4_INTC_SEL77_INTSEL6 (*((volatile unsigned int *)(0x42A23218UL)))
#define bM4_INTC_SEL77_INTSEL7 (*((volatile unsigned int *)(0x42A2321CUL)))
#define bM4_INTC_SEL77_INTSEL8 (*((volatile unsigned int *)(0x42A23220UL)))
#define bM4_INTC_SEL78_INTSEL0 (*((volatile unsigned int *)(0x42A23280UL)))
#define bM4_INTC_SEL78_INTSEL1 (*((volatile unsigned int *)(0x42A23284UL)))
#define bM4_INTC_SEL78_INTSEL2 (*((volatile unsigned int *)(0x42A23288UL)))
#define bM4_INTC_SEL78_INTSEL3 (*((volatile unsigned int *)(0x42A2328CUL)))
#define bM4_INTC_SEL78_INTSEL4 (*((volatile unsigned int *)(0x42A23290UL)))
#define bM4_INTC_SEL78_INTSEL5 (*((volatile unsigned int *)(0x42A23294UL)))
#define bM4_INTC_SEL78_INTSEL6 (*((volatile unsigned int *)(0x42A23298UL)))
#define bM4_INTC_SEL78_INTSEL7 (*((volatile unsigned int *)(0x42A2329CUL)))
#define bM4_INTC_SEL78_INTSEL8 (*((volatile unsigned int *)(0x42A232A0UL)))
#define bM4_INTC_SEL79_INTSEL0 (*((volatile unsigned int *)(0x42A23300UL)))
#define bM4_INTC_SEL79_INTSEL1 (*((volatile unsigned int *)(0x42A23304UL)))
#define bM4_INTC_SEL79_INTSEL2 (*((volatile unsigned int *)(0x42A23308UL)))
#define bM4_INTC_SEL79_INTSEL3 (*((volatile unsigned int *)(0x42A2330CUL)))
#define bM4_INTC_SEL79_INTSEL4 (*((volatile unsigned int *)(0x42A23310UL)))
#define bM4_INTC_SEL79_INTSEL5 (*((volatile unsigned int *)(0x42A23314UL)))
#define bM4_INTC_SEL79_INTSEL6 (*((volatile unsigned int *)(0x42A23318UL)))
#define bM4_INTC_SEL79_INTSEL7 (*((volatile unsigned int *)(0x42A2331CUL)))
#define bM4_INTC_SEL79_INTSEL8 (*((volatile unsigned int *)(0x42A23320UL)))
#define bM4_INTC_SEL80_INTSEL0 (*((volatile unsigned int *)(0x42A23380UL)))
#define bM4_INTC_SEL80_INTSEL1 (*((volatile unsigned int *)(0x42A23384UL)))
#define bM4_INTC_SEL80_INTSEL2 (*((volatile unsigned int *)(0x42A23388UL)))
#define bM4_INTC_SEL80_INTSEL3 (*((volatile unsigned int *)(0x42A2338CUL)))
#define bM4_INTC_SEL80_INTSEL4 (*((volatile unsigned int *)(0x42A23390UL)))
#define bM4_INTC_SEL80_INTSEL5 (*((volatile unsigned int *)(0x42A23394UL)))
#define bM4_INTC_SEL80_INTSEL6 (*((volatile unsigned int *)(0x42A23398UL)))
#define bM4_INTC_SEL80_INTSEL7 (*((volatile unsigned int *)(0x42A2339CUL)))
#define bM4_INTC_SEL80_INTSEL8 (*((volatile unsigned int *)(0x42A233A0UL)))
#define bM4_INTC_SEL81_INTSEL0 (*((volatile unsigned int *)(0x42A23400UL)))
#define bM4_INTC_SEL81_INTSEL1 (*((volatile unsigned int *)(0x42A23404UL)))
#define bM4_INTC_SEL81_INTSEL2 (*((volatile unsigned int *)(0x42A23408UL)))
#define bM4_INTC_SEL81_INTSEL3 (*((volatile unsigned int *)(0x42A2340CUL)))
#define bM4_INTC_SEL81_INTSEL4 (*((volatile unsigned int *)(0x42A23410UL)))
#define bM4_INTC_SEL81_INTSEL5 (*((volatile unsigned int *)(0x42A23414UL)))
#define bM4_INTC_SEL81_INTSEL6 (*((volatile unsigned int *)(0x42A23418UL)))
#define bM4_INTC_SEL81_INTSEL7 (*((volatile unsigned int *)(0x42A2341CUL)))
#define bM4_INTC_SEL81_INTSEL8 (*((volatile unsigned int *)(0x42A23420UL)))
#define bM4_INTC_SEL82_INTSEL0 (*((volatile unsigned int *)(0x42A23480UL)))
#define bM4_INTC_SEL82_INTSEL1 (*((volatile unsigned int *)(0x42A23484UL)))
#define bM4_INTC_SEL82_INTSEL2 (*((volatile unsigned int *)(0x42A23488UL)))
#define bM4_INTC_SEL82_INTSEL3 (*((volatile unsigned int *)(0x42A2348CUL)))
#define bM4_INTC_SEL82_INTSEL4 (*((volatile unsigned int *)(0x42A23490UL)))
#define bM4_INTC_SEL82_INTSEL5 (*((volatile unsigned int *)(0x42A23494UL)))
#define bM4_INTC_SEL82_INTSEL6 (*((volatile unsigned int *)(0x42A23498UL)))
#define bM4_INTC_SEL82_INTSEL7 (*((volatile unsigned int *)(0x42A2349CUL)))
#define bM4_INTC_SEL82_INTSEL8 (*((volatile unsigned int *)(0x42A234A0UL)))
#define bM4_INTC_SEL83_INTSEL0 (*((volatile unsigned int *)(0x42A23500UL)))
#define bM4_INTC_SEL83_INTSEL1 (*((volatile unsigned int *)(0x42A23504UL)))
#define bM4_INTC_SEL83_INTSEL2 (*((volatile unsigned int *)(0x42A23508UL)))
#define bM4_INTC_SEL83_INTSEL3 (*((volatile unsigned int *)(0x42A2350CUL)))
#define bM4_INTC_SEL83_INTSEL4 (*((volatile unsigned int *)(0x42A23510UL)))
#define bM4_INTC_SEL83_INTSEL5 (*((volatile unsigned int *)(0x42A23514UL)))
#define bM4_INTC_SEL83_INTSEL6 (*((volatile unsigned int *)(0x42A23518UL)))
#define bM4_INTC_SEL83_INTSEL7 (*((volatile unsigned int *)(0x42A2351CUL)))
#define bM4_INTC_SEL83_INTSEL8 (*((volatile unsigned int *)(0x42A23520UL)))
#define bM4_INTC_SEL84_INTSEL0 (*((volatile unsigned int *)(0x42A23580UL)))
#define bM4_INTC_SEL84_INTSEL1 (*((volatile unsigned int *)(0x42A23584UL)))
#define bM4_INTC_SEL84_INTSEL2 (*((volatile unsigned int *)(0x42A23588UL)))
#define bM4_INTC_SEL84_INTSEL3 (*((volatile unsigned int *)(0x42A2358CUL)))
#define bM4_INTC_SEL84_INTSEL4 (*((volatile unsigned int *)(0x42A23590UL)))
#define bM4_INTC_SEL84_INTSEL5 (*((volatile unsigned int *)(0x42A23594UL)))
#define bM4_INTC_SEL84_INTSEL6 (*((volatile unsigned int *)(0x42A23598UL)))
#define bM4_INTC_SEL84_INTSEL7 (*((volatile unsigned int *)(0x42A2359CUL)))
#define bM4_INTC_SEL84_INTSEL8 (*((volatile unsigned int *)(0x42A235A0UL)))
#define bM4_INTC_SEL85_INTSEL0 (*((volatile unsigned int *)(0x42A23600UL)))
#define bM4_INTC_SEL85_INTSEL1 (*((volatile unsigned int *)(0x42A23604UL)))
#define bM4_INTC_SEL85_INTSEL2 (*((volatile unsigned int *)(0x42A23608UL)))
#define bM4_INTC_SEL85_INTSEL3 (*((volatile unsigned int *)(0x42A2360CUL)))
#define bM4_INTC_SEL85_INTSEL4 (*((volatile unsigned int *)(0x42A23610UL)))
#define bM4_INTC_SEL85_INTSEL5 (*((volatile unsigned int *)(0x42A23614UL)))
#define bM4_INTC_SEL85_INTSEL6 (*((volatile unsigned int *)(0x42A23618UL)))
#define bM4_INTC_SEL85_INTSEL7 (*((volatile unsigned int *)(0x42A2361CUL)))
#define bM4_INTC_SEL85_INTSEL8 (*((volatile unsigned int *)(0x42A23620UL)))
#define bM4_INTC_SEL86_INTSEL0 (*((volatile unsigned int *)(0x42A23680UL)))
#define bM4_INTC_SEL86_INTSEL1 (*((volatile unsigned int *)(0x42A23684UL)))
#define bM4_INTC_SEL86_INTSEL2 (*((volatile unsigned int *)(0x42A23688UL)))
#define bM4_INTC_SEL86_INTSEL3 (*((volatile unsigned int *)(0x42A2368CUL)))
#define bM4_INTC_SEL86_INTSEL4 (*((volatile unsigned int *)(0x42A23690UL)))
#define bM4_INTC_SEL86_INTSEL5 (*((volatile unsigned int *)(0x42A23694UL)))
#define bM4_INTC_SEL86_INTSEL6 (*((volatile unsigned int *)(0x42A23698UL)))
#define bM4_INTC_SEL86_INTSEL7 (*((volatile unsigned int *)(0x42A2369CUL)))
#define bM4_INTC_SEL86_INTSEL8 (*((volatile unsigned int *)(0x42A236A0UL)))
#define bM4_INTC_SEL87_INTSEL0 (*((volatile unsigned int *)(0x42A23700UL)))
#define bM4_INTC_SEL87_INTSEL1 (*((volatile unsigned int *)(0x42A23704UL)))
#define bM4_INTC_SEL87_INTSEL2 (*((volatile unsigned int *)(0x42A23708UL)))
#define bM4_INTC_SEL87_INTSEL3 (*((volatile unsigned int *)(0x42A2370CUL)))
#define bM4_INTC_SEL87_INTSEL4 (*((volatile unsigned int *)(0x42A23710UL)))
#define bM4_INTC_SEL87_INTSEL5 (*((volatile unsigned int *)(0x42A23714UL)))
#define bM4_INTC_SEL87_INTSEL6 (*((volatile unsigned int *)(0x42A23718UL)))
#define bM4_INTC_SEL87_INTSEL7 (*((volatile unsigned int *)(0x42A2371CUL)))
#define bM4_INTC_SEL87_INTSEL8 (*((volatile unsigned int *)(0x42A23720UL)))
#define bM4_INTC_SEL88_INTSEL0 (*((volatile unsigned int *)(0x42A23780UL)))
#define bM4_INTC_SEL88_INTSEL1 (*((volatile unsigned int *)(0x42A23784UL)))
#define bM4_INTC_SEL88_INTSEL2 (*((volatile unsigned int *)(0x42A23788UL)))
#define bM4_INTC_SEL88_INTSEL3 (*((volatile unsigned int *)(0x42A2378CUL)))
#define bM4_INTC_SEL88_INTSEL4 (*((volatile unsigned int *)(0x42A23790UL)))
#define bM4_INTC_SEL88_INTSEL5 (*((volatile unsigned int *)(0x42A23794UL)))
#define bM4_INTC_SEL88_INTSEL6 (*((volatile unsigned int *)(0x42A23798UL)))
#define bM4_INTC_SEL88_INTSEL7 (*((volatile unsigned int *)(0x42A2379CUL)))
#define bM4_INTC_SEL88_INTSEL8 (*((volatile unsigned int *)(0x42A237A0UL)))
#define bM4_INTC_SEL89_INTSEL0 (*((volatile unsigned int *)(0x42A23800UL)))
#define bM4_INTC_SEL89_INTSEL1 (*((volatile unsigned int *)(0x42A23804UL)))
#define bM4_INTC_SEL89_INTSEL2 (*((volatile unsigned int *)(0x42A23808UL)))
#define bM4_INTC_SEL89_INTSEL3 (*((volatile unsigned int *)(0x42A2380CUL)))
#define bM4_INTC_SEL89_INTSEL4 (*((volatile unsigned int *)(0x42A23810UL)))
#define bM4_INTC_SEL89_INTSEL5 (*((volatile unsigned int *)(0x42A23814UL)))
#define bM4_INTC_SEL89_INTSEL6 (*((volatile unsigned int *)(0x42A23818UL)))
#define bM4_INTC_SEL89_INTSEL7 (*((volatile unsigned int *)(0x42A2381CUL)))
#define bM4_INTC_SEL89_INTSEL8 (*((volatile unsigned int *)(0x42A23820UL)))
#define bM4_INTC_SEL90_INTSEL0 (*((volatile unsigned int *)(0x42A23880UL)))
#define bM4_INTC_SEL90_INTSEL1 (*((volatile unsigned int *)(0x42A23884UL)))
#define bM4_INTC_SEL90_INTSEL2 (*((volatile unsigned int *)(0x42A23888UL)))
#define bM4_INTC_SEL90_INTSEL3 (*((volatile unsigned int *)(0x42A2388CUL)))
#define bM4_INTC_SEL90_INTSEL4 (*((volatile unsigned int *)(0x42A23890UL)))
#define bM4_INTC_SEL90_INTSEL5 (*((volatile unsigned int *)(0x42A23894UL)))
#define bM4_INTC_SEL90_INTSEL6 (*((volatile unsigned int *)(0x42A23898UL)))
#define bM4_INTC_SEL90_INTSEL7 (*((volatile unsigned int *)(0x42A2389CUL)))
#define bM4_INTC_SEL90_INTSEL8 (*((volatile unsigned int *)(0x42A238A0UL)))
#define bM4_INTC_SEL91_INTSEL0 (*((volatile unsigned int *)(0x42A23900UL)))
#define bM4_INTC_SEL91_INTSEL1 (*((volatile unsigned int *)(0x42A23904UL)))
#define bM4_INTC_SEL91_INTSEL2 (*((volatile unsigned int *)(0x42A23908UL)))
#define bM4_INTC_SEL91_INTSEL3 (*((volatile unsigned int *)(0x42A2390CUL)))
#define bM4_INTC_SEL91_INTSEL4 (*((volatile unsigned int *)(0x42A23910UL)))
#define bM4_INTC_SEL91_INTSEL5 (*((volatile unsigned int *)(0x42A23914UL)))
#define bM4_INTC_SEL91_INTSEL6 (*((volatile unsigned int *)(0x42A23918UL)))
#define bM4_INTC_SEL91_INTSEL7 (*((volatile unsigned int *)(0x42A2391CUL)))
#define bM4_INTC_SEL91_INTSEL8 (*((volatile unsigned int *)(0x42A23920UL)))
#define bM4_INTC_SEL92_INTSEL0 (*((volatile unsigned int *)(0x42A23980UL)))
#define bM4_INTC_SEL92_INTSEL1 (*((volatile unsigned int *)(0x42A23984UL)))
#define bM4_INTC_SEL92_INTSEL2 (*((volatile unsigned int *)(0x42A23988UL)))
#define bM4_INTC_SEL92_INTSEL3 (*((volatile unsigned int *)(0x42A2398CUL)))
#define bM4_INTC_SEL92_INTSEL4 (*((volatile unsigned int *)(0x42A23990UL)))
#define bM4_INTC_SEL92_INTSEL5 (*((volatile unsigned int *)(0x42A23994UL)))
#define bM4_INTC_SEL92_INTSEL6 (*((volatile unsigned int *)(0x42A23998UL)))
#define bM4_INTC_SEL92_INTSEL7 (*((volatile unsigned int *)(0x42A2399CUL)))
#define bM4_INTC_SEL92_INTSEL8 (*((volatile unsigned int *)(0x42A239A0UL)))
#define bM4_INTC_SEL93_INTSEL0 (*((volatile unsigned int *)(0x42A23A00UL)))
#define bM4_INTC_SEL93_INTSEL1 (*((volatile unsigned int *)(0x42A23A04UL)))
#define bM4_INTC_SEL93_INTSEL2 (*((volatile unsigned int *)(0x42A23A08UL)))
#define bM4_INTC_SEL93_INTSEL3 (*((volatile unsigned int *)(0x42A23A0CUL)))
#define bM4_INTC_SEL93_INTSEL4 (*((volatile unsigned int *)(0x42A23A10UL)))
#define bM4_INTC_SEL93_INTSEL5 (*((volatile unsigned int *)(0x42A23A14UL)))
#define bM4_INTC_SEL93_INTSEL6 (*((volatile unsigned int *)(0x42A23A18UL)))
#define bM4_INTC_SEL93_INTSEL7 (*((volatile unsigned int *)(0x42A23A1CUL)))
#define bM4_INTC_SEL93_INTSEL8 (*((volatile unsigned int *)(0x42A23A20UL)))
#define bM4_INTC_SEL94_INTSEL0 (*((volatile unsigned int *)(0x42A23A80UL)))
#define bM4_INTC_SEL94_INTSEL1 (*((volatile unsigned int *)(0x42A23A84UL)))
#define bM4_INTC_SEL94_INTSEL2 (*((volatile unsigned int *)(0x42A23A88UL)))
#define bM4_INTC_SEL94_INTSEL3 (*((volatile unsigned int *)(0x42A23A8CUL)))
#define bM4_INTC_SEL94_INTSEL4 (*((volatile unsigned int *)(0x42A23A90UL)))
#define bM4_INTC_SEL94_INTSEL5 (*((volatile unsigned int *)(0x42A23A94UL)))
#define bM4_INTC_SEL94_INTSEL6 (*((volatile unsigned int *)(0x42A23A98UL)))
#define bM4_INTC_SEL94_INTSEL7 (*((volatile unsigned int *)(0x42A23A9CUL)))
#define bM4_INTC_SEL94_INTSEL8 (*((volatile unsigned int *)(0x42A23AA0UL)))
#define bM4_INTC_SEL95_INTSEL0 (*((volatile unsigned int *)(0x42A23B00UL)))
#define bM4_INTC_SEL95_INTSEL1 (*((volatile unsigned int *)(0x42A23B04UL)))
#define bM4_INTC_SEL95_INTSEL2 (*((volatile unsigned int *)(0x42A23B08UL)))
#define bM4_INTC_SEL95_INTSEL3 (*((volatile unsigned int *)(0x42A23B0CUL)))
#define bM4_INTC_SEL95_INTSEL4 (*((volatile unsigned int *)(0x42A23B10UL)))
#define bM4_INTC_SEL95_INTSEL5 (*((volatile unsigned int *)(0x42A23B14UL)))
#define bM4_INTC_SEL95_INTSEL6 (*((volatile unsigned int *)(0x42A23B18UL)))
#define bM4_INTC_SEL95_INTSEL7 (*((volatile unsigned int *)(0x42A23B1CUL)))
#define bM4_INTC_SEL95_INTSEL8 (*((volatile unsigned int *)(0x42A23B20UL)))
#define bM4_INTC_SEL96_INTSEL0 (*((volatile unsigned int *)(0x42A23B80UL)))
#define bM4_INTC_SEL96_INTSEL1 (*((volatile unsigned int *)(0x42A23B84UL)))
#define bM4_INTC_SEL96_INTSEL2 (*((volatile unsigned int *)(0x42A23B88UL)))
#define bM4_INTC_SEL96_INTSEL3 (*((volatile unsigned int *)(0x42A23B8CUL)))
#define bM4_INTC_SEL96_INTSEL4 (*((volatile unsigned int *)(0x42A23B90UL)))
#define bM4_INTC_SEL96_INTSEL5 (*((volatile unsigned int *)(0x42A23B94UL)))
#define bM4_INTC_SEL96_INTSEL6 (*((volatile unsigned int *)(0x42A23B98UL)))
#define bM4_INTC_SEL96_INTSEL7 (*((volatile unsigned int *)(0x42A23B9CUL)))
#define bM4_INTC_SEL96_INTSEL8 (*((volatile unsigned int *)(0x42A23BA0UL)))
#define bM4_INTC_SEL97_INTSEL0 (*((volatile unsigned int *)(0x42A23C00UL)))
#define bM4_INTC_SEL97_INTSEL1 (*((volatile unsigned int *)(0x42A23C04UL)))
#define bM4_INTC_SEL97_INTSEL2 (*((volatile unsigned int *)(0x42A23C08UL)))
#define bM4_INTC_SEL97_INTSEL3 (*((volatile unsigned int *)(0x42A23C0CUL)))
#define bM4_INTC_SEL97_INTSEL4 (*((volatile unsigned int *)(0x42A23C10UL)))
#define bM4_INTC_SEL97_INTSEL5 (*((volatile unsigned int *)(0x42A23C14UL)))
#define bM4_INTC_SEL97_INTSEL6 (*((volatile unsigned int *)(0x42A23C18UL)))
#define bM4_INTC_SEL97_INTSEL7 (*((volatile unsigned int *)(0x42A23C1CUL)))
#define bM4_INTC_SEL97_INTSEL8 (*((volatile unsigned int *)(0x42A23C20UL)))
#define bM4_INTC_SEL98_INTSEL0 (*((volatile unsigned int *)(0x42A23C80UL)))
#define bM4_INTC_SEL98_INTSEL1 (*((volatile unsigned int *)(0x42A23C84UL)))
#define bM4_INTC_SEL98_INTSEL2 (*((volatile unsigned int *)(0x42A23C88UL)))
#define bM4_INTC_SEL98_INTSEL3 (*((volatile unsigned int *)(0x42A23C8CUL)))
#define bM4_INTC_SEL98_INTSEL4 (*((volatile unsigned int *)(0x42A23C90UL)))
#define bM4_INTC_SEL98_INTSEL5 (*((volatile unsigned int *)(0x42A23C94UL)))
#define bM4_INTC_SEL98_INTSEL6 (*((volatile unsigned int *)(0x42A23C98UL)))
#define bM4_INTC_SEL98_INTSEL7 (*((volatile unsigned int *)(0x42A23C9CUL)))
#define bM4_INTC_SEL98_INTSEL8 (*((volatile unsigned int *)(0x42A23CA0UL)))
#define bM4_INTC_SEL99_INTSEL0 (*((volatile unsigned int *)(0x42A23D00UL)))
#define bM4_INTC_SEL99_INTSEL1 (*((volatile unsigned int *)(0x42A23D04UL)))
#define bM4_INTC_SEL99_INTSEL2 (*((volatile unsigned int *)(0x42A23D08UL)))
#define bM4_INTC_SEL99_INTSEL3 (*((volatile unsigned int *)(0x42A23D0CUL)))
#define bM4_INTC_SEL99_INTSEL4 (*((volatile unsigned int *)(0x42A23D10UL)))
#define bM4_INTC_SEL99_INTSEL5 (*((volatile unsigned int *)(0x42A23D14UL)))
#define bM4_INTC_SEL99_INTSEL6 (*((volatile unsigned int *)(0x42A23D18UL)))
#define bM4_INTC_SEL99_INTSEL7 (*((volatile unsigned int *)(0x42A23D1CUL)))
#define bM4_INTC_SEL99_INTSEL8 (*((volatile unsigned int *)(0x42A23D20UL)))
#define bM4_INTC_SEL100_INTSEL0 (*((volatile unsigned int *)(0x42A23D80UL)))
#define bM4_INTC_SEL100_INTSEL1 (*((volatile unsigned int *)(0x42A23D84UL)))
#define bM4_INTC_SEL100_INTSEL2 (*((volatile unsigned int *)(0x42A23D88UL)))
#define bM4_INTC_SEL100_INTSEL3 (*((volatile unsigned int *)(0x42A23D8CUL)))
#define bM4_INTC_SEL100_INTSEL4 (*((volatile unsigned int *)(0x42A23D90UL)))
#define bM4_INTC_SEL100_INTSEL5 (*((volatile unsigned int *)(0x42A23D94UL)))
#define bM4_INTC_SEL100_INTSEL6 (*((volatile unsigned int *)(0x42A23D98UL)))
#define bM4_INTC_SEL100_INTSEL7 (*((volatile unsigned int *)(0x42A23D9CUL)))
#define bM4_INTC_SEL100_INTSEL8 (*((volatile unsigned int *)(0x42A23DA0UL)))
#define bM4_INTC_SEL101_INTSEL0 (*((volatile unsigned int *)(0x42A23E00UL)))
#define bM4_INTC_SEL101_INTSEL1 (*((volatile unsigned int *)(0x42A23E04UL)))
#define bM4_INTC_SEL101_INTSEL2 (*((volatile unsigned int *)(0x42A23E08UL)))
#define bM4_INTC_SEL101_INTSEL3 (*((volatile unsigned int *)(0x42A23E0CUL)))
#define bM4_INTC_SEL101_INTSEL4 (*((volatile unsigned int *)(0x42A23E10UL)))
#define bM4_INTC_SEL101_INTSEL5 (*((volatile unsigned int *)(0x42A23E14UL)))
#define bM4_INTC_SEL101_INTSEL6 (*((volatile unsigned int *)(0x42A23E18UL)))
#define bM4_INTC_SEL101_INTSEL7 (*((volatile unsigned int *)(0x42A23E1CUL)))
#define bM4_INTC_SEL101_INTSEL8 (*((volatile unsigned int *)(0x42A23E20UL)))
#define bM4_INTC_SEL102_INTSEL0 (*((volatile unsigned int *)(0x42A23E80UL)))
#define bM4_INTC_SEL102_INTSEL1 (*((volatile unsigned int *)(0x42A23E84UL)))
#define bM4_INTC_SEL102_INTSEL2 (*((volatile unsigned int *)(0x42A23E88UL)))
#define bM4_INTC_SEL102_INTSEL3 (*((volatile unsigned int *)(0x42A23E8CUL)))
#define bM4_INTC_SEL102_INTSEL4 (*((volatile unsigned int *)(0x42A23E90UL)))
#define bM4_INTC_SEL102_INTSEL5 (*((volatile unsigned int *)(0x42A23E94UL)))
#define bM4_INTC_SEL102_INTSEL6 (*((volatile unsigned int *)(0x42A23E98UL)))
#define bM4_INTC_SEL102_INTSEL7 (*((volatile unsigned int *)(0x42A23E9CUL)))
#define bM4_INTC_SEL102_INTSEL8 (*((volatile unsigned int *)(0x42A23EA0UL)))
#define bM4_INTC_SEL103_INTSEL0 (*((volatile unsigned int *)(0x42A23F00UL)))
#define bM4_INTC_SEL103_INTSEL1 (*((volatile unsigned int *)(0x42A23F04UL)))
#define bM4_INTC_SEL103_INTSEL2 (*((volatile unsigned int *)(0x42A23F08UL)))
#define bM4_INTC_SEL103_INTSEL3 (*((volatile unsigned int *)(0x42A23F0CUL)))
#define bM4_INTC_SEL103_INTSEL4 (*((volatile unsigned int *)(0x42A23F10UL)))
#define bM4_INTC_SEL103_INTSEL5 (*((volatile unsigned int *)(0x42A23F14UL)))
#define bM4_INTC_SEL103_INTSEL6 (*((volatile unsigned int *)(0x42A23F18UL)))
#define bM4_INTC_SEL103_INTSEL7 (*((volatile unsigned int *)(0x42A23F1CUL)))
#define bM4_INTC_SEL103_INTSEL8 (*((volatile unsigned int *)(0x42A23F20UL)))
#define bM4_INTC_SEL104_INTSEL0 (*((volatile unsigned int *)(0x42A23F80UL)))
#define bM4_INTC_SEL104_INTSEL1 (*((volatile unsigned int *)(0x42A23F84UL)))
#define bM4_INTC_SEL104_INTSEL2 (*((volatile unsigned int *)(0x42A23F88UL)))
#define bM4_INTC_SEL104_INTSEL3 (*((volatile unsigned int *)(0x42A23F8CUL)))
#define bM4_INTC_SEL104_INTSEL4 (*((volatile unsigned int *)(0x42A23F90UL)))
#define bM4_INTC_SEL104_INTSEL5 (*((volatile unsigned int *)(0x42A23F94UL)))
#define bM4_INTC_SEL104_INTSEL6 (*((volatile unsigned int *)(0x42A23F98UL)))
#define bM4_INTC_SEL104_INTSEL7 (*((volatile unsigned int *)(0x42A23F9CUL)))
#define bM4_INTC_SEL104_INTSEL8 (*((volatile unsigned int *)(0x42A23FA0UL)))
#define bM4_INTC_SEL105_INTSEL0 (*((volatile unsigned int *)(0x42A24000UL)))
#define bM4_INTC_SEL105_INTSEL1 (*((volatile unsigned int *)(0x42A24004UL)))
#define bM4_INTC_SEL105_INTSEL2 (*((volatile unsigned int *)(0x42A24008UL)))
