MarlinFirmware/Marlin/Marlin/lib/h32_core/main/hdsc32core/common/hc32f46x.h
#define bM4_INTC_SEL105_INTSEL3 (*((volatile unsigned int *)(0x42A2400CUL)))
#define bM4_INTC_SEL105_INTSEL4 (*((volatile unsigned int *)(0x42A24010UL)))
#define bM4_INTC_SEL105_INTSEL5 (*((volatile unsigned int *)(0x42A24014UL)))
#define bM4_INTC_SEL105_INTSEL6 (*((volatile unsigned int *)(0x42A24018UL)))
#define bM4_INTC_SEL105_INTSEL7 (*((volatile unsigned int *)(0x42A2401CUL)))
#define bM4_INTC_SEL105_INTSEL8 (*((volatile unsigned int *)(0x42A24020UL)))
#define bM4_INTC_SEL106_INTSEL0 (*((volatile unsigned int *)(0x42A24080UL)))
#define bM4_INTC_SEL106_INTSEL1 (*((volatile unsigned int *)(0x42A24084UL)))
#define bM4_INTC_SEL106_INTSEL2 (*((volatile unsigned int *)(0x42A24088UL)))
#define bM4_INTC_SEL106_INTSEL3 (*((volatile unsigned int *)(0x42A2408CUL)))
#define bM4_INTC_SEL106_INTSEL4 (*((volatile unsigned int *)(0x42A24090UL)))
#define bM4_INTC_SEL106_INTSEL5 (*((volatile unsigned int *)(0x42A24094UL)))
#define bM4_INTC_SEL106_INTSEL6 (*((volatile unsigned int *)(0x42A24098UL)))
#define bM4_INTC_SEL106_INTSEL7 (*((volatile unsigned int *)(0x42A2409CUL)))
#define bM4_INTC_SEL106_INTSEL8 (*((volatile unsigned int *)(0x42A240A0UL)))
#define bM4_INTC_SEL107_INTSEL0 (*((volatile unsigned int *)(0x42A24100UL)))
#define bM4_INTC_SEL107_INTSEL1 (*((volatile unsigned int *)(0x42A24104UL)))
#define bM4_INTC_SEL107_INTSEL2 (*((volatile unsigned int *)(0x42A24108UL)))
#define bM4_INTC_SEL107_INTSEL3 (*((volatile unsigned int *)(0x42A2410CUL)))
#define bM4_INTC_SEL107_INTSEL4 (*((volatile unsigned int *)(0x42A24110UL)))
#define bM4_INTC_SEL107_INTSEL5 (*((volatile unsigned int *)(0x42A24114UL)))
#define bM4_INTC_SEL107_INTSEL6 (*((volatile unsigned int *)(0x42A24118UL)))
#define bM4_INTC_SEL107_INTSEL7 (*((volatile unsigned int *)(0x42A2411CUL)))
#define bM4_INTC_SEL107_INTSEL8 (*((volatile unsigned int *)(0x42A24120UL)))
#define bM4_INTC_SEL108_INTSEL0 (*((volatile unsigned int *)(0x42A24180UL)))
#define bM4_INTC_SEL108_INTSEL1 (*((volatile unsigned int *)(0x42A24184UL)))
#define bM4_INTC_SEL108_INTSEL2 (*((volatile unsigned int *)(0x42A24188UL)))
#define bM4_INTC_SEL108_INTSEL3 (*((volatile unsigned int *)(0x42A2418CUL)))
#define bM4_INTC_SEL108_INTSEL4 (*((volatile unsigned int *)(0x42A24190UL)))
#define bM4_INTC_SEL108_INTSEL5 (*((volatile unsigned int *)(0x42A24194UL)))
#define bM4_INTC_SEL108_INTSEL6 (*((volatile unsigned int *)(0x42A24198UL)))
#define bM4_INTC_SEL108_INTSEL7 (*((volatile unsigned int *)(0x42A2419CUL)))
#define bM4_INTC_SEL108_INTSEL8 (*((volatile unsigned int *)(0x42A241A0UL)))
#define bM4_INTC_SEL109_INTSEL0 (*((volatile unsigned int *)(0x42A24200UL)))
#define bM4_INTC_SEL109_INTSEL1 (*((volatile unsigned int *)(0x42A24204UL)))
#define bM4_INTC_SEL109_INTSEL2 (*((volatile unsigned int *)(0x42A24208UL)))
#define bM4_INTC_SEL109_INTSEL3 (*((volatile unsigned int *)(0x42A2420CUL)))
#define bM4_INTC_SEL109_INTSEL4 (*((volatile unsigned int *)(0x42A24210UL)))
#define bM4_INTC_SEL109_INTSEL5 (*((volatile unsigned int *)(0x42A24214UL)))
#define bM4_INTC_SEL109_INTSEL6 (*((volatile unsigned int *)(0x42A24218UL)))
#define bM4_INTC_SEL109_INTSEL7 (*((volatile unsigned int *)(0x42A2421CUL)))
#define bM4_INTC_SEL109_INTSEL8 (*((volatile unsigned int *)(0x42A24220UL)))
#define bM4_INTC_SEL110_INTSEL0 (*((volatile unsigned int *)(0x42A24280UL)))
#define bM4_INTC_SEL110_INTSEL1 (*((volatile unsigned int *)(0x42A24284UL)))
#define bM4_INTC_SEL110_INTSEL2 (*((volatile unsigned int *)(0x42A24288UL)))
#define bM4_INTC_SEL110_INTSEL3 (*((volatile unsigned int *)(0x42A2428CUL)))
#define bM4_INTC_SEL110_INTSEL4 (*((volatile unsigned int *)(0x42A24290UL)))
#define bM4_INTC_SEL110_INTSEL5 (*((volatile unsigned int *)(0x42A24294UL)))
#define bM4_INTC_SEL110_INTSEL6 (*((volatile unsigned int *)(0x42A24298UL)))
#define bM4_INTC_SEL110_INTSEL7 (*((volatile unsigned int *)(0x42A2429CUL)))
#define bM4_INTC_SEL110_INTSEL8 (*((volatile unsigned int *)(0x42A242A0UL)))
#define bM4_INTC_SEL111_INTSEL0 (*((volatile unsigned int *)(0x42A24300UL)))
#define bM4_INTC_SEL111_INTSEL1 (*((volatile unsigned int *)(0x42A24304UL)))
#define bM4_INTC_SEL111_INTSEL2 (*((volatile unsigned int *)(0x42A24308UL)))
#define bM4_INTC_SEL111_INTSEL3 (*((volatile unsigned int *)(0x42A2430CUL)))
#define bM4_INTC_SEL111_INTSEL4 (*((volatile unsigned int *)(0x42A24310UL)))
#define bM4_INTC_SEL111_INTSEL5 (*((volatile unsigned int *)(0x42A24314UL)))
#define bM4_INTC_SEL111_INTSEL6 (*((volatile unsigned int *)(0x42A24318UL)))
#define bM4_INTC_SEL111_INTSEL7 (*((volatile unsigned int *)(0x42A2431CUL)))
#define bM4_INTC_SEL111_INTSEL8 (*((volatile unsigned int *)(0x42A24320UL)))
#define bM4_INTC_SEL112_INTSEL0 (*((volatile unsigned int *)(0x42A24380UL)))
#define bM4_INTC_SEL112_INTSEL1 (*((volatile unsigned int *)(0x42A24384UL)))
#define bM4_INTC_SEL112_INTSEL2 (*((volatile unsigned int *)(0x42A24388UL)))
#define bM4_INTC_SEL112_INTSEL3 (*((volatile unsigned int *)(0x42A2438CUL)))
#define bM4_INTC_SEL112_INTSEL4 (*((volatile unsigned int *)(0x42A24390UL)))
#define bM4_INTC_SEL112_INTSEL5 (*((volatile unsigned int *)(0x42A24394UL)))
#define bM4_INTC_SEL112_INTSEL6 (*((volatile unsigned int *)(0x42A24398UL)))
#define bM4_INTC_SEL112_INTSEL7 (*((volatile unsigned int *)(0x42A2439CUL)))
#define bM4_INTC_SEL112_INTSEL8 (*((volatile unsigned int *)(0x42A243A0UL)))
#define bM4_INTC_SEL113_INTSEL0 (*((volatile unsigned int *)(0x42A24400UL)))
#define bM4_INTC_SEL113_INTSEL1 (*((volatile unsigned int *)(0x42A24404UL)))
#define bM4_INTC_SEL113_INTSEL2 (*((volatile unsigned int *)(0x42A24408UL)))
#define bM4_INTC_SEL113_INTSEL3 (*((volatile unsigned int *)(0x42A2440CUL)))
#define bM4_INTC_SEL113_INTSEL4 (*((volatile unsigned int *)(0x42A24410UL)))
#define bM4_INTC_SEL113_INTSEL5 (*((volatile unsigned int *)(0x42A24414UL)))
#define bM4_INTC_SEL113_INTSEL6 (*((volatile unsigned int *)(0x42A24418UL)))
#define bM4_INTC_SEL113_INTSEL7 (*((volatile unsigned int *)(0x42A2441CUL)))
#define bM4_INTC_SEL113_INTSEL8 (*((volatile unsigned int *)(0x42A24420UL)))
#define bM4_INTC_SEL114_INTSEL0 (*((volatile unsigned int *)(0x42A24480UL)))
#define bM4_INTC_SEL114_INTSEL1 (*((volatile unsigned int *)(0x42A24484UL)))
#define bM4_INTC_SEL114_INTSEL2 (*((volatile unsigned int *)(0x42A24488UL)))
#define bM4_INTC_SEL114_INTSEL3 (*((volatile unsigned int *)(0x42A2448CUL)))
#define bM4_INTC_SEL114_INTSEL4 (*((volatile unsigned int *)(0x42A24490UL)))
#define bM4_INTC_SEL114_INTSEL5 (*((volatile unsigned int *)(0x42A24494UL)))
#define bM4_INTC_SEL114_INTSEL6 (*((volatile unsigned int *)(0x42A24498UL)))
#define bM4_INTC_SEL114_INTSEL7 (*((volatile unsigned int *)(0x42A2449CUL)))
#define bM4_INTC_SEL114_INTSEL8 (*((volatile unsigned int *)(0x42A244A0UL)))
#define bM4_INTC_SEL115_INTSEL0 (*((volatile unsigned int *)(0x42A24500UL)))
#define bM4_INTC_SEL115_INTSEL1 (*((volatile unsigned int *)(0x42A24504UL)))
#define bM4_INTC_SEL115_INTSEL2 (*((volatile unsigned int *)(0x42A24508UL)))
#define bM4_INTC_SEL115_INTSEL3 (*((volatile unsigned int *)(0x42A2450CUL)))
#define bM4_INTC_SEL115_INTSEL4 (*((volatile unsigned int *)(0x42A24510UL)))
#define bM4_INTC_SEL115_INTSEL5 (*((volatile unsigned int *)(0x42A24514UL)))
#define bM4_INTC_SEL115_INTSEL6 (*((volatile unsigned int *)(0x42A24518UL)))
#define bM4_INTC_SEL115_INTSEL7 (*((volatile unsigned int *)(0x42A2451CUL)))
#define bM4_INTC_SEL115_INTSEL8 (*((volatile unsigned int *)(0x42A24520UL)))
#define bM4_INTC_SEL116_INTSEL0 (*((volatile unsigned int *)(0x42A24580UL)))
#define bM4_INTC_SEL116_INTSEL1 (*((volatile unsigned int *)(0x42A24584UL)))
#define bM4_INTC_SEL116_INTSEL2 (*((volatile unsigned int *)(0x42A24588UL)))
#define bM4_INTC_SEL116_INTSEL3 (*((volatile unsigned int *)(0x42A2458CUL)))
#define bM4_INTC_SEL116_INTSEL4 (*((volatile unsigned int *)(0x42A24590UL)))
#define bM4_INTC_SEL116_INTSEL5 (*((volatile unsigned int *)(0x42A24594UL)))
#define bM4_INTC_SEL116_INTSEL6 (*((volatile unsigned int *)(0x42A24598UL)))
#define bM4_INTC_SEL116_INTSEL7 (*((volatile unsigned int *)(0x42A2459CUL)))
#define bM4_INTC_SEL116_INTSEL8 (*((volatile unsigned int *)(0x42A245A0UL)))
#define bM4_INTC_SEL117_INTSEL0 (*((volatile unsigned int *)(0x42A24600UL)))
#define bM4_INTC_SEL117_INTSEL1 (*((volatile unsigned int *)(0x42A24604UL)))
#define bM4_INTC_SEL117_INTSEL2 (*((volatile unsigned int *)(0x42A24608UL)))
#define bM4_INTC_SEL117_INTSEL3 (*((volatile unsigned int *)(0x42A2460CUL)))
#define bM4_INTC_SEL117_INTSEL4 (*((volatile unsigned int *)(0x42A24610UL)))
#define bM4_INTC_SEL117_INTSEL5 (*((volatile unsigned int *)(0x42A24614UL)))
#define bM4_INTC_SEL117_INTSEL6 (*((volatile unsigned int *)(0x42A24618UL)))
#define bM4_INTC_SEL117_INTSEL7 (*((volatile unsigned int *)(0x42A2461CUL)))
#define bM4_INTC_SEL117_INTSEL8 (*((volatile unsigned int *)(0x42A24620UL)))
#define bM4_INTC_SEL118_INTSEL0 (*((volatile unsigned int *)(0x42A24680UL)))
#define bM4_INTC_SEL118_INTSEL1 (*((volatile unsigned int *)(0x42A24684UL)))
#define bM4_INTC_SEL118_INTSEL2 (*((volatile unsigned int *)(0x42A24688UL)))
#define bM4_INTC_SEL118_INTSEL3 (*((volatile unsigned int *)(0x42A2468CUL)))
#define bM4_INTC_SEL118_INTSEL4 (*((volatile unsigned int *)(0x42A24690UL)))
#define bM4_INTC_SEL118_INTSEL5 (*((volatile unsigned int *)(0x42A24694UL)))
#define bM4_INTC_SEL118_INTSEL6 (*((volatile unsigned int *)(0x42A24698UL)))
#define bM4_INTC_SEL118_INTSEL7 (*((volatile unsigned int *)(0x42A2469CUL)))
#define bM4_INTC_SEL118_INTSEL8 (*((volatile unsigned int *)(0x42A246A0UL)))
#define bM4_INTC_SEL119_INTSEL0 (*((volatile unsigned int *)(0x42A24700UL)))
#define bM4_INTC_SEL119_INTSEL1 (*((volatile unsigned int *)(0x42A24704UL)))
#define bM4_INTC_SEL119_INTSEL2 (*((volatile unsigned int *)(0x42A24708UL)))
#define bM4_INTC_SEL119_INTSEL3 (*((volatile unsigned int *)(0x42A2470CUL)))
#define bM4_INTC_SEL119_INTSEL4 (*((volatile unsigned int *)(0x42A24710UL)))
#define bM4_INTC_SEL119_INTSEL5 (*((volatile unsigned int *)(0x42A24714UL)))
#define bM4_INTC_SEL119_INTSEL6 (*((volatile unsigned int *)(0x42A24718UL)))
#define bM4_INTC_SEL119_INTSEL7 (*((volatile unsigned int *)(0x42A2471CUL)))
#define bM4_INTC_SEL119_INTSEL8 (*((volatile unsigned int *)(0x42A24720UL)))
#define bM4_INTC_SEL120_INTSEL0 (*((volatile unsigned int *)(0x42A24780UL)))
#define bM4_INTC_SEL120_INTSEL1 (*((volatile unsigned int *)(0x42A24784UL)))
#define bM4_INTC_SEL120_INTSEL2 (*((volatile unsigned int *)(0x42A24788UL)))
#define bM4_INTC_SEL120_INTSEL3 (*((volatile unsigned int *)(0x42A2478CUL)))
#define bM4_INTC_SEL120_INTSEL4 (*((volatile unsigned int *)(0x42A24790UL)))
#define bM4_INTC_SEL120_INTSEL5 (*((volatile unsigned int *)(0x42A24794UL)))
#define bM4_INTC_SEL120_INTSEL6 (*((volatile unsigned int *)(0x42A24798UL)))
#define bM4_INTC_SEL120_INTSEL7 (*((volatile unsigned int *)(0x42A2479CUL)))
#define bM4_INTC_SEL120_INTSEL8 (*((volatile unsigned int *)(0x42A247A0UL)))
#define bM4_INTC_SEL121_INTSEL0 (*((volatile unsigned int *)(0x42A24800UL)))
#define bM4_INTC_SEL121_INTSEL1 (*((volatile unsigned int *)(0x42A24804UL)))
#define bM4_INTC_SEL121_INTSEL2 (*((volatile unsigned int *)(0x42A24808UL)))
#define bM4_INTC_SEL121_INTSEL3 (*((volatile unsigned int *)(0x42A2480CUL)))
#define bM4_INTC_SEL121_INTSEL4 (*((volatile unsigned int *)(0x42A24810UL)))
#define bM4_INTC_SEL121_INTSEL5 (*((volatile unsigned int *)(0x42A24814UL)))
#define bM4_INTC_SEL121_INTSEL6 (*((volatile unsigned int *)(0x42A24818UL)))
#define bM4_INTC_SEL121_INTSEL7 (*((volatile unsigned int *)(0x42A2481CUL)))
#define bM4_INTC_SEL121_INTSEL8 (*((volatile unsigned int *)(0x42A24820UL)))
#define bM4_INTC_SEL122_INTSEL0 (*((volatile unsigned int *)(0x42A24880UL)))
#define bM4_INTC_SEL122_INTSEL1 (*((volatile unsigned int *)(0x42A24884UL)))
#define bM4_INTC_SEL122_INTSEL2 (*((volatile unsigned int *)(0x42A24888UL)))
#define bM4_INTC_SEL122_INTSEL3 (*((volatile unsigned int *)(0x42A2488CUL)))
#define bM4_INTC_SEL122_INTSEL4 (*((volatile unsigned int *)(0x42A24890UL)))
#define bM4_INTC_SEL122_INTSEL5 (*((volatile unsigned int *)(0x42A24894UL)))
#define bM4_INTC_SEL122_INTSEL6 (*((volatile unsigned int *)(0x42A24898UL)))
#define bM4_INTC_SEL122_INTSEL7 (*((volatile unsigned int *)(0x42A2489CUL)))
#define bM4_INTC_SEL122_INTSEL8 (*((volatile unsigned int *)(0x42A248A0UL)))
#define bM4_INTC_SEL123_INTSEL0 (*((volatile unsigned int *)(0x42A24900UL)))
#define bM4_INTC_SEL123_INTSEL1 (*((volatile unsigned int *)(0x42A24904UL)))
#define bM4_INTC_SEL123_INTSEL2 (*((volatile unsigned int *)(0x42A24908UL)))
#define bM4_INTC_SEL123_INTSEL3 (*((volatile unsigned int *)(0x42A2490CUL)))
#define bM4_INTC_SEL123_INTSEL4 (*((volatile unsigned int *)(0x42A24910UL)))
#define bM4_INTC_SEL123_INTSEL5 (*((volatile unsigned int *)(0x42A24914UL)))
#define bM4_INTC_SEL123_INTSEL6 (*((volatile unsigned int *)(0x42A24918UL)))
#define bM4_INTC_SEL123_INTSEL7 (*((volatile unsigned int *)(0x42A2491CUL)))
#define bM4_INTC_SEL123_INTSEL8 (*((volatile unsigned int *)(0x42A24920UL)))
#define bM4_INTC_SEL124_INTSEL0 (*((volatile unsigned int *)(0x42A24980UL)))
#define bM4_INTC_SEL124_INTSEL1 (*((volatile unsigned int *)(0x42A24984UL)))
#define bM4_INTC_SEL124_INTSEL2 (*((volatile unsigned int *)(0x42A24988UL)))
#define bM4_INTC_SEL124_INTSEL3 (*((volatile unsigned int *)(0x42A2498CUL)))
#define bM4_INTC_SEL124_INTSEL4 (*((volatile unsigned int *)(0x42A24990UL)))
#define bM4_INTC_SEL124_INTSEL5 (*((volatile unsigned int *)(0x42A24994UL)))
#define bM4_INTC_SEL124_INTSEL6 (*((volatile unsigned int *)(0x42A24998UL)))
#define bM4_INTC_SEL124_INTSEL7 (*((volatile unsigned int *)(0x42A2499CUL)))
#define bM4_INTC_SEL124_INTSEL8 (*((volatile unsigned int *)(0x42A249A0UL)))
#define bM4_INTC_SEL125_INTSEL0 (*((volatile unsigned int *)(0x42A24A00UL)))
#define bM4_INTC_SEL125_INTSEL1 (*((volatile unsigned int *)(0x42A24A04UL)))
#define bM4_INTC_SEL125_INTSEL2 (*((volatile unsigned int *)(0x42A24A08UL)))
#define bM4_INTC_SEL125_INTSEL3 (*((volatile unsigned int *)(0x42A24A0CUL)))
#define bM4_INTC_SEL125_INTSEL4 (*((volatile unsigned int *)(0x42A24A10UL)))
#define bM4_INTC_SEL125_INTSEL5 (*((volatile unsigned int *)(0x42A24A14UL)))
#define bM4_INTC_SEL125_INTSEL6 (*((volatile unsigned int *)(0x42A24A18UL)))
#define bM4_INTC_SEL125_INTSEL7 (*((volatile unsigned int *)(0x42A24A1CUL)))
#define bM4_INTC_SEL125_INTSEL8 (*((volatile unsigned int *)(0x42A24A20UL)))
#define bM4_INTC_SEL126_INTSEL0 (*((volatile unsigned int *)(0x42A24A80UL)))
#define bM4_INTC_SEL126_INTSEL1 (*((volatile unsigned int *)(0x42A24A84UL)))
#define bM4_INTC_SEL126_INTSEL2 (*((volatile unsigned int *)(0x42A24A88UL)))
#define bM4_INTC_SEL126_INTSEL3 (*((volatile unsigned int *)(0x42A24A8CUL)))
#define bM4_INTC_SEL126_INTSEL4 (*((volatile unsigned int *)(0x42A24A90UL)))
#define bM4_INTC_SEL126_INTSEL5 (*((volatile unsigned int *)(0x42A24A94UL)))
#define bM4_INTC_SEL126_INTSEL6 (*((volatile unsigned int *)(0x42A24A98UL)))
#define bM4_INTC_SEL126_INTSEL7 (*((volatile unsigned int *)(0x42A24A9CUL)))
#define bM4_INTC_SEL126_INTSEL8 (*((volatile unsigned int *)(0x42A24AA0UL)))
#define bM4_INTC_SEL127_INTSEL0 (*((volatile unsigned int *)(0x42A24B00UL)))
#define bM4_INTC_SEL127_INTSEL1 (*((volatile unsigned int *)(0x42A24B04UL)))
#define bM4_INTC_SEL127_INTSEL2 (*((volatile unsigned int *)(0x42A24B08UL)))
#define bM4_INTC_SEL127_INTSEL3 (*((volatile unsigned int *)(0x42A24B0CUL)))
#define bM4_INTC_SEL127_INTSEL4 (*((volatile unsigned int *)(0x42A24B10UL)))
#define bM4_INTC_SEL127_INTSEL5 (*((volatile unsigned int *)(0x42A24B14UL)))
#define bM4_INTC_SEL127_INTSEL6 (*((volatile unsigned int *)(0x42A24B18UL)))
#define bM4_INTC_SEL127_INTSEL7 (*((volatile unsigned int *)(0x42A24B1CUL)))
#define bM4_INTC_SEL127_INTSEL8 (*((volatile unsigned int *)(0x42A24B20UL)))
#define bM4_INTC_VSSEL128_VSEL0 (*((volatile unsigned int *)(0x42A24B80UL)))
#define bM4_INTC_VSSEL128_VSEL1 (*((volatile unsigned int *)(0x42A24B84UL)))
#define bM4_INTC_VSSEL128_VSEL2 (*((volatile unsigned int *)(0x42A24B88UL)))
#define bM4_INTC_VSSEL128_VSEL3 (*((volatile unsigned int *)(0x42A24B8CUL)))
#define bM4_INTC_VSSEL128_VSEL4 (*((volatile unsigned int *)(0x42A24B90UL)))
#define bM4_INTC_VSSEL128_VSEL5 (*((volatile unsigned int *)(0x42A24B94UL)))
#define bM4_INTC_VSSEL128_VSEL6 (*((volatile unsigned int *)(0x42A24B98UL)))
#define bM4_INTC_VSSEL128_VSEL7 (*((volatile unsigned int *)(0x42A24B9CUL)))
#define bM4_INTC_VSSEL128_VSEL8 (*((volatile unsigned int *)(0x42A24BA0UL)))
#define bM4_INTC_VSSEL128_VSEL9 (*((volatile unsigned int *)(0x42A24BA4UL)))
#define bM4_INTC_VSSEL128_VSEL10 (*((volatile unsigned int *)(0x42A24BA8UL)))
#define bM4_INTC_VSSEL128_VSEL11 (*((volatile unsigned int *)(0x42A24BACUL)))
#define bM4_INTC_VSSEL128_VSEL12 (*((volatile unsigned int *)(0x42A24BB0UL)))
#define bM4_INTC_VSSEL128_VSEL13 (*((volatile unsigned int *)(0x42A24BB4UL)))
#define bM4_INTC_VSSEL128_VSEL14 (*((volatile unsigned int *)(0x42A24BB8UL)))
#define bM4_INTC_VSSEL128_VSEL15 (*((volatile unsigned int *)(0x42A24BBCUL)))
#define bM4_INTC_VSSEL128_VSEL16 (*((volatile unsigned int *)(0x42A24BC0UL)))
#define bM4_INTC_VSSEL128_VSEL17 (*((volatile unsigned int *)(0x42A24BC4UL)))
#define bM4_INTC_VSSEL128_VSEL18 (*((volatile unsigned int *)(0x42A24BC8UL)))
#define bM4_INTC_VSSEL128_VSEL19 (*((volatile unsigned int *)(0x42A24BCCUL)))
#define bM4_INTC_VSSEL128_VSEL20 (*((volatile unsigned int *)(0x42A24BD0UL)))
#define bM4_INTC_VSSEL128_VSEL21 (*((volatile unsigned int *)(0x42A24BD4UL)))
#define bM4_INTC_VSSEL128_VSEL22 (*((volatile unsigned int *)(0x42A24BD8UL)))
#define bM4_INTC_VSSEL128_VSEL23 (*((volatile unsigned int *)(0x42A24BDCUL)))
#define bM4_INTC_VSSEL128_VSEL24 (*((volatile unsigned int *)(0x42A24BE0UL)))
#define bM4_INTC_VSSEL128_VSEL25 (*((volatile unsigned int *)(0x42A24BE4UL)))
#define bM4_INTC_VSSEL128_VSEL26 (*((volatile unsigned int *)(0x42A24BE8UL)))
#define bM4_INTC_VSSEL128_VSEL27 (*((volatile unsigned int *)(0x42A24BECUL)))
#define bM4_INTC_VSSEL128_VSEL28 (*((volatile unsigned int *)(0x42A24BF0UL)))
#define bM4_INTC_VSSEL128_VSEL29 (*((volatile unsigned int *)(0x42A24BF4UL)))
#define bM4_INTC_VSSEL128_VSEL30 (*((volatile unsigned int *)(0x42A24BF8UL)))
#define bM4_INTC_VSSEL128_VSEL31 (*((volatile unsigned int *)(0x42A24BFCUL)))
#define bM4_INTC_VSSEL129_VSEL0 (*((volatile unsigned int *)(0x42A24C00UL)))
#define bM4_INTC_VSSEL129_VSEL1 (*((volatile unsigned int *)(0x42A24C04UL)))
#define bM4_INTC_VSSEL129_VSEL2 (*((volatile unsigned int *)(0x42A24C08UL)))
#define bM4_INTC_VSSEL129_VSEL3 (*((volatile unsigned int *)(0x42A24C0CUL)))
#define bM4_INTC_VSSEL129_VSEL4 (*((volatile unsigned int *)(0x42A24C10UL)))
#define bM4_INTC_VSSEL129_VSEL5 (*((volatile unsigned int *)(0x42A24C14UL)))
#define bM4_INTC_VSSEL129_VSEL6 (*((volatile unsigned int *)(0x42A24C18UL)))
#define bM4_INTC_VSSEL129_VSEL7 (*((volatile unsigned int *)(0x42A24C1CUL)))
#define bM4_INTC_VSSEL129_VSEL8 (*((volatile unsigned int *)(0x42A24C20UL)))
#define bM4_INTC_VSSEL129_VSEL9 (*((volatile unsigned int *)(0x42A24C24UL)))
#define bM4_INTC_VSSEL129_VSEL10 (*((volatile unsigned int *)(0x42A24C28UL)))
#define bM4_INTC_VSSEL129_VSEL11 (*((volatile unsigned int *)(0x42A24C2CUL)))
#define bM4_INTC_VSSEL129_VSEL12 (*((volatile unsigned int *)(0x42A24C30UL)))
#define bM4_INTC_VSSEL129_VSEL13 (*((volatile unsigned int *)(0x42A24C34UL)))
#define bM4_INTC_VSSEL129_VSEL14 (*((volatile unsigned int *)(0x42A24C38UL)))
#define bM4_INTC_VSSEL129_VSEL15 (*((volatile unsigned int *)(0x42A24C3CUL)))
#define bM4_INTC_VSSEL129_VSEL16 (*((volatile unsigned int *)(0x42A24C40UL)))
#define bM4_INTC_VSSEL129_VSEL17 (*((volatile unsigned int *)(0x42A24C44UL)))
#define bM4_INTC_VSSEL129_VSEL18 (*((volatile unsigned int *)(0x42A24C48UL)))
#define bM4_INTC_VSSEL129_VSEL19 (*((volatile unsigned int *)(0x42A24C4CUL)))
#define bM4_INTC_VSSEL129_VSEL20 (*((volatile unsigned int *)(0x42A24C50UL)))
#define bM4_INTC_VSSEL129_VSEL21 (*((volatile unsigned int *)(0x42A24C54UL)))
#define bM4_INTC_VSSEL129_VSEL22 (*((volatile unsigned int *)(0x42A24C58UL)))
#define bM4_INTC_VSSEL129_VSEL23 (*((volatile unsigned int *)(0x42A24C5CUL)))
#define bM4_INTC_VSSEL129_VSEL24 (*((volatile unsigned int *)(0x42A24C60UL)))
#define bM4_INTC_VSSEL129_VSEL25 (*((volatile unsigned int *)(0x42A24C64UL)))
#define bM4_INTC_VSSEL129_VSEL26 (*((volatile unsigned int *)(0x42A24C68UL)))
#define bM4_INTC_VSSEL129_VSEL27 (*((volatile unsigned int *)(0x42A24C6CUL)))
#define bM4_INTC_VSSEL129_VSEL28 (*((volatile unsigned int *)(0x42A24C70UL)))
#define bM4_INTC_VSSEL129_VSEL29 (*((volatile unsigned int *)(0x42A24C74UL)))
#define bM4_INTC_VSSEL129_VSEL30 (*((volatile unsigned int *)(0x42A24C78UL)))
#define bM4_INTC_VSSEL129_VSEL31 (*((volatile unsigned int *)(0x42A24C7CUL)))
#define bM4_INTC_VSSEL130_VSEL0 (*((volatile unsigned int *)(0x42A24C80UL)))
#define bM4_INTC_VSSEL130_VSEL1 (*((volatile unsigned int *)(0x42A24C84UL)))
#define bM4_INTC_VSSEL130_VSEL2 (*((volatile unsigned int *)(0x42A24C88UL)))
#define bM4_INTC_VSSEL130_VSEL3 (*((volatile unsigned int *)(0x42A24C8CUL)))
#define bM4_INTC_VSSEL130_VSEL4 (*((volatile unsigned int *)(0x42A24C90UL)))
#define bM4_INTC_VSSEL130_VSEL5 (*((volatile unsigned int *)(0x42A24C94UL)))
#define bM4_INTC_VSSEL130_VSEL6 (*((volatile unsigned int *)(0x42A24C98UL)))
#define bM4_INTC_VSSEL130_VSEL7 (*((volatile unsigned int *)(0x42A24C9CUL)))
#define bM4_INTC_VSSEL130_VSEL8 (*((volatile unsigned int *)(0x42A24CA0UL)))
#define bM4_INTC_VSSEL130_VSEL9 (*((volatile unsigned int *)(0x42A24CA4UL)))
#define bM4_INTC_VSSEL130_VSEL10 (*((volatile unsigned int *)(0x42A24CA8UL)))
#define bM4_INTC_VSSEL130_VSEL11 (*((volatile unsigned int *)(0x42A24CACUL)))
#define bM4_INTC_VSSEL130_VSEL12 (*((volatile unsigned int *)(0x42A24CB0UL)))
#define bM4_INTC_VSSEL130_VSEL13 (*((volatile unsigned int *)(0x42A24CB4UL)))
#define bM4_INTC_VSSEL130_VSEL14 (*((volatile unsigned int *)(0x42A24CB8UL)))
#define bM4_INTC_VSSEL130_VSEL15 (*((volatile unsigned int *)(0x42A24CBCUL)))
#define bM4_INTC_VSSEL130_VSEL16 (*((volatile unsigned int *)(0x42A24CC0UL)))
#define bM4_INTC_VSSEL130_VSEL17 (*((volatile unsigned int *)(0x42A24CC4UL)))
#define bM4_INTC_VSSEL130_VSEL18 (*((volatile unsigned int *)(0x42A24CC8UL)))
#define bM4_INTC_VSSEL130_VSEL19 (*((volatile unsigned int *)(0x42A24CCCUL)))
#define bM4_INTC_VSSEL130_VSEL20 (*((volatile unsigned int *)(0x42A24CD0UL)))
#define bM4_INTC_VSSEL130_VSEL21 (*((volatile unsigned int *)(0x42A24CD4UL)))
#define bM4_INTC_VSSEL130_VSEL22 (*((volatile unsigned int *)(0x42A24CD8UL)))
#define bM4_INTC_VSSEL130_VSEL23 (*((volatile unsigned int *)(0x42A24CDCUL)))
#define bM4_INTC_VSSEL130_VSEL24 (*((volatile unsigned int *)(0x42A24CE0UL)))
#define bM4_INTC_VSSEL130_VSEL25 (*((volatile unsigned int *)(0x42A24CE4UL)))
#define bM4_INTC_VSSEL130_VSEL26 (*((volatile unsigned int *)(0x42A24CE8UL)))
#define bM4_INTC_VSSEL130_VSEL27 (*((volatile unsigned int *)(0x42A24CECUL)))
#define bM4_INTC_VSSEL130_VSEL28 (*((volatile unsigned int *)(0x42A24CF0UL)))
#define bM4_INTC_VSSEL130_VSEL29 (*((volatile unsigned int *)(0x42A24CF4UL)))
#define bM4_INTC_VSSEL130_VSEL30 (*((volatile unsigned int *)(0x42A24CF8UL)))
#define bM4_INTC_VSSEL130_VSEL31 (*((volatile unsigned int *)(0x42A24CFCUL)))
#define bM4_INTC_VSSEL131_VSEL0 (*((volatile unsigned int *)(0x42A24D00UL)))
#define bM4_INTC_VSSEL131_VSEL1 (*((volatile unsigned int *)(0x42A24D04UL)))
#define bM4_INTC_VSSEL131_VSEL2 (*((volatile unsigned int *)(0x42A24D08UL)))
#define bM4_INTC_VSSEL131_VSEL3 (*((volatile unsigned int *)(0x42A24D0CUL)))
#define bM4_INTC_VSSEL131_VSEL4 (*((volatile unsigned int *)(0x42A24D10UL)))
#define bM4_INTC_VSSEL131_VSEL5 (*((volatile unsigned int *)(0x42A24D14UL)))
#define bM4_INTC_VSSEL131_VSEL6 (*((volatile unsigned int *)(0x42A24D18UL)))
#define bM4_INTC_VSSEL131_VSEL7 (*((volatile unsigned int *)(0x42A24D1CUL)))
#define bM4_INTC_VSSEL131_VSEL8 (*((volatile unsigned int *)(0x42A24D20UL)))
#define bM4_INTC_VSSEL131_VSEL9 (*((volatile unsigned int *)(0x42A24D24UL)))
