MarlinFirmware/Marlin/Marlin/lib/h32_core/main/hdsc32core/common/hc32f46x.h
#define bM4_INTC_VSSEL131_VSEL10 (*((volatile unsigned int *)(0x42A24D28UL)))
#define bM4_INTC_VSSEL131_VSEL11 (*((volatile unsigned int *)(0x42A24D2CUL)))
#define bM4_INTC_VSSEL131_VSEL12 (*((volatile unsigned int *)(0x42A24D30UL)))
#define bM4_INTC_VSSEL131_VSEL13 (*((volatile unsigned int *)(0x42A24D34UL)))
#define bM4_INTC_VSSEL131_VSEL14 (*((volatile unsigned int *)(0x42A24D38UL)))
#define bM4_INTC_VSSEL131_VSEL15 (*((volatile unsigned int *)(0x42A24D3CUL)))
#define bM4_INTC_VSSEL131_VSEL16 (*((volatile unsigned int *)(0x42A24D40UL)))
#define bM4_INTC_VSSEL131_VSEL17 (*((volatile unsigned int *)(0x42A24D44UL)))
#define bM4_INTC_VSSEL131_VSEL18 (*((volatile unsigned int *)(0x42A24D48UL)))
#define bM4_INTC_VSSEL131_VSEL19 (*((volatile unsigned int *)(0x42A24D4CUL)))
#define bM4_INTC_VSSEL131_VSEL20 (*((volatile unsigned int *)(0x42A24D50UL)))
#define bM4_INTC_VSSEL131_VSEL21 (*((volatile unsigned int *)(0x42A24D54UL)))
#define bM4_INTC_VSSEL131_VSEL22 (*((volatile unsigned int *)(0x42A24D58UL)))
#define bM4_INTC_VSSEL131_VSEL23 (*((volatile unsigned int *)(0x42A24D5CUL)))
#define bM4_INTC_VSSEL131_VSEL24 (*((volatile unsigned int *)(0x42A24D60UL)))
#define bM4_INTC_VSSEL131_VSEL25 (*((volatile unsigned int *)(0x42A24D64UL)))
#define bM4_INTC_VSSEL131_VSEL26 (*((volatile unsigned int *)(0x42A24D68UL)))
#define bM4_INTC_VSSEL131_VSEL27 (*((volatile unsigned int *)(0x42A24D6CUL)))
#define bM4_INTC_VSSEL131_VSEL28 (*((volatile unsigned int *)(0x42A24D70UL)))
#define bM4_INTC_VSSEL131_VSEL29 (*((volatile unsigned int *)(0x42A24D74UL)))
#define bM4_INTC_VSSEL131_VSEL30 (*((volatile unsigned int *)(0x42A24D78UL)))
#define bM4_INTC_VSSEL131_VSEL31 (*((volatile unsigned int *)(0x42A24D7CUL)))
#define bM4_INTC_VSSEL132_VSEL0 (*((volatile unsigned int *)(0x42A24D80UL)))
#define bM4_INTC_VSSEL132_VSEL1 (*((volatile unsigned int *)(0x42A24D84UL)))
#define bM4_INTC_VSSEL132_VSEL2 (*((volatile unsigned int *)(0x42A24D88UL)))
#define bM4_INTC_VSSEL132_VSEL3 (*((volatile unsigned int *)(0x42A24D8CUL)))
#define bM4_INTC_VSSEL132_VSEL4 (*((volatile unsigned int *)(0x42A24D90UL)))
#define bM4_INTC_VSSEL132_VSEL5 (*((volatile unsigned int *)(0x42A24D94UL)))
#define bM4_INTC_VSSEL132_VSEL6 (*((volatile unsigned int *)(0x42A24D98UL)))
#define bM4_INTC_VSSEL132_VSEL7 (*((volatile unsigned int *)(0x42A24D9CUL)))
#define bM4_INTC_VSSEL132_VSEL8 (*((volatile unsigned int *)(0x42A24DA0UL)))
#define bM4_INTC_VSSEL132_VSEL9 (*((volatile unsigned int *)(0x42A24DA4UL)))
#define bM4_INTC_VSSEL132_VSEL10 (*((volatile unsigned int *)(0x42A24DA8UL)))
#define bM4_INTC_VSSEL132_VSEL11 (*((volatile unsigned int *)(0x42A24DACUL)))
#define bM4_INTC_VSSEL132_VSEL12 (*((volatile unsigned int *)(0x42A24DB0UL)))
#define bM4_INTC_VSSEL132_VSEL13 (*((volatile unsigned int *)(0x42A24DB4UL)))
#define bM4_INTC_VSSEL132_VSEL14 (*((volatile unsigned int *)(0x42A24DB8UL)))
#define bM4_INTC_VSSEL132_VSEL15 (*((volatile unsigned int *)(0x42A24DBCUL)))
#define bM4_INTC_VSSEL132_VSEL16 (*((volatile unsigned int *)(0x42A24DC0UL)))
#define bM4_INTC_VSSEL132_VSEL17 (*((volatile unsigned int *)(0x42A24DC4UL)))
#define bM4_INTC_VSSEL132_VSEL18 (*((volatile unsigned int *)(0x42A24DC8UL)))
#define bM4_INTC_VSSEL132_VSEL19 (*((volatile unsigned int *)(0x42A24DCCUL)))
#define bM4_INTC_VSSEL132_VSEL20 (*((volatile unsigned int *)(0x42A24DD0UL)))
#define bM4_INTC_VSSEL132_VSEL21 (*((volatile unsigned int *)(0x42A24DD4UL)))
#define bM4_INTC_VSSEL132_VSEL22 (*((volatile unsigned int *)(0x42A24DD8UL)))
#define bM4_INTC_VSSEL132_VSEL23 (*((volatile unsigned int *)(0x42A24DDCUL)))
#define bM4_INTC_VSSEL132_VSEL24 (*((volatile unsigned int *)(0x42A24DE0UL)))
#define bM4_INTC_VSSEL132_VSEL25 (*((volatile unsigned int *)(0x42A24DE4UL)))
#define bM4_INTC_VSSEL132_VSEL26 (*((volatile unsigned int *)(0x42A24DE8UL)))
#define bM4_INTC_VSSEL132_VSEL27 (*((volatile unsigned int *)(0x42A24DECUL)))
#define bM4_INTC_VSSEL132_VSEL28 (*((volatile unsigned int *)(0x42A24DF0UL)))
#define bM4_INTC_VSSEL132_VSEL29 (*((volatile unsigned int *)(0x42A24DF4UL)))
#define bM4_INTC_VSSEL132_VSEL30 (*((volatile unsigned int *)(0x42A24DF8UL)))
#define bM4_INTC_VSSEL132_VSEL31 (*((volatile unsigned int *)(0x42A24DFCUL)))
#define bM4_INTC_VSSEL133_VSEL0 (*((volatile unsigned int *)(0x42A24E00UL)))
#define bM4_INTC_VSSEL133_VSEL1 (*((volatile unsigned int *)(0x42A24E04UL)))
#define bM4_INTC_VSSEL133_VSEL2 (*((volatile unsigned int *)(0x42A24E08UL)))
#define bM4_INTC_VSSEL133_VSEL3 (*((volatile unsigned int *)(0x42A24E0CUL)))
#define bM4_INTC_VSSEL133_VSEL4 (*((volatile unsigned int *)(0x42A24E10UL)))
#define bM4_INTC_VSSEL133_VSEL5 (*((volatile unsigned int *)(0x42A24E14UL)))
#define bM4_INTC_VSSEL133_VSEL6 (*((volatile unsigned int *)(0x42A24E18UL)))
#define bM4_INTC_VSSEL133_VSEL7 (*((volatile unsigned int *)(0x42A24E1CUL)))
#define bM4_INTC_VSSEL133_VSEL8 (*((volatile unsigned int *)(0x42A24E20UL)))
#define bM4_INTC_VSSEL133_VSEL9 (*((volatile unsigned int *)(0x42A24E24UL)))
#define bM4_INTC_VSSEL133_VSEL10 (*((volatile unsigned int *)(0x42A24E28UL)))
#define bM4_INTC_VSSEL133_VSEL11 (*((volatile unsigned int *)(0x42A24E2CUL)))
#define bM4_INTC_VSSEL133_VSEL12 (*((volatile unsigned int *)(0x42A24E30UL)))
#define bM4_INTC_VSSEL133_VSEL13 (*((volatile unsigned int *)(0x42A24E34UL)))
#define bM4_INTC_VSSEL133_VSEL14 (*((volatile unsigned int *)(0x42A24E38UL)))
#define bM4_INTC_VSSEL133_VSEL15 (*((volatile unsigned int *)(0x42A24E3CUL)))
#define bM4_INTC_VSSEL133_VSEL16 (*((volatile unsigned int *)(0x42A24E40UL)))
#define bM4_INTC_VSSEL133_VSEL17 (*((volatile unsigned int *)(0x42A24E44UL)))
#define bM4_INTC_VSSEL133_VSEL18 (*((volatile unsigned int *)(0x42A24E48UL)))
#define bM4_INTC_VSSEL133_VSEL19 (*((volatile unsigned int *)(0x42A24E4CUL)))
#define bM4_INTC_VSSEL133_VSEL20 (*((volatile unsigned int *)(0x42A24E50UL)))
#define bM4_INTC_VSSEL133_VSEL21 (*((volatile unsigned int *)(0x42A24E54UL)))
#define bM4_INTC_VSSEL133_VSEL22 (*((volatile unsigned int *)(0x42A24E58UL)))
#define bM4_INTC_VSSEL133_VSEL23 (*((volatile unsigned int *)(0x42A24E5CUL)))
#define bM4_INTC_VSSEL133_VSEL24 (*((volatile unsigned int *)(0x42A24E60UL)))
#define bM4_INTC_VSSEL133_VSEL25 (*((volatile unsigned int *)(0x42A24E64UL)))
#define bM4_INTC_VSSEL133_VSEL26 (*((volatile unsigned int *)(0x42A24E68UL)))
#define bM4_INTC_VSSEL133_VSEL27 (*((volatile unsigned int *)(0x42A24E6CUL)))
#define bM4_INTC_VSSEL133_VSEL28 (*((volatile unsigned int *)(0x42A24E70UL)))
#define bM4_INTC_VSSEL133_VSEL29 (*((volatile unsigned int *)(0x42A24E74UL)))
#define bM4_INTC_VSSEL133_VSEL30 (*((volatile unsigned int *)(0x42A24E78UL)))
#define bM4_INTC_VSSEL133_VSEL31 (*((volatile unsigned int *)(0x42A24E7CUL)))
#define bM4_INTC_VSSEL134_VSEL0 (*((volatile unsigned int *)(0x42A24E80UL)))
#define bM4_INTC_VSSEL134_VSEL1 (*((volatile unsigned int *)(0x42A24E84UL)))
#define bM4_INTC_VSSEL134_VSEL2 (*((volatile unsigned int *)(0x42A24E88UL)))
#define bM4_INTC_VSSEL134_VSEL3 (*((volatile unsigned int *)(0x42A24E8CUL)))
#define bM4_INTC_VSSEL134_VSEL4 (*((volatile unsigned int *)(0x42A24E90UL)))
#define bM4_INTC_VSSEL134_VSEL5 (*((volatile unsigned int *)(0x42A24E94UL)))
#define bM4_INTC_VSSEL134_VSEL6 (*((volatile unsigned int *)(0x42A24E98UL)))
#define bM4_INTC_VSSEL134_VSEL7 (*((volatile unsigned int *)(0x42A24E9CUL)))
#define bM4_INTC_VSSEL134_VSEL8 (*((volatile unsigned int *)(0x42A24EA0UL)))
#define bM4_INTC_VSSEL134_VSEL9 (*((volatile unsigned int *)(0x42A24EA4UL)))
#define bM4_INTC_VSSEL134_VSEL10 (*((volatile unsigned int *)(0x42A24EA8UL)))
#define bM4_INTC_VSSEL134_VSEL11 (*((volatile unsigned int *)(0x42A24EACUL)))
#define bM4_INTC_VSSEL134_VSEL12 (*((volatile unsigned int *)(0x42A24EB0UL)))
#define bM4_INTC_VSSEL134_VSEL13 (*((volatile unsigned int *)(0x42A24EB4UL)))
#define bM4_INTC_VSSEL134_VSEL14 (*((volatile unsigned int *)(0x42A24EB8UL)))
#define bM4_INTC_VSSEL134_VSEL15 (*((volatile unsigned int *)(0x42A24EBCUL)))
#define bM4_INTC_VSSEL134_VSEL16 (*((volatile unsigned int *)(0x42A24EC0UL)))
#define bM4_INTC_VSSEL134_VSEL17 (*((volatile unsigned int *)(0x42A24EC4UL)))
#define bM4_INTC_VSSEL134_VSEL18 (*((volatile unsigned int *)(0x42A24EC8UL)))
#define bM4_INTC_VSSEL134_VSEL19 (*((volatile unsigned int *)(0x42A24ECCUL)))
#define bM4_INTC_VSSEL134_VSEL20 (*((volatile unsigned int *)(0x42A24ED0UL)))
#define bM4_INTC_VSSEL134_VSEL21 (*((volatile unsigned int *)(0x42A24ED4UL)))
#define bM4_INTC_VSSEL134_VSEL22 (*((volatile unsigned int *)(0x42A24ED8UL)))
#define bM4_INTC_VSSEL134_VSEL23 (*((volatile unsigned int *)(0x42A24EDCUL)))
#define bM4_INTC_VSSEL134_VSEL24 (*((volatile unsigned int *)(0x42A24EE0UL)))
#define bM4_INTC_VSSEL134_VSEL25 (*((volatile unsigned int *)(0x42A24EE4UL)))
#define bM4_INTC_VSSEL134_VSEL26 (*((volatile unsigned int *)(0x42A24EE8UL)))
#define bM4_INTC_VSSEL134_VSEL27 (*((volatile unsigned int *)(0x42A24EECUL)))
#define bM4_INTC_VSSEL134_VSEL28 (*((volatile unsigned int *)(0x42A24EF0UL)))
#define bM4_INTC_VSSEL134_VSEL29 (*((volatile unsigned int *)(0x42A24EF4UL)))
#define bM4_INTC_VSSEL134_VSEL30 (*((volatile unsigned int *)(0x42A24EF8UL)))
#define bM4_INTC_VSSEL134_VSEL31 (*((volatile unsigned int *)(0x42A24EFCUL)))
#define bM4_INTC_VSSEL135_VSEL0 (*((volatile unsigned int *)(0x42A24F00UL)))
#define bM4_INTC_VSSEL135_VSEL1 (*((volatile unsigned int *)(0x42A24F04UL)))
#define bM4_INTC_VSSEL135_VSEL2 (*((volatile unsigned int *)(0x42A24F08UL)))
#define bM4_INTC_VSSEL135_VSEL3 (*((volatile unsigned int *)(0x42A24F0CUL)))
#define bM4_INTC_VSSEL135_VSEL4 (*((volatile unsigned int *)(0x42A24F10UL)))
#define bM4_INTC_VSSEL135_VSEL5 (*((volatile unsigned int *)(0x42A24F14UL)))
#define bM4_INTC_VSSEL135_VSEL6 (*((volatile unsigned int *)(0x42A24F18UL)))
#define bM4_INTC_VSSEL135_VSEL7 (*((volatile unsigned int *)(0x42A24F1CUL)))
#define bM4_INTC_VSSEL135_VSEL8 (*((volatile unsigned int *)(0x42A24F20UL)))
#define bM4_INTC_VSSEL135_VSEL9 (*((volatile unsigned int *)(0x42A24F24UL)))
#define bM4_INTC_VSSEL135_VSEL10 (*((volatile unsigned int *)(0x42A24F28UL)))
#define bM4_INTC_VSSEL135_VSEL11 (*((volatile unsigned int *)(0x42A24F2CUL)))
#define bM4_INTC_VSSEL135_VSEL12 (*((volatile unsigned int *)(0x42A24F30UL)))
#define bM4_INTC_VSSEL135_VSEL13 (*((volatile unsigned int *)(0x42A24F34UL)))
#define bM4_INTC_VSSEL135_VSEL14 (*((volatile unsigned int *)(0x42A24F38UL)))
#define bM4_INTC_VSSEL135_VSEL15 (*((volatile unsigned int *)(0x42A24F3CUL)))
#define bM4_INTC_VSSEL135_VSEL16 (*((volatile unsigned int *)(0x42A24F40UL)))
#define bM4_INTC_VSSEL135_VSEL17 (*((volatile unsigned int *)(0x42A24F44UL)))
#define bM4_INTC_VSSEL135_VSEL18 (*((volatile unsigned int *)(0x42A24F48UL)))
#define bM4_INTC_VSSEL135_VSEL19 (*((volatile unsigned int *)(0x42A24F4CUL)))
#define bM4_INTC_VSSEL135_VSEL20 (*((volatile unsigned int *)(0x42A24F50UL)))
#define bM4_INTC_VSSEL135_VSEL21 (*((volatile unsigned int *)(0x42A24F54UL)))
#define bM4_INTC_VSSEL135_VSEL22 (*((volatile unsigned int *)(0x42A24F58UL)))
#define bM4_INTC_VSSEL135_VSEL23 (*((volatile unsigned int *)(0x42A24F5CUL)))
#define bM4_INTC_VSSEL135_VSEL24 (*((volatile unsigned int *)(0x42A24F60UL)))
#define bM4_INTC_VSSEL135_VSEL25 (*((volatile unsigned int *)(0x42A24F64UL)))
#define bM4_INTC_VSSEL135_VSEL26 (*((volatile unsigned int *)(0x42A24F68UL)))
#define bM4_INTC_VSSEL135_VSEL27 (*((volatile unsigned int *)(0x42A24F6CUL)))
#define bM4_INTC_VSSEL135_VSEL28 (*((volatile unsigned int *)(0x42A24F70UL)))
#define bM4_INTC_VSSEL135_VSEL29 (*((volatile unsigned int *)(0x42A24F74UL)))
#define bM4_INTC_VSSEL135_VSEL30 (*((volatile unsigned int *)(0x42A24F78UL)))
#define bM4_INTC_VSSEL135_VSEL31 (*((volatile unsigned int *)(0x42A24F7CUL)))
#define bM4_INTC_VSSEL136_VSEL0 (*((volatile unsigned int *)(0x42A24F80UL)))
#define bM4_INTC_VSSEL136_VSEL1 (*((volatile unsigned int *)(0x42A24F84UL)))
#define bM4_INTC_VSSEL136_VSEL2 (*((volatile unsigned int *)(0x42A24F88UL)))
#define bM4_INTC_VSSEL136_VSEL3 (*((volatile unsigned int *)(0x42A24F8CUL)))
#define bM4_INTC_VSSEL136_VSEL4 (*((volatile unsigned int *)(0x42A24F90UL)))
#define bM4_INTC_VSSEL136_VSEL5 (*((volatile unsigned int *)(0x42A24F94UL)))
#define bM4_INTC_VSSEL136_VSEL6 (*((volatile unsigned int *)(0x42A24F98UL)))
#define bM4_INTC_VSSEL136_VSEL7 (*((volatile unsigned int *)(0x42A24F9CUL)))
#define bM4_INTC_VSSEL136_VSEL8 (*((volatile unsigned int *)(0x42A24FA0UL)))
#define bM4_INTC_VSSEL136_VSEL9 (*((volatile unsigned int *)(0x42A24FA4UL)))
#define bM4_INTC_VSSEL136_VSEL10 (*((volatile unsigned int *)(0x42A24FA8UL)))
#define bM4_INTC_VSSEL136_VSEL11 (*((volatile unsigned int *)(0x42A24FACUL)))
#define bM4_INTC_VSSEL136_VSEL12 (*((volatile unsigned int *)(0x42A24FB0UL)))
#define bM4_INTC_VSSEL136_VSEL13 (*((volatile unsigned int *)(0x42A24FB4UL)))
#define bM4_INTC_VSSEL136_VSEL14 (*((volatile unsigned int *)(0x42A24FB8UL)))
#define bM4_INTC_VSSEL136_VSEL15 (*((volatile unsigned int *)(0x42A24FBCUL)))
#define bM4_INTC_VSSEL136_VSEL16 (*((volatile unsigned int *)(0x42A24FC0UL)))
#define bM4_INTC_VSSEL136_VSEL17 (*((volatile unsigned int *)(0x42A24FC4UL)))
#define bM4_INTC_VSSEL136_VSEL18 (*((volatile unsigned int *)(0x42A24FC8UL)))
#define bM4_INTC_VSSEL136_VSEL19 (*((volatile unsigned int *)(0x42A24FCCUL)))
#define bM4_INTC_VSSEL136_VSEL20 (*((volatile unsigned int *)(0x42A24FD0UL)))
#define bM4_INTC_VSSEL136_VSEL21 (*((volatile unsigned int *)(0x42A24FD4UL)))
#define bM4_INTC_VSSEL136_VSEL22 (*((volatile unsigned int *)(0x42A24FD8UL)))
#define bM4_INTC_VSSEL136_VSEL23 (*((volatile unsigned int *)(0x42A24FDCUL)))
#define bM4_INTC_VSSEL136_VSEL24 (*((volatile unsigned int *)(0x42A24FE0UL)))
#define bM4_INTC_VSSEL136_VSEL25 (*((volatile unsigned int *)(0x42A24FE4UL)))
#define bM4_INTC_VSSEL136_VSEL26 (*((volatile unsigned int *)(0x42A24FE8UL)))
#define bM4_INTC_VSSEL136_VSEL27 (*((volatile unsigned int *)(0x42A24FECUL)))
#define bM4_INTC_VSSEL136_VSEL28 (*((volatile unsigned int *)(0x42A24FF0UL)))
#define bM4_INTC_VSSEL136_VSEL29 (*((volatile unsigned int *)(0x42A24FF4UL)))
#define bM4_INTC_VSSEL136_VSEL30 (*((volatile unsigned int *)(0x42A24FF8UL)))
#define bM4_INTC_VSSEL136_VSEL31 (*((volatile unsigned int *)(0x42A24FFCUL)))
#define bM4_INTC_VSSEL137_VSEL0 (*((volatile unsigned int *)(0x42A25000UL)))
#define bM4_INTC_VSSEL137_VSEL1 (*((volatile unsigned int *)(0x42A25004UL)))
#define bM4_INTC_VSSEL137_VSEL2 (*((volatile unsigned int *)(0x42A25008UL)))
#define bM4_INTC_VSSEL137_VSEL3 (*((volatile unsigned int *)(0x42A2500CUL)))
#define bM4_INTC_VSSEL137_VSEL4 (*((volatile unsigned int *)(0x42A25010UL)))
#define bM4_INTC_VSSEL137_VSEL5 (*((volatile unsigned int *)(0x42A25014UL)))
#define bM4_INTC_VSSEL137_VSEL6 (*((volatile unsigned int *)(0x42A25018UL)))
#define bM4_INTC_VSSEL137_VSEL7 (*((volatile unsigned int *)(0x42A2501CUL)))
#define bM4_INTC_VSSEL137_VSEL8 (*((volatile unsigned int *)(0x42A25020UL)))
#define bM4_INTC_VSSEL137_VSEL9 (*((volatile unsigned int *)(0x42A25024UL)))
#define bM4_INTC_VSSEL137_VSEL10 (*((volatile unsigned int *)(0x42A25028UL)))
#define bM4_INTC_VSSEL137_VSEL11 (*((volatile unsigned int *)(0x42A2502CUL)))
#define bM4_INTC_VSSEL137_VSEL12 (*((volatile unsigned int *)(0x42A25030UL)))
#define bM4_INTC_VSSEL137_VSEL13 (*((volatile unsigned int *)(0x42A25034UL)))
#define bM4_INTC_VSSEL137_VSEL14 (*((volatile unsigned int *)(0x42A25038UL)))
#define bM4_INTC_VSSEL137_VSEL15 (*((volatile unsigned int *)(0x42A2503CUL)))
#define bM4_INTC_VSSEL137_VSEL16 (*((volatile unsigned int *)(0x42A25040UL)))
#define bM4_INTC_VSSEL137_VSEL17 (*((volatile unsigned int *)(0x42A25044UL)))
#define bM4_INTC_VSSEL137_VSEL18 (*((volatile unsigned int *)(0x42A25048UL)))
#define bM4_INTC_VSSEL137_VSEL19 (*((volatile unsigned int *)(0x42A2504CUL)))
#define bM4_INTC_VSSEL137_VSEL20 (*((volatile unsigned int *)(0x42A25050UL)))
#define bM4_INTC_VSSEL137_VSEL21 (*((volatile unsigned int *)(0x42A25054UL)))
#define bM4_INTC_VSSEL137_VSEL22 (*((volatile unsigned int *)(0x42A25058UL)))
#define bM4_INTC_VSSEL137_VSEL23 (*((volatile unsigned int *)(0x42A2505CUL)))
#define bM4_INTC_VSSEL137_VSEL24 (*((volatile unsigned int *)(0x42A25060UL)))
#define bM4_INTC_VSSEL137_VSEL25 (*((volatile unsigned int *)(0x42A25064UL)))
#define bM4_INTC_VSSEL137_VSEL26 (*((volatile unsigned int *)(0x42A25068UL)))
#define bM4_INTC_VSSEL137_VSEL27 (*((volatile unsigned int *)(0x42A2506CUL)))
#define bM4_INTC_VSSEL137_VSEL28 (*((volatile unsigned int *)(0x42A25070UL)))
#define bM4_INTC_VSSEL137_VSEL29 (*((volatile unsigned int *)(0x42A25074UL)))
#define bM4_INTC_VSSEL137_VSEL30 (*((volatile unsigned int *)(0x42A25078UL)))
#define bM4_INTC_VSSEL137_VSEL31 (*((volatile unsigned int *)(0x42A2507CUL)))
#define bM4_INTC_VSSEL138_VSEL0 (*((volatile unsigned int *)(0x42A25080UL)))
#define bM4_INTC_VSSEL138_VSEL1 (*((volatile unsigned int *)(0x42A25084UL)))
#define bM4_INTC_VSSEL138_VSEL2 (*((volatile unsigned int *)(0x42A25088UL)))
#define bM4_INTC_VSSEL138_VSEL3 (*((volatile unsigned int *)(0x42A2508CUL)))
#define bM4_INTC_VSSEL138_VSEL4 (*((volatile unsigned int *)(0x42A25090UL)))
#define bM4_INTC_VSSEL138_VSEL5 (*((volatile unsigned int *)(0x42A25094UL)))
#define bM4_INTC_VSSEL138_VSEL6 (*((volatile unsigned int *)(0x42A25098UL)))
#define bM4_INTC_VSSEL138_VSEL7 (*((volatile unsigned int *)(0x42A2509CUL)))
#define bM4_INTC_VSSEL138_VSEL8 (*((volatile unsigned int *)(0x42A250A0UL)))
#define bM4_INTC_VSSEL138_VSEL9 (*((volatile unsigned int *)(0x42A250A4UL)))
#define bM4_INTC_VSSEL138_VSEL10 (*((volatile unsigned int *)(0x42A250A8UL)))
#define bM4_INTC_VSSEL138_VSEL11 (*((volatile unsigned int *)(0x42A250ACUL)))
#define bM4_INTC_VSSEL138_VSEL12 (*((volatile unsigned int *)(0x42A250B0UL)))
#define bM4_INTC_VSSEL138_VSEL13 (*((volatile unsigned int *)(0x42A250B4UL)))
#define bM4_INTC_VSSEL138_VSEL14 (*((volatile unsigned int *)(0x42A250B8UL)))
#define bM4_INTC_VSSEL138_VSEL15 (*((volatile unsigned int *)(0x42A250BCUL)))
#define bM4_INTC_VSSEL138_VSEL16 (*((volatile unsigned int *)(0x42A250C0UL)))
#define bM4_INTC_VSSEL138_VSEL17 (*((volatile unsigned int *)(0x42A250C4UL)))
#define bM4_INTC_VSSEL138_VSEL18 (*((volatile unsigned int *)(0x42A250C8UL)))
#define bM4_INTC_VSSEL138_VSEL19 (*((volatile unsigned int *)(0x42A250CCUL)))
#define bM4_INTC_VSSEL138_VSEL20 (*((volatile unsigned int *)(0x42A250D0UL)))
#define bM4_INTC_VSSEL138_VSEL21 (*((volatile unsigned int *)(0x42A250D4UL)))
#define bM4_INTC_VSSEL138_VSEL22 (*((volatile unsigned int *)(0x42A250D8UL)))
#define bM4_INTC_VSSEL138_VSEL23 (*((volatile unsigned int *)(0x42A250DCUL)))
#define bM4_INTC_VSSEL138_VSEL24 (*((volatile unsigned int *)(0x42A250E0UL)))
#define bM4_INTC_VSSEL138_VSEL25 (*((volatile unsigned int *)(0x42A250E4UL)))
#define bM4_INTC_VSSEL138_VSEL26 (*((volatile unsigned int *)(0x42A250E8UL)))
#define bM4_INTC_VSSEL138_VSEL27 (*((volatile unsigned int *)(0x42A250ECUL)))
#define bM4_INTC_VSSEL138_VSEL28 (*((volatile unsigned int *)(0x42A250F0UL)))
#define bM4_INTC_VSSEL138_VSEL29 (*((volatile unsigned int *)(0x42A250F4UL)))
#define bM4_INTC_VSSEL138_VSEL30 (*((volatile unsigned int *)(0x42A250F8UL)))
#define bM4_INTC_VSSEL138_VSEL31 (*((volatile unsigned int *)(0x42A250FCUL)))
#define bM4_INTC_VSSEL139_VSEL0 (*((volatile unsigned int *)(0x42A25100UL)))
#define bM4_INTC_VSSEL139_VSEL1 (*((volatile unsigned int *)(0x42A25104UL)))
#define bM4_INTC_VSSEL139_VSEL2 (*((volatile unsigned int *)(0x42A25108UL)))
#define bM4_INTC_VSSEL139_VSEL3 (*((volatile unsigned int *)(0x42A2510CUL)))
#define bM4_INTC_VSSEL139_VSEL4 (*((volatile unsigned int *)(0x42A25110UL)))
#define bM4_INTC_VSSEL139_VSEL5 (*((volatile unsigned int *)(0x42A25114UL)))
#define bM4_INTC_VSSEL139_VSEL6 (*((volatile unsigned int *)(0x42A25118UL)))
#define bM4_INTC_VSSEL139_VSEL7 (*((volatile unsigned int *)(0x42A2511CUL)))
#define bM4_INTC_VSSEL139_VSEL8 (*((volatile unsigned int *)(0x42A25120UL)))
#define bM4_INTC_VSSEL139_VSEL9 (*((volatile unsigned int *)(0x42A25124UL)))
#define bM4_INTC_VSSEL139_VSEL10 (*((volatile unsigned int *)(0x42A25128UL)))
#define bM4_INTC_VSSEL139_VSEL11 (*((volatile unsigned int *)(0x42A2512CUL)))
#define bM4_INTC_VSSEL139_VSEL12 (*((volatile unsigned int *)(0x42A25130UL)))
#define bM4_INTC_VSSEL139_VSEL13 (*((volatile unsigned int *)(0x42A25134UL)))
#define bM4_INTC_VSSEL139_VSEL14 (*((volatile unsigned int *)(0x42A25138UL)))
#define bM4_INTC_VSSEL139_VSEL15 (*((volatile unsigned int *)(0x42A2513CUL)))
#define bM4_INTC_VSSEL139_VSEL16 (*((volatile unsigned int *)(0x42A25140UL)))
#define bM4_INTC_VSSEL139_VSEL17 (*((volatile unsigned int *)(0x42A25144UL)))
#define bM4_INTC_VSSEL139_VSEL18 (*((volatile unsigned int *)(0x42A25148UL)))
#define bM4_INTC_VSSEL139_VSEL19 (*((volatile unsigned int *)(0x42A2514CUL)))
#define bM4_INTC_VSSEL139_VSEL20 (*((volatile unsigned int *)(0x42A25150UL)))
#define bM4_INTC_VSSEL139_VSEL21 (*((volatile unsigned int *)(0x42A25154UL)))
#define bM4_INTC_VSSEL139_VSEL22 (*((volatile unsigned int *)(0x42A25158UL)))
#define bM4_INTC_VSSEL139_VSEL23 (*((volatile unsigned int *)(0x42A2515CUL)))
#define bM4_INTC_VSSEL139_VSEL24 (*((volatile unsigned int *)(0x42A25160UL)))
#define bM4_INTC_VSSEL139_VSEL25 (*((volatile unsigned int *)(0x42A25164UL)))
#define bM4_INTC_VSSEL139_VSEL26 (*((volatile unsigned int *)(0x42A25168UL)))
#define bM4_INTC_VSSEL139_VSEL27 (*((volatile unsigned int *)(0x42A2516CUL)))
#define bM4_INTC_VSSEL139_VSEL28 (*((volatile unsigned int *)(0x42A25170UL)))
#define bM4_INTC_VSSEL139_VSEL29 (*((volatile unsigned int *)(0x42A25174UL)))
#define bM4_INTC_VSSEL139_VSEL30 (*((volatile unsigned int *)(0x42A25178UL)))
#define bM4_INTC_VSSEL139_VSEL31 (*((volatile unsigned int *)(0x42A2517CUL)))
#define bM4_INTC_VSSEL140_VSEL0 (*((volatile unsigned int *)(0x42A25180UL)))
#define bM4_INTC_VSSEL140_VSEL1 (*((volatile unsigned int *)(0x42A25184UL)))
#define bM4_INTC_VSSEL140_VSEL2 (*((volatile unsigned int *)(0x42A25188UL)))
#define bM4_INTC_VSSEL140_VSEL3 (*((volatile unsigned int *)(0x42A2518CUL)))
#define bM4_INTC_VSSEL140_VSEL4 (*((volatile unsigned int *)(0x42A25190UL)))
#define bM4_INTC_VSSEL140_VSEL5 (*((volatile unsigned int *)(0x42A25194UL)))
#define bM4_INTC_VSSEL140_VSEL6 (*((volatile unsigned int *)(0x42A25198UL)))
#define bM4_INTC_VSSEL140_VSEL7 (*((volatile unsigned int *)(0x42A2519CUL)))
#define bM4_INTC_VSSEL140_VSEL8 (*((volatile unsigned int *)(0x42A251A0UL)))
#define bM4_INTC_VSSEL140_VSEL9 (*((volatile unsigned int *)(0x42A251A4UL)))
#define bM4_INTC_VSSEL140_VSEL10 (*((volatile unsigned int *)(0x42A251A8UL)))
#define bM4_INTC_VSSEL140_VSEL11 (*((volatile unsigned int *)(0x42A251ACUL)))
#define bM4_INTC_VSSEL140_VSEL12 (*((volatile unsigned int *)(0x42A251B0UL)))
#define bM4_INTC_VSSEL140_VSEL13 (*((volatile unsigned int *)(0x42A251B4UL)))
#define bM4_INTC_VSSEL140_VSEL14 (*((volatile unsigned int *)(0x42A251B8UL)))
#define bM4_INTC_VSSEL140_VSEL15 (*((volatile unsigned int *)(0x42A251BCUL)))
#define bM4_INTC_VSSEL140_VSEL16 (*((volatile unsigned int *)(0x42A251C0UL)))
#define bM4_INTC_VSSEL140_VSEL17 (*((volatile unsigned int *)(0x42A251C4UL)))
#define bM4_INTC_VSSEL140_VSEL18 (*((volatile unsigned int *)(0x42A251C8UL)))
#define bM4_INTC_VSSEL140_VSEL19 (*((volatile unsigned int *)(0x42A251CCUL)))
#define bM4_INTC_VSSEL140_VSEL20 (*((volatile unsigned int *)(0x42A251D0UL)))
#define bM4_INTC_VSSEL140_VSEL21 (*((volatile unsigned int *)(0x42A251D4UL)))
#define bM4_INTC_VSSEL140_VSEL22 (*((volatile unsigned int *)(0x42A251D8UL)))
#define bM4_INTC_VSSEL140_VSEL23 (*((volatile unsigned int *)(0x42A251DCUL)))
#define bM4_INTC_VSSEL140_VSEL24 (*((volatile unsigned int *)(0x42A251E0UL)))
#define bM4_INTC_VSSEL140_VSEL25 (*((volatile unsigned int *)(0x42A251E4UL)))
#define bM4_INTC_VSSEL140_VSEL26 (*((volatile unsigned int *)(0x42A251E8UL)))
#define bM4_INTC_VSSEL140_VSEL27 (*((volatile unsigned int *)(0x42A251ECUL)))
#define bM4_INTC_VSSEL140_VSEL28 (*((volatile unsigned int *)(0x42A251F0UL)))
#define bM4_INTC_VSSEL140_VSEL29 (*((volatile unsigned int *)(0x42A251F4UL)))
