MarlinFirmware/Marlin/Marlin/lib/h32_core/main/hdsc32core/common/hc32f46x.h
#define bM4_PORT_POTRB_POT15 (*((volatile unsigned int *)(0x42A703BCUL)))
#define bM4_PORT_PIDRC_PIN00 (*((volatile unsigned int *)(0x42A70400UL)))
#define bM4_PORT_PIDRC_PIN01 (*((volatile unsigned int *)(0x42A70404UL)))
#define bM4_PORT_PIDRC_PIN02 (*((volatile unsigned int *)(0x42A70408UL)))
#define bM4_PORT_PIDRC_PIN03 (*((volatile unsigned int *)(0x42A7040CUL)))
#define bM4_PORT_PIDRC_PIN04 (*((volatile unsigned int *)(0x42A70410UL)))
#define bM4_PORT_PIDRC_PIN05 (*((volatile unsigned int *)(0x42A70414UL)))
#define bM4_PORT_PIDRC_PIN06 (*((volatile unsigned int *)(0x42A70418UL)))
#define bM4_PORT_PIDRC_PIN07 (*((volatile unsigned int *)(0x42A7041CUL)))
#define bM4_PORT_PIDRC_PIN08 (*((volatile unsigned int *)(0x42A70420UL)))
#define bM4_PORT_PIDRC_PIN09 (*((volatile unsigned int *)(0x42A70424UL)))
#define bM4_PORT_PIDRC_PIN10 (*((volatile unsigned int *)(0x42A70428UL)))
#define bM4_PORT_PIDRC_PIN11 (*((volatile unsigned int *)(0x42A7042CUL)))
#define bM4_PORT_PIDRC_PIN12 (*((volatile unsigned int *)(0x42A70430UL)))
#define bM4_PORT_PIDRC_PIN13 (*((volatile unsigned int *)(0x42A70434UL)))
#define bM4_PORT_PIDRC_PIN14 (*((volatile unsigned int *)(0x42A70438UL)))
#define bM4_PORT_PIDRC_PIN15 (*((volatile unsigned int *)(0x42A7043CUL)))
#define bM4_PORT_PODRC_POUT00 (*((volatile unsigned int *)(0x42A70480UL)))
#define bM4_PORT_PODRC_POUT01 (*((volatile unsigned int *)(0x42A70484UL)))
#define bM4_PORT_PODRC_POUT02 (*((volatile unsigned int *)(0x42A70488UL)))
#define bM4_PORT_PODRC_POUT03 (*((volatile unsigned int *)(0x42A7048CUL)))
#define bM4_PORT_PODRC_POUT04 (*((volatile unsigned int *)(0x42A70490UL)))
#define bM4_PORT_PODRC_POUT05 (*((volatile unsigned int *)(0x42A70494UL)))
#define bM4_PORT_PODRC_POUT06 (*((volatile unsigned int *)(0x42A70498UL)))
#define bM4_PORT_PODRC_POUT07 (*((volatile unsigned int *)(0x42A7049CUL)))
#define bM4_PORT_PODRC_POUT08 (*((volatile unsigned int *)(0x42A704A0UL)))
#define bM4_PORT_PODRC_POUT09 (*((volatile unsigned int *)(0x42A704A4UL)))
#define bM4_PORT_PODRC_POUT10 (*((volatile unsigned int *)(0x42A704A8UL)))
#define bM4_PORT_PODRC_POUT11 (*((volatile unsigned int *)(0x42A704ACUL)))
#define bM4_PORT_PODRC_POUT12 (*((volatile unsigned int *)(0x42A704B0UL)))
#define bM4_PORT_PODRC_POUT13 (*((volatile unsigned int *)(0x42A704B4UL)))
#define bM4_PORT_PODRC_POUT14 (*((volatile unsigned int *)(0x42A704B8UL)))
#define bM4_PORT_PODRC_POUT15 (*((volatile unsigned int *)(0x42A704BCUL)))
#define bM4_PORT_POERC_POUTE00 (*((volatile unsigned int *)(0x42A704C0UL)))
#define bM4_PORT_POERC_POUTE01 (*((volatile unsigned int *)(0x42A704C4UL)))
#define bM4_PORT_POERC_POUTE02 (*((volatile unsigned int *)(0x42A704C8UL)))
#define bM4_PORT_POERC_POUTE03 (*((volatile unsigned int *)(0x42A704CCUL)))
#define bM4_PORT_POERC_POUTE04 (*((volatile unsigned int *)(0x42A704D0UL)))
#define bM4_PORT_POERC_POUTE05 (*((volatile unsigned int *)(0x42A704D4UL)))
#define bM4_PORT_POERC_POUTE06 (*((volatile unsigned int *)(0x42A704D8UL)))
#define bM4_PORT_POERC_POUTE07 (*((volatile unsigned int *)(0x42A704DCUL)))
#define bM4_PORT_POERC_POUTE08 (*((volatile unsigned int *)(0x42A704E0UL)))
#define bM4_PORT_POERC_POUTE09 (*((volatile unsigned int *)(0x42A704E4UL)))
#define bM4_PORT_POERC_POUTE10 (*((volatile unsigned int *)(0x42A704E8UL)))
#define bM4_PORT_POERC_POUTE11 (*((volatile unsigned int *)(0x42A704ECUL)))
#define bM4_PORT_POERC_POUTE12 (*((volatile unsigned int *)(0x42A704F0UL)))
#define bM4_PORT_POERC_POUTE13 (*((volatile unsigned int *)(0x42A704F4UL)))
#define bM4_PORT_POERC_POUTE14 (*((volatile unsigned int *)(0x42A704F8UL)))
#define bM4_PORT_POERC_POUTE15 (*((volatile unsigned int *)(0x42A704FCUL)))
#define bM4_PORT_POSRC_POS00 (*((volatile unsigned int *)(0x42A70500UL)))
#define bM4_PORT_POSRC_POS01 (*((volatile unsigned int *)(0x42A70504UL)))
#define bM4_PORT_POSRC_POS02 (*((volatile unsigned int *)(0x42A70508UL)))
#define bM4_PORT_POSRC_POS03 (*((volatile unsigned int *)(0x42A7050CUL)))
#define bM4_PORT_POSRC_POS04 (*((volatile unsigned int *)(0x42A70510UL)))
#define bM4_PORT_POSRC_POS05 (*((volatile unsigned int *)(0x42A70514UL)))
#define bM4_PORT_POSRC_POS06 (*((volatile unsigned int *)(0x42A70518UL)))
#define bM4_PORT_POSRC_POS07 (*((volatile unsigned int *)(0x42A7051CUL)))
#define bM4_PORT_POSRC_POS08 (*((volatile unsigned int *)(0x42A70520UL)))
#define bM4_PORT_POSRC_POS09 (*((volatile unsigned int *)(0x42A70524UL)))
#define bM4_PORT_POSRC_POS10 (*((volatile unsigned int *)(0x42A70528UL)))
#define bM4_PORT_POSRC_POS11 (*((volatile unsigned int *)(0x42A7052CUL)))
#define bM4_PORT_POSRC_POS12 (*((volatile unsigned int *)(0x42A70530UL)))
#define bM4_PORT_POSRC_POS13 (*((volatile unsigned int *)(0x42A70534UL)))
#define bM4_PORT_POSRC_POS14 (*((volatile unsigned int *)(0x42A70538UL)))
#define bM4_PORT_POSRC_POS15 (*((volatile unsigned int *)(0x42A7053CUL)))
#define bM4_PORT_PORRC_POR00 (*((volatile unsigned int *)(0x42A70540UL)))
#define bM4_PORT_PORRC_POR01 (*((volatile unsigned int *)(0x42A70544UL)))
#define bM4_PORT_PORRC_POR02 (*((volatile unsigned int *)(0x42A70548UL)))
#define bM4_PORT_PORRC_POR03 (*((volatile unsigned int *)(0x42A7054CUL)))
#define bM4_PORT_PORRC_POR04 (*((volatile unsigned int *)(0x42A70550UL)))
#define bM4_PORT_PORRC_POR05 (*((volatile unsigned int *)(0x42A70554UL)))
#define bM4_PORT_PORRC_POR06 (*((volatile unsigned int *)(0x42A70558UL)))
#define bM4_PORT_PORRC_POR07 (*((volatile unsigned int *)(0x42A7055CUL)))
#define bM4_PORT_PORRC_POR08 (*((volatile unsigned int *)(0x42A70560UL)))
#define bM4_PORT_PORRC_POR09 (*((volatile unsigned int *)(0x42A70564UL)))
#define bM4_PORT_PORRC_POR10 (*((volatile unsigned int *)(0x42A70568UL)))
#define bM4_PORT_PORRC_POR11 (*((volatile unsigned int *)(0x42A7056CUL)))
#define bM4_PORT_PORRC_POR12 (*((volatile unsigned int *)(0x42A70570UL)))
#define bM4_PORT_PORRC_POR13 (*((volatile unsigned int *)(0x42A70574UL)))
#define bM4_PORT_PORRC_POR14 (*((volatile unsigned int *)(0x42A70578UL)))
#define bM4_PORT_PORRC_POR15 (*((volatile unsigned int *)(0x42A7057CUL)))
#define bM4_PORT_POTRC_POT00 (*((volatile unsigned int *)(0x42A70580UL)))
#define bM4_PORT_POTRC_POT01 (*((volatile unsigned int *)(0x42A70584UL)))
#define bM4_PORT_POTRC_POT02 (*((volatile unsigned int *)(0x42A70588UL)))
#define bM4_PORT_POTRC_POT03 (*((volatile unsigned int *)(0x42A7058CUL)))
#define bM4_PORT_POTRC_POT04 (*((volatile unsigned int *)(0x42A70590UL)))
#define bM4_PORT_POTRC_POT05 (*((volatile unsigned int *)(0x42A70594UL)))
#define bM4_PORT_POTRC_POT06 (*((volatile unsigned int *)(0x42A70598UL)))
#define bM4_PORT_POTRC_POT07 (*((volatile unsigned int *)(0x42A7059CUL)))
#define bM4_PORT_POTRC_POT08 (*((volatile unsigned int *)(0x42A705A0UL)))
#define bM4_PORT_POTRC_POT09 (*((volatile unsigned int *)(0x42A705A4UL)))
#define bM4_PORT_POTRC_POT10 (*((volatile unsigned int *)(0x42A705A8UL)))
#define bM4_PORT_POTRC_POT11 (*((volatile unsigned int *)(0x42A705ACUL)))
#define bM4_PORT_POTRC_POT12 (*((volatile unsigned int *)(0x42A705B0UL)))
#define bM4_PORT_POTRC_POT13 (*((volatile unsigned int *)(0x42A705B4UL)))
#define bM4_PORT_POTRC_POT14 (*((volatile unsigned int *)(0x42A705B8UL)))
#define bM4_PORT_POTRC_POT15 (*((volatile unsigned int *)(0x42A705BCUL)))
#define bM4_PORT_PIDRD_PIN00 (*((volatile unsigned int *)(0x42A70600UL)))
#define bM4_PORT_PIDRD_PIN01 (*((volatile unsigned int *)(0x42A70604UL)))
#define bM4_PORT_PIDRD_PIN02 (*((volatile unsigned int *)(0x42A70608UL)))
#define bM4_PORT_PIDRD_PIN03 (*((volatile unsigned int *)(0x42A7060CUL)))
#define bM4_PORT_PIDRD_PIN04 (*((volatile unsigned int *)(0x42A70610UL)))
#define bM4_PORT_PIDRD_PIN05 (*((volatile unsigned int *)(0x42A70614UL)))
#define bM4_PORT_PIDRD_PIN06 (*((volatile unsigned int *)(0x42A70618UL)))
#define bM4_PORT_PIDRD_PIN07 (*((volatile unsigned int *)(0x42A7061CUL)))
#define bM4_PORT_PIDRD_PIN08 (*((volatile unsigned int *)(0x42A70620UL)))
#define bM4_PORT_PIDRD_PIN09 (*((volatile unsigned int *)(0x42A70624UL)))
#define bM4_PORT_PIDRD_PIN10 (*((volatile unsigned int *)(0x42A70628UL)))
#define bM4_PORT_PIDRD_PIN11 (*((volatile unsigned int *)(0x42A7062CUL)))
#define bM4_PORT_PIDRD_PIN12 (*((volatile unsigned int *)(0x42A70630UL)))
#define bM4_PORT_PIDRD_PIN13 (*((volatile unsigned int *)(0x42A70634UL)))
#define bM4_PORT_PIDRD_PIN14 (*((volatile unsigned int *)(0x42A70638UL)))
#define bM4_PORT_PIDRD_PIN15 (*((volatile unsigned int *)(0x42A7063CUL)))
#define bM4_PORT_PODRD_POUT00 (*((volatile unsigned int *)(0x42A70680UL)))
#define bM4_PORT_PODRD_POUT01 (*((volatile unsigned int *)(0x42A70684UL)))
#define bM4_PORT_PODRD_POUT02 (*((volatile unsigned int *)(0x42A70688UL)))
#define bM4_PORT_PODRD_POUT03 (*((volatile unsigned int *)(0x42A7068CUL)))
#define bM4_PORT_PODRD_POUT04 (*((volatile unsigned int *)(0x42A70690UL)))
#define bM4_PORT_PODRD_POUT05 (*((volatile unsigned int *)(0x42A70694UL)))
#define bM4_PORT_PODRD_POUT06 (*((volatile unsigned int *)(0x42A70698UL)))
#define bM4_PORT_PODRD_POUT07 (*((volatile unsigned int *)(0x42A7069CUL)))
#define bM4_PORT_PODRD_POUT08 (*((volatile unsigned int *)(0x42A706A0UL)))
#define bM4_PORT_PODRD_POUT09 (*((volatile unsigned int *)(0x42A706A4UL)))
#define bM4_PORT_PODRD_POUT10 (*((volatile unsigned int *)(0x42A706A8UL)))
#define bM4_PORT_PODRD_POUT11 (*((volatile unsigned int *)(0x42A706ACUL)))
#define bM4_PORT_PODRD_POUT12 (*((volatile unsigned int *)(0x42A706B0UL)))
#define bM4_PORT_PODRD_POUT13 (*((volatile unsigned int *)(0x42A706B4UL)))
#define bM4_PORT_PODRD_POUT14 (*((volatile unsigned int *)(0x42A706B8UL)))
#define bM4_PORT_PODRD_POUT15 (*((volatile unsigned int *)(0x42A706BCUL)))
#define bM4_PORT_POERD_POUTE00 (*((volatile unsigned int *)(0x42A706C0UL)))
#define bM4_PORT_POERD_POUTE01 (*((volatile unsigned int *)(0x42A706C4UL)))
#define bM4_PORT_POERD_POUTE02 (*((volatile unsigned int *)(0x42A706C8UL)))
#define bM4_PORT_POERD_POUTE03 (*((volatile unsigned int *)(0x42A706CCUL)))
#define bM4_PORT_POERD_POUTE04 (*((volatile unsigned int *)(0x42A706D0UL)))
#define bM4_PORT_POERD_POUTE05 (*((volatile unsigned int *)(0x42A706D4UL)))
#define bM4_PORT_POERD_POUTE06 (*((volatile unsigned int *)(0x42A706D8UL)))
#define bM4_PORT_POERD_POUTE07 (*((volatile unsigned int *)(0x42A706DCUL)))
#define bM4_PORT_POERD_POUTE08 (*((volatile unsigned int *)(0x42A706E0UL)))
#define bM4_PORT_POERD_POUTE09 (*((volatile unsigned int *)(0x42A706E4UL)))
#define bM4_PORT_POERD_POUTE10 (*((volatile unsigned int *)(0x42A706E8UL)))
#define bM4_PORT_POERD_POUTE11 (*((volatile unsigned int *)(0x42A706ECUL)))
#define bM4_PORT_POERD_POUTE12 (*((volatile unsigned int *)(0x42A706F0UL)))
#define bM4_PORT_POERD_POUTE13 (*((volatile unsigned int *)(0x42A706F4UL)))
#define bM4_PORT_POERD_POUTE14 (*((volatile unsigned int *)(0x42A706F8UL)))
#define bM4_PORT_POERD_POUTE15 (*((volatile unsigned int *)(0x42A706FCUL)))
#define bM4_PORT_POSRD_POS00 (*((volatile unsigned int *)(0x42A70700UL)))
#define bM4_PORT_POSRD_POS01 (*((volatile unsigned int *)(0x42A70704UL)))
#define bM4_PORT_POSRD_POS02 (*((volatile unsigned int *)(0x42A70708UL)))
#define bM4_PORT_POSRD_POS03 (*((volatile unsigned int *)(0x42A7070CUL)))
#define bM4_PORT_POSRD_POS04 (*((volatile unsigned int *)(0x42A70710UL)))
#define bM4_PORT_POSRD_POS05 (*((volatile unsigned int *)(0x42A70714UL)))
#define bM4_PORT_POSRD_POS06 (*((volatile unsigned int *)(0x42A70718UL)))
#define bM4_PORT_POSRD_POS07 (*((volatile unsigned int *)(0x42A7071CUL)))
#define bM4_PORT_POSRD_POS08 (*((volatile unsigned int *)(0x42A70720UL)))
#define bM4_PORT_POSRD_POS09 (*((volatile unsigned int *)(0x42A70724UL)))
#define bM4_PORT_POSRD_POS10 (*((volatile unsigned int *)(0x42A70728UL)))
#define bM4_PORT_POSRD_POS11 (*((volatile unsigned int *)(0x42A7072CUL)))
#define bM4_PORT_POSRD_POS12 (*((volatile unsigned int *)(0x42A70730UL)))
#define bM4_PORT_POSRD_POS13 (*((volatile unsigned int *)(0x42A70734UL)))
#define bM4_PORT_POSRD_POS14 (*((volatile unsigned int *)(0x42A70738UL)))
#define bM4_PORT_POSRD_POS15 (*((volatile unsigned int *)(0x42A7073CUL)))
#define bM4_PORT_PORRD_POR00 (*((volatile unsigned int *)(0x42A70740UL)))
#define bM4_PORT_PORRD_POR01 (*((volatile unsigned int *)(0x42A70744UL)))
#define bM4_PORT_PORRD_POR02 (*((volatile unsigned int *)(0x42A70748UL)))
#define bM4_PORT_PORRD_POR03 (*((volatile unsigned int *)(0x42A7074CUL)))
#define bM4_PORT_PORRD_POR04 (*((volatile unsigned int *)(0x42A70750UL)))
#define bM4_PORT_PORRD_POR05 (*((volatile unsigned int *)(0x42A70754UL)))
#define bM4_PORT_PORRD_POR06 (*((volatile unsigned int *)(0x42A70758UL)))
#define bM4_PORT_PORRD_POR07 (*((volatile unsigned int *)(0x42A7075CUL)))
#define bM4_PORT_PORRD_POR08 (*((volatile unsigned int *)(0x42A70760UL)))
#define bM4_PORT_PORRD_POR09 (*((volatile unsigned int *)(0x42A70764UL)))
#define bM4_PORT_PORRD_POR10 (*((volatile unsigned int *)(0x42A70768UL)))
#define bM4_PORT_PORRD_POR11 (*((volatile unsigned int *)(0x42A7076CUL)))
#define bM4_PORT_PORRD_POR12 (*((volatile unsigned int *)(0x42A70770UL)))
#define bM4_PORT_PORRD_POR13 (*((volatile unsigned int *)(0x42A70774UL)))
#define bM4_PORT_PORRD_POR14 (*((volatile unsigned int *)(0x42A70778UL)))
#define bM4_PORT_PORRD_POR15 (*((volatile unsigned int *)(0x42A7077CUL)))
#define bM4_PORT_POTRD_POT00 (*((volatile unsigned int *)(0x42A70780UL)))
#define bM4_PORT_POTRD_POT01 (*((volatile unsigned int *)(0x42A70784UL)))
#define bM4_PORT_POTRD_POT02 (*((volatile unsigned int *)(0x42A70788UL)))
#define bM4_PORT_POTRD_POT03 (*((volatile unsigned int *)(0x42A7078CUL)))
#define bM4_PORT_POTRD_POT04 (*((volatile unsigned int *)(0x42A70790UL)))
#define bM4_PORT_POTRD_POT05 (*((volatile unsigned int *)(0x42A70794UL)))
#define bM4_PORT_POTRD_POT06 (*((volatile unsigned int *)(0x42A70798UL)))
#define bM4_PORT_POTRD_POT07 (*((volatile unsigned int *)(0x42A7079CUL)))
#define bM4_PORT_POTRD_POT08 (*((volatile unsigned int *)(0x42A707A0UL)))
#define bM4_PORT_POTRD_POT09 (*((volatile unsigned int *)(0x42A707A4UL)))
#define bM4_PORT_POTRD_POT10 (*((volatile unsigned int *)(0x42A707A8UL)))
#define bM4_PORT_POTRD_POT11 (*((volatile unsigned int *)(0x42A707ACUL)))
#define bM4_PORT_POTRD_POT12 (*((volatile unsigned int *)(0x42A707B0UL)))
#define bM4_PORT_POTRD_POT13 (*((volatile unsigned int *)(0x42A707B4UL)))
#define bM4_PORT_POTRD_POT14 (*((volatile unsigned int *)(0x42A707B8UL)))
#define bM4_PORT_POTRD_POT15 (*((volatile unsigned int *)(0x42A707BCUL)))
#define bM4_PORT_PIDRE_PIN00 (*((volatile unsigned int *)(0x42A70800UL)))
#define bM4_PORT_PIDRE_PIN01 (*((volatile unsigned int *)(0x42A70804UL)))
#define bM4_PORT_PIDRE_PIN02 (*((volatile unsigned int *)(0x42A70808UL)))
#define bM4_PORT_PIDRE_PIN03 (*((volatile unsigned int *)(0x42A7080CUL)))
#define bM4_PORT_PIDRE_PIN04 (*((volatile unsigned int *)(0x42A70810UL)))
#define bM4_PORT_PIDRE_PIN05 (*((volatile unsigned int *)(0x42A70814UL)))
#define bM4_PORT_PIDRE_PIN06 (*((volatile unsigned int *)(0x42A70818UL)))
#define bM4_PORT_PIDRE_PIN07 (*((volatile unsigned int *)(0x42A7081CUL)))
#define bM4_PORT_PIDRE_PIN08 (*((volatile unsigned int *)(0x42A70820UL)))
#define bM4_PORT_PIDRE_PIN09 (*((volatile unsigned int *)(0x42A70824UL)))
#define bM4_PORT_PIDRE_PIN10 (*((volatile unsigned int *)(0x42A70828UL)))
#define bM4_PORT_PIDRE_PIN11 (*((volatile unsigned int *)(0x42A7082CUL)))
#define bM4_PORT_PIDRE_PIN12 (*((volatile unsigned int *)(0x42A70830UL)))
#define bM4_PORT_PIDRE_PIN13 (*((volatile unsigned int *)(0x42A70834UL)))
#define bM4_PORT_PIDRE_PIN14 (*((volatile unsigned int *)(0x42A70838UL)))
#define bM4_PORT_PIDRE_PIN15 (*((volatile unsigned int *)(0x42A7083CUL)))
#define bM4_PORT_PODRE_POUT00 (*((volatile unsigned int *)(0x42A70880UL)))
#define bM4_PORT_PODRE_POUT01 (*((volatile unsigned int *)(0x42A70884UL)))
#define bM4_PORT_PODRE_POUT02 (*((volatile unsigned int *)(0x42A70888UL)))
#define bM4_PORT_PODRE_POUT03 (*((volatile unsigned int *)(0x42A7088CUL)))
#define bM4_PORT_PODRE_POUT04 (*((volatile unsigned int *)(0x42A70890UL)))
#define bM4_PORT_PODRE_POUT05 (*((volatile unsigned int *)(0x42A70894UL)))
#define bM4_PORT_PODRE_POUT06 (*((volatile unsigned int *)(0x42A70898UL)))
#define bM4_PORT_PODRE_POUT07 (*((volatile unsigned int *)(0x42A7089CUL)))
#define bM4_PORT_PODRE_POUT08 (*((volatile unsigned int *)(0x42A708A0UL)))
#define bM4_PORT_PODRE_POUT09 (*((volatile unsigned int *)(0x42A708A4UL)))
#define bM4_PORT_PODRE_POUT10 (*((volatile unsigned int *)(0x42A708A8UL)))
#define bM4_PORT_PODRE_POUT11 (*((volatile unsigned int *)(0x42A708ACUL)))
#define bM4_PORT_PODRE_POUT12 (*((volatile unsigned int *)(0x42A708B0UL)))
#define bM4_PORT_PODRE_POUT13 (*((volatile unsigned int *)(0x42A708B4UL)))
#define bM4_PORT_PODRE_POUT14 (*((volatile unsigned int *)(0x42A708B8UL)))
#define bM4_PORT_PODRE_POUT15 (*((volatile unsigned int *)(0x42A708BCUL)))
#define bM4_PORT_POERE_POUTE00 (*((volatile unsigned int *)(0x42A708C0UL)))
#define bM4_PORT_POERE_POUTE01 (*((volatile unsigned int *)(0x42A708C4UL)))
#define bM4_PORT_POERE_POUTE02 (*((volatile unsigned int *)(0x42A708C8UL)))
#define bM4_PORT_POERE_POUTE03 (*((volatile unsigned int *)(0x42A708CCUL)))
#define bM4_PORT_POERE_POUTE04 (*((volatile unsigned int *)(0x42A708D0UL)))
#define bM4_PORT_POERE_POUTE05 (*((volatile unsigned int *)(0x42A708D4UL)))
#define bM4_PORT_POERE_POUTE06 (*((volatile unsigned int *)(0x42A708D8UL)))
#define bM4_PORT_POERE_POUTE07 (*((volatile unsigned int *)(0x42A708DCUL)))
#define bM4_PORT_POERE_POUTE08 (*((volatile unsigned int *)(0x42A708E0UL)))
#define bM4_PORT_POERE_POUTE09 (*((volatile unsigned int *)(0x42A708E4UL)))
#define bM4_PORT_POERE_POUTE10 (*((volatile unsigned int *)(0x42A708E8UL)))
#define bM4_PORT_POERE_POUTE11 (*((volatile unsigned int *)(0x42A708ECUL)))
#define bM4_PORT_POERE_POUTE12 (*((volatile unsigned int *)(0x42A708F0UL)))
#define bM4_PORT_POERE_POUTE13 (*((volatile unsigned int *)(0x42A708F4UL)))
#define bM4_PORT_POERE_POUTE14 (*((volatile unsigned int *)(0x42A708F8UL)))
#define bM4_PORT_POERE_POUTE15 (*((volatile unsigned int *)(0x42A708FCUL)))
#define bM4_PORT_POSRE_POS00 (*((volatile unsigned int *)(0x42A70900UL)))
#define bM4_PORT_POSRE_POS01 (*((volatile unsigned int *)(0x42A70904UL)))
#define bM4_PORT_POSRE_POS02 (*((volatile unsigned int *)(0x42A70908UL)))
#define bM4_PORT_POSRE_POS03 (*((volatile unsigned int *)(0x42A7090CUL)))
#define bM4_PORT_POSRE_POS04 (*((volatile unsigned int *)(0x42A70910UL)))
#define bM4_PORT_POSRE_POS05 (*((volatile unsigned int *)(0x42A70914UL)))
#define bM4_PORT_POSRE_POS06 (*((volatile unsigned int *)(0x42A70918UL)))
#define bM4_PORT_POSRE_POS07 (*((volatile unsigned int *)(0x42A7091CUL)))
#define bM4_PORT_POSRE_POS08 (*((volatile unsigned int *)(0x42A70920UL)))
#define bM4_PORT_POSRE_POS09 (*((volatile unsigned int *)(0x42A70924UL)))
#define bM4_PORT_POSRE_POS10 (*((volatile unsigned int *)(0x42A70928UL)))
#define bM4_PORT_POSRE_POS11 (*((volatile unsigned int *)(0x42A7092CUL)))
#define bM4_PORT_POSRE_POS12 (*((volatile unsigned int *)(0x42A70930UL)))
#define bM4_PORT_POSRE_POS13 (*((volatile unsigned int *)(0x42A70934UL)))
#define bM4_PORT_POSRE_POS14 (*((volatile unsigned int *)(0x42A70938UL)))
#define bM4_PORT_POSRE_POS15 (*((volatile unsigned int *)(0x42A7093CUL)))
#define bM4_PORT_PORRE_POR00 (*((volatile unsigned int *)(0x42A70940UL)))
#define bM4_PORT_PORRE_POR01 (*((volatile unsigned int *)(0x42A70944UL)))
#define bM4_PORT_PORRE_POR02 (*((volatile unsigned int *)(0x42A70948UL)))
#define bM4_PORT_PORRE_POR03 (*((volatile unsigned int *)(0x42A7094CUL)))
#define bM4_PORT_PORRE_POR04 (*((volatile unsigned int *)(0x42A70950UL)))
#define bM4_PORT_PORRE_POR05 (*((volatile unsigned int *)(0x42A70954UL)))
#define bM4_PORT_PORRE_POR06 (*((volatile unsigned int *)(0x42A70958UL)))
#define bM4_PORT_PORRE_POR07 (*((volatile unsigned int *)(0x42A7095CUL)))
#define bM4_PORT_PORRE_POR08 (*((volatile unsigned int *)(0x42A70960UL)))
#define bM4_PORT_PORRE_POR09 (*((volatile unsigned int *)(0x42A70964UL)))
#define bM4_PORT_PORRE_POR10 (*((volatile unsigned int *)(0x42A70968UL)))
#define bM4_PORT_PORRE_POR11 (*((volatile unsigned int *)(0x42A7096CUL)))
#define bM4_PORT_PORRE_POR12 (*((volatile unsigned int *)(0x42A70970UL)))
#define bM4_PORT_PORRE_POR13 (*((volatile unsigned int *)(0x42A70974UL)))
#define bM4_PORT_PORRE_POR14 (*((volatile unsigned int *)(0x42A70978UL)))
#define bM4_PORT_PORRE_POR15 (*((volatile unsigned int *)(0x42A7097CUL)))
#define bM4_PORT_POTRE_POT00 (*((volatile unsigned int *)(0x42A70980UL)))
#define bM4_PORT_POTRE_POT01 (*((volatile unsigned int *)(0x42A70984UL)))
#define bM4_PORT_POTRE_POT02 (*((volatile unsigned int *)(0x42A70988UL)))
#define bM4_PORT_POTRE_POT03 (*((volatile unsigned int *)(0x42A7098CUL)))
#define bM4_PORT_POTRE_POT04 (*((volatile unsigned int *)(0x42A70990UL)))
#define bM4_PORT_POTRE_POT05 (*((volatile unsigned int *)(0x42A70994UL)))
#define bM4_PORT_POTRE_POT06 (*((volatile unsigned int *)(0x42A70998UL)))
#define bM4_PORT_POTRE_POT07 (*((volatile unsigned int *)(0x42A7099CUL)))
#define bM4_PORT_POTRE_POT08 (*((volatile unsigned int *)(0x42A709A0UL)))
#define bM4_PORT_POTRE_POT09 (*((volatile unsigned int *)(0x42A709A4UL)))
#define bM4_PORT_POTRE_POT10 (*((volatile unsigned int *)(0x42A709A8UL)))
#define bM4_PORT_POTRE_POT11 (*((volatile unsigned int *)(0x42A709ACUL)))
#define bM4_PORT_POTRE_POT12 (*((volatile unsigned int *)(0x42A709B0UL)))
#define bM4_PORT_POTRE_POT13 (*((volatile unsigned int *)(0x42A709B4UL)))
#define bM4_PORT_POTRE_POT14 (*((volatile unsigned int *)(0x42A709B8UL)))
#define bM4_PORT_POTRE_POT15 (*((volatile unsigned int *)(0x42A709BCUL)))
#define bM4_PORT_PIDRH_PIN00 (*((volatile unsigned int *)(0x42A70A00UL)))
#define bM4_PORT_PIDRH_PIN01 (*((volatile unsigned int *)(0x42A70A04UL)))
#define bM4_PORT_PIDRH_PIN02 (*((volatile unsigned int *)(0x42A70A08UL)))
#define bM4_PORT_PODRH_POUT00 (*((volatile unsigned int *)(0x42A70A80UL)))
#define bM4_PORT_PODRH_POUT01 (*((volatile unsigned int *)(0x42A70A84UL)))
#define bM4_PORT_PODRH_POUT02 (*((volatile unsigned int *)(0x42A70A88UL)))
#define bM4_PORT_POERH_POUTE00 (*((volatile unsigned int *)(0x42A70AC0UL)))
#define bM4_PORT_POERH_POUTE01 (*((volatile unsigned int *)(0x42A70AC4UL)))
#define bM4_PORT_POERH_POUTE02 (*((volatile unsigned int *)(0x42A70AC8UL)))
#define bM4_PORT_POSRH_POS00 (*((volatile unsigned int *)(0x42A70B00UL)))
#define bM4_PORT_POSRH_POS01 (*((volatile unsigned int *)(0x42A70B04UL)))
#define bM4_PORT_POSRH_POS02 (*((volatile unsigned int *)(0x42A70B08UL)))
#define bM4_PORT_PORRH_POR00 (*((volatile unsigned int *)(0x42A70B40UL)))
#define bM4_PORT_PORRH_POR01 (*((volatile unsigned int *)(0x42A70B44UL)))
#define bM4_PORT_PORRH_POR02 (*((volatile unsigned int *)(0x42A70B48UL)))
#define bM4_PORT_POTRH_POT00 (*((volatile unsigned int *)(0x42A70B80UL)))
#define bM4_PORT_POTRH_POT01 (*((volatile unsigned int *)(0x42A70B84UL)))
#define bM4_PORT_POTRH_POT02 (*((volatile unsigned int *)(0x42A70B88UL)))
#define bM4_PORT_PSPCR_SPFE0 (*((volatile unsigned int *)(0x42A77E80UL)))
#define bM4_PORT_PSPCR_SPFE1 (*((volatile unsigned int *)(0x42A77E84UL)))
#define bM4_PORT_PSPCR_SPFE2 (*((volatile unsigned int *)(0x42A77E88UL)))
#define bM4_PORT_PSPCR_SPFE3 (*((volatile unsigned int *)(0x42A77E8CUL)))
#define bM4_PORT_PSPCR_SPFE4 (*((volatile unsigned int *)(0x42A77E90UL)))
#define bM4_PORT_PCCR_BFSEL0 (*((volatile unsigned int *)(0x42A77F00UL)))
#define bM4_PORT_PCCR_BFSEL1 (*((volatile unsigned int *)(0x42A77F04UL)))
#define bM4_PORT_PCCR_BFSEL2 (*((volatile unsigned int *)(0x42A77F08UL)))
#define bM4_PORT_PCCR_BFSEL3 (*((volatile unsigned int *)(0x42A77F0CUL)))
#define bM4_PORT_PCCR_RDWT0 (*((volatile unsigned int *)(0x42A77F38UL)))
#define bM4_PORT_PCCR_RDWT1 (*((volatile unsigned int *)(0x42A77F3CUL)))
#define bM4_PORT_PINAER_PINAE0 (*((volatile unsigned int *)(0x42A77F40UL)))
#define bM4_PORT_PINAER_PINAE1 (*((volatile unsigned int *)(0x42A77F44UL)))
#define bM4_PORT_PINAER_PINAE2 (*((volatile unsigned int *)(0x42A77F48UL)))
#define bM4_PORT_PINAER_PINAE3 (*((volatile unsigned int *)(0x42A77F4CUL)))
