MarlinFirmware/Marlin/Marlin/lib/h32_core/main/hdsc32core/common/hc32f46x.h
#define bM4_PORT_PCRB1_INTE (*((volatile unsigned int *)(0x42A788B0UL)))
#define bM4_PORT_PCRB1_LTE (*((volatile unsigned int *)(0x42A788B8UL)))
#define bM4_PORT_PCRB1_DDIS (*((volatile unsigned int *)(0x42A788BCUL)))
#define bM4_PORT_PFSRB1_FSEL0 (*((volatile unsigned int *)(0x42A788C0UL)))
#define bM4_PORT_PFSRB1_FSEL1 (*((volatile unsigned int *)(0x42A788C4UL)))
#define bM4_PORT_PFSRB1_FSEL2 (*((volatile unsigned int *)(0x42A788C8UL)))
#define bM4_PORT_PFSRB1_FSEL3 (*((volatile unsigned int *)(0x42A788CCUL)))
#define bM4_PORT_PFSRB1_FSEL4 (*((volatile unsigned int *)(0x42A788D0UL)))
#define bM4_PORT_PFSRB1_FSEL5 (*((volatile unsigned int *)(0x42A788D4UL)))
#define bM4_PORT_PFSRB1_BFE (*((volatile unsigned int *)(0x42A788E0UL)))
#define bM4_PORT_PCRB2_POUT (*((volatile unsigned int *)(0x42A78900UL)))
#define bM4_PORT_PCRB2_POUTE (*((volatile unsigned int *)(0x42A78904UL)))
#define bM4_PORT_PCRB2_NOD (*((volatile unsigned int *)(0x42A78908UL)))
#define bM4_PORT_PCRB2_DRV0 (*((volatile unsigned int *)(0x42A78910UL)))
#define bM4_PORT_PCRB2_DRV1 (*((volatile unsigned int *)(0x42A78914UL)))
#define bM4_PORT_PCRB2_PUU (*((volatile unsigned int *)(0x42A78918UL)))
#define bM4_PORT_PCRB2_PIN (*((volatile unsigned int *)(0x42A78920UL)))
#define bM4_PORT_PCRB2_INVE (*((volatile unsigned int *)(0x42A78924UL)))
#define bM4_PORT_PCRB2_INTE (*((volatile unsigned int *)(0x42A78930UL)))
#define bM4_PORT_PCRB2_LTE (*((volatile unsigned int *)(0x42A78938UL)))
#define bM4_PORT_PCRB2_DDIS (*((volatile unsigned int *)(0x42A7893CUL)))
#define bM4_PORT_PFSRB2_FSEL0 (*((volatile unsigned int *)(0x42A78940UL)))
#define bM4_PORT_PFSRB2_FSEL1 (*((volatile unsigned int *)(0x42A78944UL)))
#define bM4_PORT_PFSRB2_FSEL2 (*((volatile unsigned int *)(0x42A78948UL)))
#define bM4_PORT_PFSRB2_FSEL3 (*((volatile unsigned int *)(0x42A7894CUL)))
#define bM4_PORT_PFSRB2_FSEL4 (*((volatile unsigned int *)(0x42A78950UL)))
#define bM4_PORT_PFSRB2_FSEL5 (*((volatile unsigned int *)(0x42A78954UL)))
#define bM4_PORT_PFSRB2_BFE (*((volatile unsigned int *)(0x42A78960UL)))
#define bM4_PORT_PCRB3_POUT (*((volatile unsigned int *)(0x42A78980UL)))
#define bM4_PORT_PCRB3_POUTE (*((volatile unsigned int *)(0x42A78984UL)))
#define bM4_PORT_PCRB3_NOD (*((volatile unsigned int *)(0x42A78988UL)))
#define bM4_PORT_PCRB3_DRV0 (*((volatile unsigned int *)(0x42A78990UL)))
#define bM4_PORT_PCRB3_DRV1 (*((volatile unsigned int *)(0x42A78994UL)))
#define bM4_PORT_PCRB3_PUU (*((volatile unsigned int *)(0x42A78998UL)))
#define bM4_PORT_PCRB3_PIN (*((volatile unsigned int *)(0x42A789A0UL)))
#define bM4_PORT_PCRB3_INVE (*((volatile unsigned int *)(0x42A789A4UL)))
#define bM4_PORT_PCRB3_INTE (*((volatile unsigned int *)(0x42A789B0UL)))
#define bM4_PORT_PCRB3_LTE (*((volatile unsigned int *)(0x42A789B8UL)))
#define bM4_PORT_PCRB3_DDIS (*((volatile unsigned int *)(0x42A789BCUL)))
#define bM4_PORT_PFSRB3_FSEL0 (*((volatile unsigned int *)(0x42A789C0UL)))
#define bM4_PORT_PFSRB3_FSEL1 (*((volatile unsigned int *)(0x42A789C4UL)))
#define bM4_PORT_PFSRB3_FSEL2 (*((volatile unsigned int *)(0x42A789C8UL)))
#define bM4_PORT_PFSRB3_FSEL3 (*((volatile unsigned int *)(0x42A789CCUL)))
#define bM4_PORT_PFSRB3_FSEL4 (*((volatile unsigned int *)(0x42A789D0UL)))
#define bM4_PORT_PFSRB3_FSEL5 (*((volatile unsigned int *)(0x42A789D4UL)))
#define bM4_PORT_PFSRB3_BFE (*((volatile unsigned int *)(0x42A789E0UL)))
#define bM4_PORT_PCRB4_POUT (*((volatile unsigned int *)(0x42A78A00UL)))
#define bM4_PORT_PCRB4_POUTE (*((volatile unsigned int *)(0x42A78A04UL)))
#define bM4_PORT_PCRB4_NOD (*((volatile unsigned int *)(0x42A78A08UL)))
#define bM4_PORT_PCRB4_DRV0 (*((volatile unsigned int *)(0x42A78A10UL)))
#define bM4_PORT_PCRB4_DRV1 (*((volatile unsigned int *)(0x42A78A14UL)))
#define bM4_PORT_PCRB4_PUU (*((volatile unsigned int *)(0x42A78A18UL)))
#define bM4_PORT_PCRB4_PIN (*((volatile unsigned int *)(0x42A78A20UL)))
#define bM4_PORT_PCRB4_INVE (*((volatile unsigned int *)(0x42A78A24UL)))
#define bM4_PORT_PCRB4_INTE (*((volatile unsigned int *)(0x42A78A30UL)))
#define bM4_PORT_PCRB4_LTE (*((volatile unsigned int *)(0x42A78A38UL)))
#define bM4_PORT_PCRB4_DDIS (*((volatile unsigned int *)(0x42A78A3CUL)))
#define bM4_PORT_PFSRB4_FSEL0 (*((volatile unsigned int *)(0x42A78A40UL)))
#define bM4_PORT_PFSRB4_FSEL1 (*((volatile unsigned int *)(0x42A78A44UL)))
#define bM4_PORT_PFSRB4_FSEL2 (*((volatile unsigned int *)(0x42A78A48UL)))
#define bM4_PORT_PFSRB4_FSEL3 (*((volatile unsigned int *)(0x42A78A4CUL)))
#define bM4_PORT_PFSRB4_FSEL4 (*((volatile unsigned int *)(0x42A78A50UL)))
#define bM4_PORT_PFSRB4_FSEL5 (*((volatile unsigned int *)(0x42A78A54UL)))
#define bM4_PORT_PFSRB4_BFE (*((volatile unsigned int *)(0x42A78A60UL)))
#define bM4_PORT_PCRB5_POUT (*((volatile unsigned int *)(0x42A78A80UL)))
#define bM4_PORT_PCRB5_POUTE (*((volatile unsigned int *)(0x42A78A84UL)))
#define bM4_PORT_PCRB5_NOD (*((volatile unsigned int *)(0x42A78A88UL)))
#define bM4_PORT_PCRB5_DRV0 (*((volatile unsigned int *)(0x42A78A90UL)))
#define bM4_PORT_PCRB5_DRV1 (*((volatile unsigned int *)(0x42A78A94UL)))
#define bM4_PORT_PCRB5_PUU (*((volatile unsigned int *)(0x42A78A98UL)))
#define bM4_PORT_PCRB5_PIN (*((volatile unsigned int *)(0x42A78AA0UL)))
#define bM4_PORT_PCRB5_INVE (*((volatile unsigned int *)(0x42A78AA4UL)))
#define bM4_PORT_PCRB5_INTE (*((volatile unsigned int *)(0x42A78AB0UL)))
#define bM4_PORT_PCRB5_LTE (*((volatile unsigned int *)(0x42A78AB8UL)))
#define bM4_PORT_PCRB5_DDIS (*((volatile unsigned int *)(0x42A78ABCUL)))
#define bM4_PORT_PFSRB5_FSEL0 (*((volatile unsigned int *)(0x42A78AC0UL)))
#define bM4_PORT_PFSRB5_FSEL1 (*((volatile unsigned int *)(0x42A78AC4UL)))
#define bM4_PORT_PFSRB5_FSEL2 (*((volatile unsigned int *)(0x42A78AC8UL)))
#define bM4_PORT_PFSRB5_FSEL3 (*((volatile unsigned int *)(0x42A78ACCUL)))
#define bM4_PORT_PFSRB5_FSEL4 (*((volatile unsigned int *)(0x42A78AD0UL)))
#define bM4_PORT_PFSRB5_FSEL5 (*((volatile unsigned int *)(0x42A78AD4UL)))
#define bM4_PORT_PFSRB5_BFE (*((volatile unsigned int *)(0x42A78AE0UL)))
#define bM4_PORT_PCRB6_POUT (*((volatile unsigned int *)(0x42A78B00UL)))
#define bM4_PORT_PCRB6_POUTE (*((volatile unsigned int *)(0x42A78B04UL)))
#define bM4_PORT_PCRB6_NOD (*((volatile unsigned int *)(0x42A78B08UL)))
#define bM4_PORT_PCRB6_DRV0 (*((volatile unsigned int *)(0x42A78B10UL)))
#define bM4_PORT_PCRB6_DRV1 (*((volatile unsigned int *)(0x42A78B14UL)))
#define bM4_PORT_PCRB6_PUU (*((volatile unsigned int *)(0x42A78B18UL)))
#define bM4_PORT_PCRB6_PIN (*((volatile unsigned int *)(0x42A78B20UL)))
#define bM4_PORT_PCRB6_INVE (*((volatile unsigned int *)(0x42A78B24UL)))
#define bM4_PORT_PCRB6_INTE (*((volatile unsigned int *)(0x42A78B30UL)))
#define bM4_PORT_PCRB6_LTE (*((volatile unsigned int *)(0x42A78B38UL)))
#define bM4_PORT_PCRB6_DDIS (*((volatile unsigned int *)(0x42A78B3CUL)))
#define bM4_PORT_PFSRB6_FSEL0 (*((volatile unsigned int *)(0x42A78B40UL)))
#define bM4_PORT_PFSRB6_FSEL1 (*((volatile unsigned int *)(0x42A78B44UL)))
#define bM4_PORT_PFSRB6_FSEL2 (*((volatile unsigned int *)(0x42A78B48UL)))
#define bM4_PORT_PFSRB6_FSEL3 (*((volatile unsigned int *)(0x42A78B4CUL)))
#define bM4_PORT_PFSRB6_FSEL4 (*((volatile unsigned int *)(0x42A78B50UL)))
#define bM4_PORT_PFSRB6_FSEL5 (*((volatile unsigned int *)(0x42A78B54UL)))
#define bM4_PORT_PFSRB6_BFE (*((volatile unsigned int *)(0x42A78B60UL)))
#define bM4_PORT_PCRB7_POUT (*((volatile unsigned int *)(0x42A78B80UL)))
#define bM4_PORT_PCRB7_POUTE (*((volatile unsigned int *)(0x42A78B84UL)))
#define bM4_PORT_PCRB7_NOD (*((volatile unsigned int *)(0x42A78B88UL)))
#define bM4_PORT_PCRB7_DRV0 (*((volatile unsigned int *)(0x42A78B90UL)))
#define bM4_PORT_PCRB7_DRV1 (*((volatile unsigned int *)(0x42A78B94UL)))
#define bM4_PORT_PCRB7_PUU (*((volatile unsigned int *)(0x42A78B98UL)))
#define bM4_PORT_PCRB7_PIN (*((volatile unsigned int *)(0x42A78BA0UL)))
#define bM4_PORT_PCRB7_INVE (*((volatile unsigned int *)(0x42A78BA4UL)))
#define bM4_PORT_PCRB7_INTE (*((volatile unsigned int *)(0x42A78BB0UL)))
#define bM4_PORT_PCRB7_LTE (*((volatile unsigned int *)(0x42A78BB8UL)))
#define bM4_PORT_PCRB7_DDIS (*((volatile unsigned int *)(0x42A78BBCUL)))
#define bM4_PORT_PFSRB7_FSEL0 (*((volatile unsigned int *)(0x42A78BC0UL)))
#define bM4_PORT_PFSRB7_FSEL1 (*((volatile unsigned int *)(0x42A78BC4UL)))
#define bM4_PORT_PFSRB7_FSEL2 (*((volatile unsigned int *)(0x42A78BC8UL)))
#define bM4_PORT_PFSRB7_FSEL3 (*((volatile unsigned int *)(0x42A78BCCUL)))
#define bM4_PORT_PFSRB7_FSEL4 (*((volatile unsigned int *)(0x42A78BD0UL)))
#define bM4_PORT_PFSRB7_FSEL5 (*((volatile unsigned int *)(0x42A78BD4UL)))
#define bM4_PORT_PFSRB7_BFE (*((volatile unsigned int *)(0x42A78BE0UL)))
#define bM4_PORT_PCRB8_POUT (*((volatile unsigned int *)(0x42A78C00UL)))
#define bM4_PORT_PCRB8_POUTE (*((volatile unsigned int *)(0x42A78C04UL)))
#define bM4_PORT_PCRB8_NOD (*((volatile unsigned int *)(0x42A78C08UL)))
#define bM4_PORT_PCRB8_DRV0 (*((volatile unsigned int *)(0x42A78C10UL)))
#define bM4_PORT_PCRB8_DRV1 (*((volatile unsigned int *)(0x42A78C14UL)))
#define bM4_PORT_PCRB8_PUU (*((volatile unsigned int *)(0x42A78C18UL)))
#define bM4_PORT_PCRB8_PIN (*((volatile unsigned int *)(0x42A78C20UL)))
#define bM4_PORT_PCRB8_INVE (*((volatile unsigned int *)(0x42A78C24UL)))
#define bM4_PORT_PCRB8_INTE (*((volatile unsigned int *)(0x42A78C30UL)))
#define bM4_PORT_PCRB8_LTE (*((volatile unsigned int *)(0x42A78C38UL)))
#define bM4_PORT_PCRB8_DDIS (*((volatile unsigned int *)(0x42A78C3CUL)))
#define bM4_PORT_PFSRB8_FSEL0 (*((volatile unsigned int *)(0x42A78C40UL)))
#define bM4_PORT_PFSRB8_FSEL1 (*((volatile unsigned int *)(0x42A78C44UL)))
#define bM4_PORT_PFSRB8_FSEL2 (*((volatile unsigned int *)(0x42A78C48UL)))
#define bM4_PORT_PFSRB8_FSEL3 (*((volatile unsigned int *)(0x42A78C4CUL)))
#define bM4_PORT_PFSRB8_FSEL4 (*((volatile unsigned int *)(0x42A78C50UL)))
#define bM4_PORT_PFSRB8_FSEL5 (*((volatile unsigned int *)(0x42A78C54UL)))
#define bM4_PORT_PFSRB8_BFE (*((volatile unsigned int *)(0x42A78C60UL)))
#define bM4_PORT_PCRB9_POUT (*((volatile unsigned int *)(0x42A78C80UL)))
#define bM4_PORT_PCRB9_POUTE (*((volatile unsigned int *)(0x42A78C84UL)))
#define bM4_PORT_PCRB9_NOD (*((volatile unsigned int *)(0x42A78C88UL)))
#define bM4_PORT_PCRB9_DRV0 (*((volatile unsigned int *)(0x42A78C90UL)))
#define bM4_PORT_PCRB9_DRV1 (*((volatile unsigned int *)(0x42A78C94UL)))
#define bM4_PORT_PCRB9_PUU (*((volatile unsigned int *)(0x42A78C98UL)))
#define bM4_PORT_PCRB9_PIN (*((volatile unsigned int *)(0x42A78CA0UL)))
#define bM4_PORT_PCRB9_INVE (*((volatile unsigned int *)(0x42A78CA4UL)))
#define bM4_PORT_PCRB9_INTE (*((volatile unsigned int *)(0x42A78CB0UL)))
#define bM4_PORT_PCRB9_LTE (*((volatile unsigned int *)(0x42A78CB8UL)))
#define bM4_PORT_PCRB9_DDIS (*((volatile unsigned int *)(0x42A78CBCUL)))
#define bM4_PORT_PFSRB9_FSEL0 (*((volatile unsigned int *)(0x42A78CC0UL)))
#define bM4_PORT_PFSRB9_FSEL1 (*((volatile unsigned int *)(0x42A78CC4UL)))
#define bM4_PORT_PFSRB9_FSEL2 (*((volatile unsigned int *)(0x42A78CC8UL)))
#define bM4_PORT_PFSRB9_FSEL3 (*((volatile unsigned int *)(0x42A78CCCUL)))
#define bM4_PORT_PFSRB9_FSEL4 (*((volatile unsigned int *)(0x42A78CD0UL)))
#define bM4_PORT_PFSRB9_FSEL5 (*((volatile unsigned int *)(0x42A78CD4UL)))
#define bM4_PORT_PFSRB9_BFE (*((volatile unsigned int *)(0x42A78CE0UL)))
#define bM4_PORT_PCRB10_POUT (*((volatile unsigned int *)(0x42A78D00UL)))
#define bM4_PORT_PCRB10_POUTE (*((volatile unsigned int *)(0x42A78D04UL)))
#define bM4_PORT_PCRB10_NOD (*((volatile unsigned int *)(0x42A78D08UL)))
#define bM4_PORT_PCRB10_DRV0 (*((volatile unsigned int *)(0x42A78D10UL)))
#define bM4_PORT_PCRB10_DRV1 (*((volatile unsigned int *)(0x42A78D14UL)))
#define bM4_PORT_PCRB10_PUU (*((volatile unsigned int *)(0x42A78D18UL)))
#define bM4_PORT_PCRB10_PIN (*((volatile unsigned int *)(0x42A78D20UL)))
#define bM4_PORT_PCRB10_INVE (*((volatile unsigned int *)(0x42A78D24UL)))
#define bM4_PORT_PCRB10_INTE (*((volatile unsigned int *)(0x42A78D30UL)))
#define bM4_PORT_PCRB10_LTE (*((volatile unsigned int *)(0x42A78D38UL)))
#define bM4_PORT_PCRB10_DDIS (*((volatile unsigned int *)(0x42A78D3CUL)))
#define bM4_PORT_PFSRB10_FSEL0 (*((volatile unsigned int *)(0x42A78D40UL)))
#define bM4_PORT_PFSRB10_FSEL1 (*((volatile unsigned int *)(0x42A78D44UL)))
#define bM4_PORT_PFSRB10_FSEL2 (*((volatile unsigned int *)(0x42A78D48UL)))
#define bM4_PORT_PFSRB10_FSEL3 (*((volatile unsigned int *)(0x42A78D4CUL)))
#define bM4_PORT_PFSRB10_FSEL4 (*((volatile unsigned int *)(0x42A78D50UL)))
#define bM4_PORT_PFSRB10_FSEL5 (*((volatile unsigned int *)(0x42A78D54UL)))
#define bM4_PORT_PFSRB10_BFE (*((volatile unsigned int *)(0x42A78D60UL)))
#define bM4_PORT_PCRB11_POUT (*((volatile unsigned int *)(0x42A78D80UL)))
#define bM4_PORT_PCRB11_POUTE (*((volatile unsigned int *)(0x42A78D84UL)))
#define bM4_PORT_PCRB11_NOD (*((volatile unsigned int *)(0x42A78D88UL)))
#define bM4_PORT_PCRB11_DRV0 (*((volatile unsigned int *)(0x42A78D90UL)))
#define bM4_PORT_PCRB11_DRV1 (*((volatile unsigned int *)(0x42A78D94UL)))
#define bM4_PORT_PCRB11_PUU (*((volatile unsigned int *)(0x42A78D98UL)))
#define bM4_PORT_PCRB11_PIN (*((volatile unsigned int *)(0x42A78DA0UL)))
#define bM4_PORT_PCRB11_INVE (*((volatile unsigned int *)(0x42A78DA4UL)))
#define bM4_PORT_PCRB11_INTE (*((volatile unsigned int *)(0x42A78DB0UL)))
#define bM4_PORT_PCRB11_LTE (*((volatile unsigned int *)(0x42A78DB8UL)))
#define bM4_PORT_PCRB11_DDIS (*((volatile unsigned int *)(0x42A78DBCUL)))
#define bM4_PORT_PFSRB11_FSEL0 (*((volatile unsigned int *)(0x42A78DC0UL)))
#define bM4_PORT_PFSRB11_FSEL1 (*((volatile unsigned int *)(0x42A78DC4UL)))
#define bM4_PORT_PFSRB11_FSEL2 (*((volatile unsigned int *)(0x42A78DC8UL)))
#define bM4_PORT_PFSRB11_FSEL3 (*((volatile unsigned int *)(0x42A78DCCUL)))
#define bM4_PORT_PFSRB11_FSEL4 (*((volatile unsigned int *)(0x42A78DD0UL)))
#define bM4_PORT_PFSRB11_FSEL5 (*((volatile unsigned int *)(0x42A78DD4UL)))
#define bM4_PORT_PFSRB11_BFE (*((volatile unsigned int *)(0x42A78DE0UL)))
#define bM4_PORT_PCRB12_POUT (*((volatile unsigned int *)(0x42A78E00UL)))
#define bM4_PORT_PCRB12_POUTE (*((volatile unsigned int *)(0x42A78E04UL)))
#define bM4_PORT_PCRB12_NOD (*((volatile unsigned int *)(0x42A78E08UL)))
#define bM4_PORT_PCRB12_DRV0 (*((volatile unsigned int *)(0x42A78E10UL)))
#define bM4_PORT_PCRB12_DRV1 (*((volatile unsigned int *)(0x42A78E14UL)))
#define bM4_PORT_PCRB12_PUU (*((volatile unsigned int *)(0x42A78E18UL)))
#define bM4_PORT_PCRB12_PIN (*((volatile unsigned int *)(0x42A78E20UL)))
#define bM4_PORT_PCRB12_INVE (*((volatile unsigned int *)(0x42A78E24UL)))
#define bM4_PORT_PCRB12_INTE (*((volatile unsigned int *)(0x42A78E30UL)))
#define bM4_PORT_PCRB12_LTE (*((volatile unsigned int *)(0x42A78E38UL)))
#define bM4_PORT_PCRB12_DDIS (*((volatile unsigned int *)(0x42A78E3CUL)))
#define bM4_PORT_PFSRB12_FSEL0 (*((volatile unsigned int *)(0x42A78E40UL)))
#define bM4_PORT_PFSRB12_FSEL1 (*((volatile unsigned int *)(0x42A78E44UL)))
#define bM4_PORT_PFSRB12_FSEL2 (*((volatile unsigned int *)(0x42A78E48UL)))
#define bM4_PORT_PFSRB12_FSEL3 (*((volatile unsigned int *)(0x42A78E4CUL)))
#define bM4_PORT_PFSRB12_FSEL4 (*((volatile unsigned int *)(0x42A78E50UL)))
#define bM4_PORT_PFSRB12_FSEL5 (*((volatile unsigned int *)(0x42A78E54UL)))
#define bM4_PORT_PFSRB12_BFE (*((volatile unsigned int *)(0x42A78E60UL)))
#define bM4_PORT_PCRB13_POUT (*((volatile unsigned int *)(0x42A78E80UL)))
#define bM4_PORT_PCRB13_POUTE (*((volatile unsigned int *)(0x42A78E84UL)))
#define bM4_PORT_PCRB13_NOD (*((volatile unsigned int *)(0x42A78E88UL)))
#define bM4_PORT_PCRB13_DRV0 (*((volatile unsigned int *)(0x42A78E90UL)))
#define bM4_PORT_PCRB13_DRV1 (*((volatile unsigned int *)(0x42A78E94UL)))
#define bM4_PORT_PCRB13_PUU (*((volatile unsigned int *)(0x42A78E98UL)))
#define bM4_PORT_PCRB13_PIN (*((volatile unsigned int *)(0x42A78EA0UL)))
#define bM4_PORT_PCRB13_INVE (*((volatile unsigned int *)(0x42A78EA4UL)))
#define bM4_PORT_PCRB13_INTE (*((volatile unsigned int *)(0x42A78EB0UL)))
#define bM4_PORT_PCRB13_LTE (*((volatile unsigned int *)(0x42A78EB8UL)))
#define bM4_PORT_PCRB13_DDIS (*((volatile unsigned int *)(0x42A78EBCUL)))
#define bM4_PORT_PFSRB13_FSEL0 (*((volatile unsigned int *)(0x42A78EC0UL)))
#define bM4_PORT_PFSRB13_FSEL1 (*((volatile unsigned int *)(0x42A78EC4UL)))
#define bM4_PORT_PFSRB13_FSEL2 (*((volatile unsigned int *)(0x42A78EC8UL)))
#define bM4_PORT_PFSRB13_FSEL3 (*((volatile unsigned int *)(0x42A78ECCUL)))
#define bM4_PORT_PFSRB13_FSEL4 (*((volatile unsigned int *)(0x42A78ED0UL)))
#define bM4_PORT_PFSRB13_FSEL5 (*((volatile unsigned int *)(0x42A78ED4UL)))
#define bM4_PORT_PFSRB13_BFE (*((volatile unsigned int *)(0x42A78EE0UL)))
#define bM4_PORT_PCRB14_POUT (*((volatile unsigned int *)(0x42A78F00UL)))
#define bM4_PORT_PCRB14_POUTE (*((volatile unsigned int *)(0x42A78F04UL)))
#define bM4_PORT_PCRB14_NOD (*((volatile unsigned int *)(0x42A78F08UL)))
#define bM4_PORT_PCRB14_DRV0 (*((volatile unsigned int *)(0x42A78F10UL)))
#define bM4_PORT_PCRB14_DRV1 (*((volatile unsigned int *)(0x42A78F14UL)))
#define bM4_PORT_PCRB14_PUU (*((volatile unsigned int *)(0x42A78F18UL)))
#define bM4_PORT_PCRB14_PIN (*((volatile unsigned int *)(0x42A78F20UL)))
#define bM4_PORT_PCRB14_INVE (*((volatile unsigned int *)(0x42A78F24UL)))
#define bM4_PORT_PCRB14_INTE (*((volatile unsigned int *)(0x42A78F30UL)))
#define bM4_PORT_PCRB14_LTE (*((volatile unsigned int *)(0x42A78F38UL)))
#define bM4_PORT_PCRB14_DDIS (*((volatile unsigned int *)(0x42A78F3CUL)))
#define bM4_PORT_PFSRB14_FSEL0 (*((volatile unsigned int *)(0x42A78F40UL)))
#define bM4_PORT_PFSRB14_FSEL1 (*((volatile unsigned int *)(0x42A78F44UL)))
#define bM4_PORT_PFSRB14_FSEL2 (*((volatile unsigned int *)(0x42A78F48UL)))
#define bM4_PORT_PFSRB14_FSEL3 (*((volatile unsigned int *)(0x42A78F4CUL)))
#define bM4_PORT_PFSRB14_FSEL4 (*((volatile unsigned int *)(0x42A78F50UL)))
#define bM4_PORT_PFSRB14_FSEL5 (*((volatile unsigned int *)(0x42A78F54UL)))
#define bM4_PORT_PFSRB14_BFE (*((volatile unsigned int *)(0x42A78F60UL)))
#define bM4_PORT_PCRB15_POUT (*((volatile unsigned int *)(0x42A78F80UL)))
#define bM4_PORT_PCRB15_POUTE (*((volatile unsigned int *)(0x42A78F84UL)))
#define bM4_PORT_PCRB15_NOD (*((volatile unsigned int *)(0x42A78F88UL)))
#define bM4_PORT_PCRB15_DRV0 (*((volatile unsigned int *)(0x42A78F90UL)))
#define bM4_PORT_PCRB15_DRV1 (*((volatile unsigned int *)(0x42A78F94UL)))
#define bM4_PORT_PCRB15_PUU (*((volatile unsigned int *)(0x42A78F98UL)))
#define bM4_PORT_PCRB15_PIN (*((volatile unsigned int *)(0x42A78FA0UL)))
#define bM4_PORT_PCRB15_INVE (*((volatile unsigned int *)(0x42A78FA4UL)))
#define bM4_PORT_PCRB15_INTE (*((volatile unsigned int *)(0x42A78FB0UL)))
#define bM4_PORT_PCRB15_LTE (*((volatile unsigned int *)(0x42A78FB8UL)))
#define bM4_PORT_PCRB15_DDIS (*((volatile unsigned int *)(0x42A78FBCUL)))
#define bM4_PORT_PFSRB15_FSEL0 (*((volatile unsigned int *)(0x42A78FC0UL)))
#define bM4_PORT_PFSRB15_FSEL1 (*((volatile unsigned int *)(0x42A78FC4UL)))
#define bM4_PORT_PFSRB15_FSEL2 (*((volatile unsigned int *)(0x42A78FC8UL)))
#define bM4_PORT_PFSRB15_FSEL3 (*((volatile unsigned int *)(0x42A78FCCUL)))
#define bM4_PORT_PFSRB15_FSEL4 (*((volatile unsigned int *)(0x42A78FD0UL)))
#define bM4_PORT_PFSRB15_FSEL5 (*((volatile unsigned int *)(0x42A78FD4UL)))
#define bM4_PORT_PFSRB15_BFE (*((volatile unsigned int *)(0x42A78FE0UL)))
#define bM4_PORT_PCRC0_POUT (*((volatile unsigned int *)(0x42A79000UL)))
#define bM4_PORT_PCRC0_POUTE (*((volatile unsigned int *)(0x42A79004UL)))
#define bM4_PORT_PCRC0_NOD (*((volatile unsigned int *)(0x42A79008UL)))
#define bM4_PORT_PCRC0_DRV0 (*((volatile unsigned int *)(0x42A79010UL)))
#define bM4_PORT_PCRC0_DRV1 (*((volatile unsigned int *)(0x42A79014UL)))
#define bM4_PORT_PCRC0_PUU (*((volatile unsigned int *)(0x42A79018UL)))
#define bM4_PORT_PCRC0_PIN (*((volatile unsigned int *)(0x42A79020UL)))
#define bM4_PORT_PCRC0_INVE (*((volatile unsigned int *)(0x42A79024UL)))
#define bM4_PORT_PCRC0_INTE (*((volatile unsigned int *)(0x42A79030UL)))
#define bM4_PORT_PCRC0_LTE (*((volatile unsigned int *)(0x42A79038UL)))
#define bM4_PORT_PCRC0_DDIS (*((volatile unsigned int *)(0x42A7903CUL)))
#define bM4_PORT_PFSRC0_FSEL0 (*((volatile unsigned int *)(0x42A79040UL)))
#define bM4_PORT_PFSRC0_FSEL1 (*((volatile unsigned int *)(0x42A79044UL)))
#define bM4_PORT_PFSRC0_FSEL2 (*((volatile unsigned int *)(0x42A79048UL)))
#define bM4_PORT_PFSRC0_FSEL3 (*((volatile unsigned int *)(0x42A7904CUL)))
#define bM4_PORT_PFSRC0_FSEL4 (*((volatile unsigned int *)(0x42A79050UL)))
#define bM4_PORT_PFSRC0_FSEL5 (*((volatile unsigned int *)(0x42A79054UL)))
#define bM4_PORT_PFSRC0_BFE (*((volatile unsigned int *)(0x42A79060UL)))
#define bM4_PORT_PCRC1_POUT (*((volatile unsigned int *)(0x42A79080UL)))
#define bM4_PORT_PCRC1_POUTE (*((volatile unsigned int *)(0x42A79084UL)))
#define bM4_PORT_PCRC1_NOD (*((volatile unsigned int *)(0x42A79088UL)))
#define bM4_PORT_PCRC1_DRV0 (*((volatile unsigned int *)(0x42A79090UL)))
#define bM4_PORT_PCRC1_DRV1 (*((volatile unsigned int *)(0x42A79094UL)))
#define bM4_PORT_PCRC1_PUU (*((volatile unsigned int *)(0x42A79098UL)))
#define bM4_PORT_PCRC1_PIN (*((volatile unsigned int *)(0x42A790A0UL)))
#define bM4_PORT_PCRC1_INVE (*((volatile unsigned int *)(0x42A790A4UL)))
#define bM4_PORT_PCRC1_INTE (*((volatile unsigned int *)(0x42A790B0UL)))
#define bM4_PORT_PCRC1_LTE (*((volatile unsigned int *)(0x42A790B8UL)))
#define bM4_PORT_PCRC1_DDIS (*((volatile unsigned int *)(0x42A790BCUL)))
#define bM4_PORT_PFSRC1_FSEL0 (*((volatile unsigned int *)(0x42A790C0UL)))
#define bM4_PORT_PFSRC1_FSEL1 (*((volatile unsigned int *)(0x42A790C4UL)))
#define bM4_PORT_PFSRC1_FSEL2 (*((volatile unsigned int *)(0x42A790C8UL)))
#define bM4_PORT_PFSRC1_FSEL3 (*((volatile unsigned int *)(0x42A790CCUL)))
#define bM4_PORT_PFSRC1_FSEL4 (*((volatile unsigned int *)(0x42A790D0UL)))
#define bM4_PORT_PFSRC1_FSEL5 (*((volatile unsigned int *)(0x42A790D4UL)))
#define bM4_PORT_PFSRC1_BFE (*((volatile unsigned int *)(0x42A790E0UL)))
#define bM4_PORT_PCRC2_POUT (*((volatile unsigned int *)(0x42A79100UL)))
#define bM4_PORT_PCRC2_POUTE (*((volatile unsigned int *)(0x42A79104UL)))
#define bM4_PORT_PCRC2_NOD (*((volatile unsigned int *)(0x42A79108UL)))
#define bM4_PORT_PCRC2_DRV0 (*((volatile unsigned int *)(0x42A79110UL)))
#define bM4_PORT_PCRC2_DRV1 (*((volatile unsigned int *)(0x42A79114UL)))
#define bM4_PORT_PCRC2_PUU (*((volatile unsigned int *)(0x42A79118UL)))
#define bM4_PORT_PCRC2_PIN (*((volatile unsigned int *)(0x42A79120UL)))
#define bM4_PORT_PCRC2_INVE (*((volatile unsigned int *)(0x42A79124UL)))
#define bM4_PORT_PCRC2_INTE (*((volatile unsigned int *)(0x42A79130UL)))
#define bM4_PORT_PCRC2_LTE (*((volatile unsigned int *)(0x42A79138UL)))
#define bM4_PORT_PCRC2_DDIS (*((volatile unsigned int *)(0x42A7913CUL)))
#define bM4_PORT_PFSRC2_FSEL0 (*((volatile unsigned int *)(0x42A79140UL)))
#define bM4_PORT_PFSRC2_FSEL1 (*((volatile unsigned int *)(0x42A79144UL)))
#define bM4_PORT_PFSRC2_FSEL2 (*((volatile unsigned int *)(0x42A79148UL)))
#define bM4_PORT_PFSRC2_FSEL3 (*((volatile unsigned int *)(0x42A7914CUL)))
#define bM4_PORT_PFSRC2_FSEL4 (*((volatile unsigned int *)(0x42A79150UL)))
#define bM4_PORT_PFSRC2_FSEL5 (*((volatile unsigned int *)(0x42A79154UL)))
#define bM4_PORT_PFSRC2_BFE (*((volatile unsigned int *)(0x42A79160UL)))
#define bM4_PORT_PCRC3_POUT (*((volatile unsigned int *)(0x42A79180UL)))
#define bM4_PORT_PCRC3_POUTE (*((volatile unsigned int *)(0x42A79184UL)))
#define bM4_PORT_PCRC3_NOD (*((volatile unsigned int *)(0x42A79188UL)))
#define bM4_PORT_PCRC3_DRV0 (*((volatile unsigned int *)(0x42A79190UL)))
#define bM4_PORT_PCRC3_DRV1 (*((volatile unsigned int *)(0x42A79194UL)))
#define bM4_PORT_PCRC3_PUU (*((volatile unsigned int *)(0x42A79198UL)))
#define bM4_PORT_PCRC3_PIN (*((volatile unsigned int *)(0x42A791A0UL)))
#define bM4_PORT_PCRC3_INVE (*((volatile unsigned int *)(0x42A791A4UL)))
#define bM4_PORT_PCRC3_INTE (*((volatile unsigned int *)(0x42A791B0UL)))
