MarlinFirmware/Marlin/Marlin/lib/h32_core/main/hdsc32core/common/hc32f46x.h
#define bM4_PORT_PCRC3_LTE (*((volatile unsigned int *)(0x42A791B8UL)))
#define bM4_PORT_PCRC3_DDIS (*((volatile unsigned int *)(0x42A791BCUL)))
#define bM4_PORT_PFSRC3_FSEL0 (*((volatile unsigned int *)(0x42A791C0UL)))
#define bM4_PORT_PFSRC3_FSEL1 (*((volatile unsigned int *)(0x42A791C4UL)))
#define bM4_PORT_PFSRC3_FSEL2 (*((volatile unsigned int *)(0x42A791C8UL)))
#define bM4_PORT_PFSRC3_FSEL3 (*((volatile unsigned int *)(0x42A791CCUL)))
#define bM4_PORT_PFSRC3_FSEL4 (*((volatile unsigned int *)(0x42A791D0UL)))
#define bM4_PORT_PFSRC3_FSEL5 (*((volatile unsigned int *)(0x42A791D4UL)))
#define bM4_PORT_PFSRC3_BFE (*((volatile unsigned int *)(0x42A791E0UL)))
#define bM4_PORT_PCRC4_POUT (*((volatile unsigned int *)(0x42A79200UL)))
#define bM4_PORT_PCRC4_POUTE (*((volatile unsigned int *)(0x42A79204UL)))
#define bM4_PORT_PCRC4_NOD (*((volatile unsigned int *)(0x42A79208UL)))
#define bM4_PORT_PCRC4_DRV0 (*((volatile unsigned int *)(0x42A79210UL)))
#define bM4_PORT_PCRC4_DRV1 (*((volatile unsigned int *)(0x42A79214UL)))
#define bM4_PORT_PCRC4_PUU (*((volatile unsigned int *)(0x42A79218UL)))
#define bM4_PORT_PCRC4_PIN (*((volatile unsigned int *)(0x42A79220UL)))
#define bM4_PORT_PCRC4_INVE (*((volatile unsigned int *)(0x42A79224UL)))
#define bM4_PORT_PCRC4_INTE (*((volatile unsigned int *)(0x42A79230UL)))
#define bM4_PORT_PCRC4_LTE (*((volatile unsigned int *)(0x42A79238UL)))
#define bM4_PORT_PCRC4_DDIS (*((volatile unsigned int *)(0x42A7923CUL)))
#define bM4_PORT_PFSRC4_FSEL0 (*((volatile unsigned int *)(0x42A79240UL)))
#define bM4_PORT_PFSRC4_FSEL1 (*((volatile unsigned int *)(0x42A79244UL)))
#define bM4_PORT_PFSRC4_FSEL2 (*((volatile unsigned int *)(0x42A79248UL)))
#define bM4_PORT_PFSRC4_FSEL3 (*((volatile unsigned int *)(0x42A7924CUL)))
#define bM4_PORT_PFSRC4_FSEL4 (*((volatile unsigned int *)(0x42A79250UL)))
#define bM4_PORT_PFSRC4_FSEL5 (*((volatile unsigned int *)(0x42A79254UL)))
#define bM4_PORT_PFSRC4_BFE (*((volatile unsigned int *)(0x42A79260UL)))
#define bM4_PORT_PCRC5_POUT (*((volatile unsigned int *)(0x42A79280UL)))
#define bM4_PORT_PCRC5_POUTE (*((volatile unsigned int *)(0x42A79284UL)))
#define bM4_PORT_PCRC5_NOD (*((volatile unsigned int *)(0x42A79288UL)))
#define bM4_PORT_PCRC5_DRV0 (*((volatile unsigned int *)(0x42A79290UL)))
#define bM4_PORT_PCRC5_DRV1 (*((volatile unsigned int *)(0x42A79294UL)))
#define bM4_PORT_PCRC5_PUU (*((volatile unsigned int *)(0x42A79298UL)))
#define bM4_PORT_PCRC5_PIN (*((volatile unsigned int *)(0x42A792A0UL)))
#define bM4_PORT_PCRC5_INVE (*((volatile unsigned int *)(0x42A792A4UL)))
#define bM4_PORT_PCRC5_INTE (*((volatile unsigned int *)(0x42A792B0UL)))
#define bM4_PORT_PCRC5_LTE (*((volatile unsigned int *)(0x42A792B8UL)))
#define bM4_PORT_PCRC5_DDIS (*((volatile unsigned int *)(0x42A792BCUL)))
#define bM4_PORT_PFSRC5_FSEL0 (*((volatile unsigned int *)(0x42A792C0UL)))
#define bM4_PORT_PFSRC5_FSEL1 (*((volatile unsigned int *)(0x42A792C4UL)))
#define bM4_PORT_PFSRC5_FSEL2 (*((volatile unsigned int *)(0x42A792C8UL)))
#define bM4_PORT_PFSRC5_FSEL3 (*((volatile unsigned int *)(0x42A792CCUL)))
#define bM4_PORT_PFSRC5_FSEL4 (*((volatile unsigned int *)(0x42A792D0UL)))
#define bM4_PORT_PFSRC5_FSEL5 (*((volatile unsigned int *)(0x42A792D4UL)))
#define bM4_PORT_PFSRC5_BFE (*((volatile unsigned int *)(0x42A792E0UL)))
#define bM4_PORT_PCRC6_POUT (*((volatile unsigned int *)(0x42A79300UL)))
#define bM4_PORT_PCRC6_POUTE (*((volatile unsigned int *)(0x42A79304UL)))
#define bM4_PORT_PCRC6_NOD (*((volatile unsigned int *)(0x42A79308UL)))
#define bM4_PORT_PCRC6_DRV0 (*((volatile unsigned int *)(0x42A79310UL)))
#define bM4_PORT_PCRC6_DRV1 (*((volatile unsigned int *)(0x42A79314UL)))
#define bM4_PORT_PCRC6_PUU (*((volatile unsigned int *)(0x42A79318UL)))
#define bM4_PORT_PCRC6_PIN (*((volatile unsigned int *)(0x42A79320UL)))
#define bM4_PORT_PCRC6_INVE (*((volatile unsigned int *)(0x42A79324UL)))
#define bM4_PORT_PCRC6_INTE (*((volatile unsigned int *)(0x42A79330UL)))
#define bM4_PORT_PCRC6_LTE (*((volatile unsigned int *)(0x42A79338UL)))
#define bM4_PORT_PCRC6_DDIS (*((volatile unsigned int *)(0x42A7933CUL)))
#define bM4_PORT_PFSRC6_FSEL0 (*((volatile unsigned int *)(0x42A79340UL)))
#define bM4_PORT_PFSRC6_FSEL1 (*((volatile unsigned int *)(0x42A79344UL)))
#define bM4_PORT_PFSRC6_FSEL2 (*((volatile unsigned int *)(0x42A79348UL)))
#define bM4_PORT_PFSRC6_FSEL3 (*((volatile unsigned int *)(0x42A7934CUL)))
#define bM4_PORT_PFSRC6_FSEL4 (*((volatile unsigned int *)(0x42A79350UL)))
#define bM4_PORT_PFSRC6_FSEL5 (*((volatile unsigned int *)(0x42A79354UL)))
#define bM4_PORT_PFSRC6_BFE (*((volatile unsigned int *)(0x42A79360UL)))
#define bM4_PORT_PCRC7_POUT (*((volatile unsigned int *)(0x42A79380UL)))
#define bM4_PORT_PCRC7_POUTE (*((volatile unsigned int *)(0x42A79384UL)))
#define bM4_PORT_PCRC7_NOD (*((volatile unsigned int *)(0x42A79388UL)))
#define bM4_PORT_PCRC7_DRV0 (*((volatile unsigned int *)(0x42A79390UL)))
#define bM4_PORT_PCRC7_DRV1 (*((volatile unsigned int *)(0x42A79394UL)))
#define bM4_PORT_PCRC7_PUU (*((volatile unsigned int *)(0x42A79398UL)))
#define bM4_PORT_PCRC7_PIN (*((volatile unsigned int *)(0x42A793A0UL)))
#define bM4_PORT_PCRC7_INVE (*((volatile unsigned int *)(0x42A793A4UL)))
#define bM4_PORT_PCRC7_INTE (*((volatile unsigned int *)(0x42A793B0UL)))
#define bM4_PORT_PCRC7_LTE (*((volatile unsigned int *)(0x42A793B8UL)))
#define bM4_PORT_PCRC7_DDIS (*((volatile unsigned int *)(0x42A793BCUL)))
#define bM4_PORT_PFSRC7_FSEL0 (*((volatile unsigned int *)(0x42A793C0UL)))
#define bM4_PORT_PFSRC7_FSEL1 (*((volatile unsigned int *)(0x42A793C4UL)))
#define bM4_PORT_PFSRC7_FSEL2 (*((volatile unsigned int *)(0x42A793C8UL)))
#define bM4_PORT_PFSRC7_FSEL3 (*((volatile unsigned int *)(0x42A793CCUL)))
#define bM4_PORT_PFSRC7_FSEL4 (*((volatile unsigned int *)(0x42A793D0UL)))
#define bM4_PORT_PFSRC7_FSEL5 (*((volatile unsigned int *)(0x42A793D4UL)))
#define bM4_PORT_PFSRC7_BFE (*((volatile unsigned int *)(0x42A793E0UL)))
#define bM4_PORT_PCRC8_POUT (*((volatile unsigned int *)(0x42A79400UL)))
#define bM4_PORT_PCRC8_POUTE (*((volatile unsigned int *)(0x42A79404UL)))
#define bM4_PORT_PCRC8_NOD (*((volatile unsigned int *)(0x42A79408UL)))
#define bM4_PORT_PCRC8_DRV0 (*((volatile unsigned int *)(0x42A79410UL)))
#define bM4_PORT_PCRC8_DRV1 (*((volatile unsigned int *)(0x42A79414UL)))
#define bM4_PORT_PCRC8_PUU (*((volatile unsigned int *)(0x42A79418UL)))
#define bM4_PORT_PCRC8_PIN (*((volatile unsigned int *)(0x42A79420UL)))
#define bM4_PORT_PCRC8_INVE (*((volatile unsigned int *)(0x42A79424UL)))
#define bM4_PORT_PCRC8_INTE (*((volatile unsigned int *)(0x42A79430UL)))
#define bM4_PORT_PCRC8_LTE (*((volatile unsigned int *)(0x42A79438UL)))
#define bM4_PORT_PCRC8_DDIS (*((volatile unsigned int *)(0x42A7943CUL)))
#define bM4_PORT_PFSRC8_FSEL0 (*((volatile unsigned int *)(0x42A79440UL)))
#define bM4_PORT_PFSRC8_FSEL1 (*((volatile unsigned int *)(0x42A79444UL)))
#define bM4_PORT_PFSRC8_FSEL2 (*((volatile unsigned int *)(0x42A79448UL)))
#define bM4_PORT_PFSRC8_FSEL3 (*((volatile unsigned int *)(0x42A7944CUL)))
#define bM4_PORT_PFSRC8_FSEL4 (*((volatile unsigned int *)(0x42A79450UL)))
#define bM4_PORT_PFSRC8_FSEL5 (*((volatile unsigned int *)(0x42A79454UL)))
#define bM4_PORT_PFSRC8_BFE (*((volatile unsigned int *)(0x42A79460UL)))
#define bM4_PORT_PCRC9_POUT (*((volatile unsigned int *)(0x42A79480UL)))
#define bM4_PORT_PCRC9_POUTE (*((volatile unsigned int *)(0x42A79484UL)))
#define bM4_PORT_PCRC9_NOD (*((volatile unsigned int *)(0x42A79488UL)))
#define bM4_PORT_PCRC9_DRV0 (*((volatile unsigned int *)(0x42A79490UL)))
#define bM4_PORT_PCRC9_DRV1 (*((volatile unsigned int *)(0x42A79494UL)))
#define bM4_PORT_PCRC9_PUU (*((volatile unsigned int *)(0x42A79498UL)))
#define bM4_PORT_PCRC9_PIN (*((volatile unsigned int *)(0x42A794A0UL)))
#define bM4_PORT_PCRC9_INVE (*((volatile unsigned int *)(0x42A794A4UL)))
#define bM4_PORT_PCRC9_INTE (*((volatile unsigned int *)(0x42A794B0UL)))
#define bM4_PORT_PCRC9_LTE (*((volatile unsigned int *)(0x42A794B8UL)))
#define bM4_PORT_PCRC9_DDIS (*((volatile unsigned int *)(0x42A794BCUL)))
#define bM4_PORT_PFSRC9_FSEL0 (*((volatile unsigned int *)(0x42A794C0UL)))
#define bM4_PORT_PFSRC9_FSEL1 (*((volatile unsigned int *)(0x42A794C4UL)))
#define bM4_PORT_PFSRC9_FSEL2 (*((volatile unsigned int *)(0x42A794C8UL)))
#define bM4_PORT_PFSRC9_FSEL3 (*((volatile unsigned int *)(0x42A794CCUL)))
#define bM4_PORT_PFSRC9_FSEL4 (*((volatile unsigned int *)(0x42A794D0UL)))
#define bM4_PORT_PFSRC9_FSEL5 (*((volatile unsigned int *)(0x42A794D4UL)))
#define bM4_PORT_PFSRC9_BFE (*((volatile unsigned int *)(0x42A794E0UL)))
#define bM4_PORT_PCRC10_POUT (*((volatile unsigned int *)(0x42A79500UL)))
#define bM4_PORT_PCRC10_POUTE (*((volatile unsigned int *)(0x42A79504UL)))
#define bM4_PORT_PCRC10_NOD (*((volatile unsigned int *)(0x42A79508UL)))
#define bM4_PORT_PCRC10_DRV0 (*((volatile unsigned int *)(0x42A79510UL)))
#define bM4_PORT_PCRC10_DRV1 (*((volatile unsigned int *)(0x42A79514UL)))
#define bM4_PORT_PCRC10_PUU (*((volatile unsigned int *)(0x42A79518UL)))
#define bM4_PORT_PCRC10_PIN (*((volatile unsigned int *)(0x42A79520UL)))
#define bM4_PORT_PCRC10_INVE (*((volatile unsigned int *)(0x42A79524UL)))
#define bM4_PORT_PCRC10_INTE (*((volatile unsigned int *)(0x42A79530UL)))
#define bM4_PORT_PCRC10_LTE (*((volatile unsigned int *)(0x42A79538UL)))
#define bM4_PORT_PCRC10_DDIS (*((volatile unsigned int *)(0x42A7953CUL)))
#define bM4_PORT_PFSRC10_FSEL0 (*((volatile unsigned int *)(0x42A79540UL)))
#define bM4_PORT_PFSRC10_FSEL1 (*((volatile unsigned int *)(0x42A79544UL)))
#define bM4_PORT_PFSRC10_FSEL2 (*((volatile unsigned int *)(0x42A79548UL)))
#define bM4_PORT_PFSRC10_FSEL3 (*((volatile unsigned int *)(0x42A7954CUL)))
#define bM4_PORT_PFSRC10_FSEL4 (*((volatile unsigned int *)(0x42A79550UL)))
#define bM4_PORT_PFSRC10_FSEL5 (*((volatile unsigned int *)(0x42A79554UL)))
#define bM4_PORT_PFSRC10_BFE (*((volatile unsigned int *)(0x42A79560UL)))
#define bM4_PORT_PCRC11_POUT (*((volatile unsigned int *)(0x42A79580UL)))
#define bM4_PORT_PCRC11_POUTE (*((volatile unsigned int *)(0x42A79584UL)))
#define bM4_PORT_PCRC11_NOD (*((volatile unsigned int *)(0x42A79588UL)))
#define bM4_PORT_PCRC11_DRV0 (*((volatile unsigned int *)(0x42A79590UL)))
#define bM4_PORT_PCRC11_DRV1 (*((volatile unsigned int *)(0x42A79594UL)))
#define bM4_PORT_PCRC11_PUU (*((volatile unsigned int *)(0x42A79598UL)))
#define bM4_PORT_PCRC11_PIN (*((volatile unsigned int *)(0x42A795A0UL)))
#define bM4_PORT_PCRC11_INVE (*((volatile unsigned int *)(0x42A795A4UL)))
#define bM4_PORT_PCRC11_INTE (*((volatile unsigned int *)(0x42A795B0UL)))
#define bM4_PORT_PCRC11_LTE (*((volatile unsigned int *)(0x42A795B8UL)))
#define bM4_PORT_PCRC11_DDIS (*((volatile unsigned int *)(0x42A795BCUL)))
#define bM4_PORT_PFSRC11_FSEL0 (*((volatile unsigned int *)(0x42A795C0UL)))
#define bM4_PORT_PFSRC11_FSEL1 (*((volatile unsigned int *)(0x42A795C4UL)))
#define bM4_PORT_PFSRC11_FSEL2 (*((volatile unsigned int *)(0x42A795C8UL)))
#define bM4_PORT_PFSRC11_FSEL3 (*((volatile unsigned int *)(0x42A795CCUL)))
#define bM4_PORT_PFSRC11_FSEL4 (*((volatile unsigned int *)(0x42A795D0UL)))
#define bM4_PORT_PFSRC11_FSEL5 (*((volatile unsigned int *)(0x42A795D4UL)))
#define bM4_PORT_PFSRC11_BFE (*((volatile unsigned int *)(0x42A795E0UL)))
#define bM4_PORT_PCRC12_POUT (*((volatile unsigned int *)(0x42A79600UL)))
#define bM4_PORT_PCRC12_POUTE (*((volatile unsigned int *)(0x42A79604UL)))
#define bM4_PORT_PCRC12_NOD (*((volatile unsigned int *)(0x42A79608UL)))
#define bM4_PORT_PCRC12_DRV0 (*((volatile unsigned int *)(0x42A79610UL)))
#define bM4_PORT_PCRC12_DRV1 (*((volatile unsigned int *)(0x42A79614UL)))
#define bM4_PORT_PCRC12_PUU (*((volatile unsigned int *)(0x42A79618UL)))
#define bM4_PORT_PCRC12_PIN (*((volatile unsigned int *)(0x42A79620UL)))
#define bM4_PORT_PCRC12_INVE (*((volatile unsigned int *)(0x42A79624UL)))
#define bM4_PORT_PCRC12_INTE (*((volatile unsigned int *)(0x42A79630UL)))
#define bM4_PORT_PCRC12_LTE (*((volatile unsigned int *)(0x42A79638UL)))
#define bM4_PORT_PCRC12_DDIS (*((volatile unsigned int *)(0x42A7963CUL)))
#define bM4_PORT_PFSRC12_FSEL0 (*((volatile unsigned int *)(0x42A79640UL)))
#define bM4_PORT_PFSRC12_FSEL1 (*((volatile unsigned int *)(0x42A79644UL)))
#define bM4_PORT_PFSRC12_FSEL2 (*((volatile unsigned int *)(0x42A79648UL)))
#define bM4_PORT_PFSRC12_FSEL3 (*((volatile unsigned int *)(0x42A7964CUL)))
#define bM4_PORT_PFSRC12_FSEL4 (*((volatile unsigned int *)(0x42A79650UL)))
#define bM4_PORT_PFSRC12_FSEL5 (*((volatile unsigned int *)(0x42A79654UL)))
#define bM4_PORT_PFSRC12_BFE (*((volatile unsigned int *)(0x42A79660UL)))
#define bM4_PORT_PCRC13_POUT (*((volatile unsigned int *)(0x42A79680UL)))
#define bM4_PORT_PCRC13_POUTE (*((volatile unsigned int *)(0x42A79684UL)))
#define bM4_PORT_PCRC13_NOD (*((volatile unsigned int *)(0x42A79688UL)))
#define bM4_PORT_PCRC13_DRV0 (*((volatile unsigned int *)(0x42A79690UL)))
#define bM4_PORT_PCRC13_DRV1 (*((volatile unsigned int *)(0x42A79694UL)))
#define bM4_PORT_PCRC13_PUU (*((volatile unsigned int *)(0x42A79698UL)))
#define bM4_PORT_PCRC13_PIN (*((volatile unsigned int *)(0x42A796A0UL)))
#define bM4_PORT_PCRC13_INVE (*((volatile unsigned int *)(0x42A796A4UL)))
#define bM4_PORT_PCRC13_INTE (*((volatile unsigned int *)(0x42A796B0UL)))
#define bM4_PORT_PCRC13_LTE (*((volatile unsigned int *)(0x42A796B8UL)))
#define bM4_PORT_PCRC13_DDIS (*((volatile unsigned int *)(0x42A796BCUL)))
#define bM4_PORT_PFSRC13_FSEL0 (*((volatile unsigned int *)(0x42A796C0UL)))
#define bM4_PORT_PFSRC13_FSEL1 (*((volatile unsigned int *)(0x42A796C4UL)))
#define bM4_PORT_PFSRC13_FSEL2 (*((volatile unsigned int *)(0x42A796C8UL)))
#define bM4_PORT_PFSRC13_FSEL3 (*((volatile unsigned int *)(0x42A796CCUL)))
#define bM4_PORT_PFSRC13_FSEL4 (*((volatile unsigned int *)(0x42A796D0UL)))
#define bM4_PORT_PFSRC13_FSEL5 (*((volatile unsigned int *)(0x42A796D4UL)))
#define bM4_PORT_PFSRC13_BFE (*((volatile unsigned int *)(0x42A796E0UL)))
#define bM4_PORT_PCRC14_POUT (*((volatile unsigned int *)(0x42A79700UL)))
#define bM4_PORT_PCRC14_POUTE (*((volatile unsigned int *)(0x42A79704UL)))
#define bM4_PORT_PCRC14_NOD (*((volatile unsigned int *)(0x42A79708UL)))
#define bM4_PORT_PCRC14_DRV0 (*((volatile unsigned int *)(0x42A79710UL)))
#define bM4_PORT_PCRC14_DRV1 (*((volatile unsigned int *)(0x42A79714UL)))
#define bM4_PORT_PCRC14_PUU (*((volatile unsigned int *)(0x42A79718UL)))
#define bM4_PORT_PCRC14_PIN (*((volatile unsigned int *)(0x42A79720UL)))
#define bM4_PORT_PCRC14_INVE (*((volatile unsigned int *)(0x42A79724UL)))
#define bM4_PORT_PCRC14_INTE (*((volatile unsigned int *)(0x42A79730UL)))
#define bM4_PORT_PCRC14_LTE (*((volatile unsigned int *)(0x42A79738UL)))
#define bM4_PORT_PCRC14_DDIS (*((volatile unsigned int *)(0x42A7973CUL)))
#define bM4_PORT_PFSRC14_FSEL0 (*((volatile unsigned int *)(0x42A79740UL)))
#define bM4_PORT_PFSRC14_FSEL1 (*((volatile unsigned int *)(0x42A79744UL)))
#define bM4_PORT_PFSRC14_FSEL2 (*((volatile unsigned int *)(0x42A79748UL)))
#define bM4_PORT_PFSRC14_FSEL3 (*((volatile unsigned int *)(0x42A7974CUL)))
#define bM4_PORT_PFSRC14_FSEL4 (*((volatile unsigned int *)(0x42A79750UL)))
#define bM4_PORT_PFSRC14_FSEL5 (*((volatile unsigned int *)(0x42A79754UL)))
#define bM4_PORT_PFSRC14_BFE (*((volatile unsigned int *)(0x42A79760UL)))
#define bM4_PORT_PCRC15_POUT (*((volatile unsigned int *)(0x42A79780UL)))
#define bM4_PORT_PCRC15_POUTE (*((volatile unsigned int *)(0x42A79784UL)))
#define bM4_PORT_PCRC15_NOD (*((volatile unsigned int *)(0x42A79788UL)))
#define bM4_PORT_PCRC15_DRV0 (*((volatile unsigned int *)(0x42A79790UL)))
#define bM4_PORT_PCRC15_DRV1 (*((volatile unsigned int *)(0x42A79794UL)))
#define bM4_PORT_PCRC15_PUU (*((volatile unsigned int *)(0x42A79798UL)))
#define bM4_PORT_PCRC15_PIN (*((volatile unsigned int *)(0x42A797A0UL)))
#define bM4_PORT_PCRC15_INVE (*((volatile unsigned int *)(0x42A797A4UL)))
#define bM4_PORT_PCRC15_INTE (*((volatile unsigned int *)(0x42A797B0UL)))
#define bM4_PORT_PCRC15_LTE (*((volatile unsigned int *)(0x42A797B8UL)))
#define bM4_PORT_PCRC15_DDIS (*((volatile unsigned int *)(0x42A797BCUL)))
#define bM4_PORT_PFSRC15_FSEL0 (*((volatile unsigned int *)(0x42A797C0UL)))
#define bM4_PORT_PFSRC15_FSEL1 (*((volatile unsigned int *)(0x42A797C4UL)))
#define bM4_PORT_PFSRC15_FSEL2 (*((volatile unsigned int *)(0x42A797C8UL)))
#define bM4_PORT_PFSRC15_FSEL3 (*((volatile unsigned int *)(0x42A797CCUL)))
#define bM4_PORT_PFSRC15_FSEL4 (*((volatile unsigned int *)(0x42A797D0UL)))
#define bM4_PORT_PFSRC15_FSEL5 (*((volatile unsigned int *)(0x42A797D4UL)))
#define bM4_PORT_PFSRC15_BFE (*((volatile unsigned int *)(0x42A797E0UL)))
#define bM4_PORT_PCRD0_POUT (*((volatile unsigned int *)(0x42A79800UL)))
#define bM4_PORT_PCRD0_POUTE (*((volatile unsigned int *)(0x42A79804UL)))
#define bM4_PORT_PCRD0_NOD (*((volatile unsigned int *)(0x42A79808UL)))
#define bM4_PORT_PCRD0_DRV0 (*((volatile unsigned int *)(0x42A79810UL)))
#define bM4_PORT_PCRD0_DRV1 (*((volatile unsigned int *)(0x42A79814UL)))
#define bM4_PORT_PCRD0_PUU (*((volatile unsigned int *)(0x42A79818UL)))
#define bM4_PORT_PCRD0_PIN (*((volatile unsigned int *)(0x42A79820UL)))
#define bM4_PORT_PCRD0_INVE (*((volatile unsigned int *)(0x42A79824UL)))
#define bM4_PORT_PCRD0_INTE (*((volatile unsigned int *)(0x42A79830UL)))
#define bM4_PORT_PCRD0_LTE (*((volatile unsigned int *)(0x42A79838UL)))
#define bM4_PORT_PCRD0_DDIS (*((volatile unsigned int *)(0x42A7983CUL)))
#define bM4_PORT_PFSRD0_FSEL0 (*((volatile unsigned int *)(0x42A79840UL)))
#define bM4_PORT_PFSRD0_FSEL1 (*((volatile unsigned int *)(0x42A79844UL)))
#define bM4_PORT_PFSRD0_FSEL2 (*((volatile unsigned int *)(0x42A79848UL)))
#define bM4_PORT_PFSRD0_FSEL3 (*((volatile unsigned int *)(0x42A7984CUL)))
#define bM4_PORT_PFSRD0_FSEL4 (*((volatile unsigned int *)(0x42A79850UL)))
#define bM4_PORT_PFSRD0_FSEL5 (*((volatile unsigned int *)(0x42A79854UL)))
#define bM4_PORT_PFSRD0_BFE (*((volatile unsigned int *)(0x42A79860UL)))
#define bM4_PORT_PCRD1_POUT (*((volatile unsigned int *)(0x42A79880UL)))
#define bM4_PORT_PCRD1_POUTE (*((volatile unsigned int *)(0x42A79884UL)))
#define bM4_PORT_PCRD1_NOD (*((volatile unsigned int *)(0x42A79888UL)))
#define bM4_PORT_PCRD1_DRV0 (*((volatile unsigned int *)(0x42A79890UL)))
#define bM4_PORT_PCRD1_DRV1 (*((volatile unsigned int *)(0x42A79894UL)))
#define bM4_PORT_PCRD1_PUU (*((volatile unsigned int *)(0x42A79898UL)))
#define bM4_PORT_PCRD1_PIN (*((volatile unsigned int *)(0x42A798A0UL)))
#define bM4_PORT_PCRD1_INVE (*((volatile unsigned int *)(0x42A798A4UL)))
#define bM4_PORT_PCRD1_INTE (*((volatile unsigned int *)(0x42A798B0UL)))
#define bM4_PORT_PCRD1_LTE (*((volatile unsigned int *)(0x42A798B8UL)))
#define bM4_PORT_PCRD1_DDIS (*((volatile unsigned int *)(0x42A798BCUL)))
#define bM4_PORT_PFSRD1_FSEL0 (*((volatile unsigned int *)(0x42A798C0UL)))
#define bM4_PORT_PFSRD1_FSEL1 (*((volatile unsigned int *)(0x42A798C4UL)))
#define bM4_PORT_PFSRD1_FSEL2 (*((volatile unsigned int *)(0x42A798C8UL)))
#define bM4_PORT_PFSRD1_FSEL3 (*((volatile unsigned int *)(0x42A798CCUL)))
#define bM4_PORT_PFSRD1_FSEL4 (*((volatile unsigned int *)(0x42A798D0UL)))
#define bM4_PORT_PFSRD1_FSEL5 (*((volatile unsigned int *)(0x42A798D4UL)))
#define bM4_PORT_PFSRD1_BFE (*((volatile unsigned int *)(0x42A798E0UL)))
#define bM4_PORT_PCRD2_POUT (*((volatile unsigned int *)(0x42A79900UL)))
#define bM4_PORT_PCRD2_POUTE (*((volatile unsigned int *)(0x42A79904UL)))
#define bM4_PORT_PCRD2_NOD (*((volatile unsigned int *)(0x42A79908UL)))
#define bM4_PORT_PCRD2_DRV0 (*((volatile unsigned int *)(0x42A79910UL)))
#define bM4_PORT_PCRD2_DRV1 (*((volatile unsigned int *)(0x42A79914UL)))
#define bM4_PORT_PCRD2_PUU (*((volatile unsigned int *)(0x42A79918UL)))
#define bM4_PORT_PCRD2_PIN (*((volatile unsigned int *)(0x42A79920UL)))
#define bM4_PORT_PCRD2_INVE (*((volatile unsigned int *)(0x42A79924UL)))
#define bM4_PORT_PCRD2_INTE (*((volatile unsigned int *)(0x42A79930UL)))
#define bM4_PORT_PCRD2_LTE (*((volatile unsigned int *)(0x42A79938UL)))
#define bM4_PORT_PCRD2_DDIS (*((volatile unsigned int *)(0x42A7993CUL)))
#define bM4_PORT_PFSRD2_FSEL0 (*((volatile unsigned int *)(0x42A79940UL)))
#define bM4_PORT_PFSRD2_FSEL1 (*((volatile unsigned int *)(0x42A79944UL)))
#define bM4_PORT_PFSRD2_FSEL2 (*((volatile unsigned int *)(0x42A79948UL)))
#define bM4_PORT_PFSRD2_FSEL3 (*((volatile unsigned int *)(0x42A7994CUL)))
#define bM4_PORT_PFSRD2_FSEL4 (*((volatile unsigned int *)(0x42A79950UL)))
#define bM4_PORT_PFSRD2_FSEL5 (*((volatile unsigned int *)(0x42A79954UL)))
#define bM4_PORT_PFSRD2_BFE (*((volatile unsigned int *)(0x42A79960UL)))
#define bM4_PORT_PCRD3_POUT (*((volatile unsigned int *)(0x42A79980UL)))
#define bM4_PORT_PCRD3_POUTE (*((volatile unsigned int *)(0x42A79984UL)))
#define bM4_PORT_PCRD3_NOD (*((volatile unsigned int *)(0x42A79988UL)))
#define bM4_PORT_PCRD3_DRV0 (*((volatile unsigned int *)(0x42A79990UL)))
#define bM4_PORT_PCRD3_DRV1 (*((volatile unsigned int *)(0x42A79994UL)))
#define bM4_PORT_PCRD3_PUU (*((volatile unsigned int *)(0x42A79998UL)))
#define bM4_PORT_PCRD3_PIN (*((volatile unsigned int *)(0x42A799A0UL)))
#define bM4_PORT_PCRD3_INVE (*((volatile unsigned int *)(0x42A799A4UL)))
#define bM4_PORT_PCRD3_INTE (*((volatile unsigned int *)(0x42A799B0UL)))
#define bM4_PORT_PCRD3_LTE (*((volatile unsigned int *)(0x42A799B8UL)))
#define bM4_PORT_PCRD3_DDIS (*((volatile unsigned int *)(0x42A799BCUL)))
#define bM4_PORT_PFSRD3_FSEL0 (*((volatile unsigned int *)(0x42A799C0UL)))
#define bM4_PORT_PFSRD3_FSEL1 (*((volatile unsigned int *)(0x42A799C4UL)))
#define bM4_PORT_PFSRD3_FSEL2 (*((volatile unsigned int *)(0x42A799C8UL)))
#define bM4_PORT_PFSRD3_FSEL3 (*((volatile unsigned int *)(0x42A799CCUL)))
#define bM4_PORT_PFSRD3_FSEL4 (*((volatile unsigned int *)(0x42A799D0UL)))
#define bM4_PORT_PFSRD3_FSEL5 (*((volatile unsigned int *)(0x42A799D4UL)))
#define bM4_PORT_PFSRD3_BFE (*((volatile unsigned int *)(0x42A799E0UL)))
#define bM4_PORT_PCRD4_POUT (*((volatile unsigned int *)(0x42A79A00UL)))
#define bM4_PORT_PCRD4_POUTE (*((volatile unsigned int *)(0x42A79A04UL)))
#define bM4_PORT_PCRD4_NOD (*((volatile unsigned int *)(0x42A79A08UL)))
#define bM4_PORT_PCRD4_DRV0 (*((volatile unsigned int *)(0x42A79A10UL)))
#define bM4_PORT_PCRD4_DRV1 (*((volatile unsigned int *)(0x42A79A14UL)))
#define bM4_PORT_PCRD4_PUU (*((volatile unsigned int *)(0x42A79A18UL)))
#define bM4_PORT_PCRD4_PIN (*((volatile unsigned int *)(0x42A79A20UL)))
#define bM4_PORT_PCRD4_INVE (*((volatile unsigned int *)(0x42A79A24UL)))
#define bM4_PORT_PCRD4_INTE (*((volatile unsigned int *)(0x42A79A30UL)))
#define bM4_PORT_PCRD4_LTE (*((volatile unsigned int *)(0x42A79A38UL)))
#define bM4_PORT_PCRD4_DDIS (*((volatile unsigned int *)(0x42A79A3CUL)))
#define bM4_PORT_PFSRD4_FSEL0 (*((volatile unsigned int *)(0x42A79A40UL)))
#define bM4_PORT_PFSRD4_FSEL1 (*((volatile unsigned int *)(0x42A79A44UL)))
#define bM4_PORT_PFSRD4_FSEL2 (*((volatile unsigned int *)(0x42A79A48UL)))
#define bM4_PORT_PFSRD4_FSEL3 (*((volatile unsigned int *)(0x42A79A4CUL)))
#define bM4_PORT_PFSRD4_FSEL4 (*((volatile unsigned int *)(0x42A79A50UL)))
#define bM4_PORT_PFSRD4_FSEL5 (*((volatile unsigned int *)(0x42A79A54UL)))
#define bM4_PORT_PFSRD4_BFE (*((volatile unsigned int *)(0x42A79A60UL)))
#define bM4_PORT_PCRD5_POUT (*((volatile unsigned int *)(0x42A79A80UL)))
#define bM4_PORT_PCRD5_POUTE (*((volatile unsigned int *)(0x42A79A84UL)))
#define bM4_PORT_PCRD5_NOD (*((volatile unsigned int *)(0x42A79A88UL)))
#define bM4_PORT_PCRD5_DRV0 (*((volatile unsigned int *)(0x42A79A90UL)))
#define bM4_PORT_PCRD5_DRV1 (*((volatile unsigned int *)(0x42A79A94UL)))
#define bM4_PORT_PCRD5_PUU (*((volatile unsigned int *)(0x42A79A98UL)))
#define bM4_PORT_PCRD5_PIN (*((volatile unsigned int *)(0x42A79AA0UL)))
#define bM4_PORT_PCRD5_INVE (*((volatile unsigned int *)(0x42A79AA4UL)))
#define bM4_PORT_PCRD5_INTE (*((volatile unsigned int *)(0x42A79AB0UL)))
#define bM4_PORT_PCRD5_LTE (*((volatile unsigned int *)(0x42A79AB8UL)))
