MarlinFirmware/Marlin/Marlin/lib/h32_core/main/hdsc32core/common/hc32f46x.h
#define bM4_PORT_PCRD5_DDIS (*((volatile unsigned int *)(0x42A79ABCUL)))
#define bM4_PORT_PFSRD5_FSEL0 (*((volatile unsigned int *)(0x42A79AC0UL)))
#define bM4_PORT_PFSRD5_FSEL1 (*((volatile unsigned int *)(0x42A79AC4UL)))
#define bM4_PORT_PFSRD5_FSEL2 (*((volatile unsigned int *)(0x42A79AC8UL)))
#define bM4_PORT_PFSRD5_FSEL3 (*((volatile unsigned int *)(0x42A79ACCUL)))
#define bM4_PORT_PFSRD5_FSEL4 (*((volatile unsigned int *)(0x42A79AD0UL)))
#define bM4_PORT_PFSRD5_FSEL5 (*((volatile unsigned int *)(0x42A79AD4UL)))
#define bM4_PORT_PFSRD5_BFE (*((volatile unsigned int *)(0x42A79AE0UL)))
#define bM4_PORT_PCRD6_POUT (*((volatile unsigned int *)(0x42A79B00UL)))
#define bM4_PORT_PCRD6_POUTE (*((volatile unsigned int *)(0x42A79B04UL)))
#define bM4_PORT_PCRD6_NOD (*((volatile unsigned int *)(0x42A79B08UL)))
#define bM4_PORT_PCRD6_DRV0 (*((volatile unsigned int *)(0x42A79B10UL)))
#define bM4_PORT_PCRD6_DRV1 (*((volatile unsigned int *)(0x42A79B14UL)))
#define bM4_PORT_PCRD6_PUU (*((volatile unsigned int *)(0x42A79B18UL)))
#define bM4_PORT_PCRD6_PIN (*((volatile unsigned int *)(0x42A79B20UL)))
#define bM4_PORT_PCRD6_INVE (*((volatile unsigned int *)(0x42A79B24UL)))
#define bM4_PORT_PCRD6_INTE (*((volatile unsigned int *)(0x42A79B30UL)))
#define bM4_PORT_PCRD6_LTE (*((volatile unsigned int *)(0x42A79B38UL)))
#define bM4_PORT_PCRD6_DDIS (*((volatile unsigned int *)(0x42A79B3CUL)))
#define bM4_PORT_PFSRD6_FSEL0 (*((volatile unsigned int *)(0x42A79B40UL)))
#define bM4_PORT_PFSRD6_FSEL1 (*((volatile unsigned int *)(0x42A79B44UL)))
#define bM4_PORT_PFSRD6_FSEL2 (*((volatile unsigned int *)(0x42A79B48UL)))
#define bM4_PORT_PFSRD6_FSEL3 (*((volatile unsigned int *)(0x42A79B4CUL)))
#define bM4_PORT_PFSRD6_FSEL4 (*((volatile unsigned int *)(0x42A79B50UL)))
#define bM4_PORT_PFSRD6_FSEL5 (*((volatile unsigned int *)(0x42A79B54UL)))
#define bM4_PORT_PFSRD6_BFE (*((volatile unsigned int *)(0x42A79B60UL)))
#define bM4_PORT_PCRD7_POUT (*((volatile unsigned int *)(0x42A79B80UL)))
#define bM4_PORT_PCRD7_POUTE (*((volatile unsigned int *)(0x42A79B84UL)))
#define bM4_PORT_PCRD7_NOD (*((volatile unsigned int *)(0x42A79B88UL)))
#define bM4_PORT_PCRD7_DRV0 (*((volatile unsigned int *)(0x42A79B90UL)))
#define bM4_PORT_PCRD7_DRV1 (*((volatile unsigned int *)(0x42A79B94UL)))
#define bM4_PORT_PCRD7_PUU (*((volatile unsigned int *)(0x42A79B98UL)))
#define bM4_PORT_PCRD7_PIN (*((volatile unsigned int *)(0x42A79BA0UL)))
#define bM4_PORT_PCRD7_INVE (*((volatile unsigned int *)(0x42A79BA4UL)))
#define bM4_PORT_PCRD7_INTE (*((volatile unsigned int *)(0x42A79BB0UL)))
#define bM4_PORT_PCRD7_LTE (*((volatile unsigned int *)(0x42A79BB8UL)))
#define bM4_PORT_PCRD7_DDIS (*((volatile unsigned int *)(0x42A79BBCUL)))
#define bM4_PORT_PFSRD7_FSEL0 (*((volatile unsigned int *)(0x42A79BC0UL)))
#define bM4_PORT_PFSRD7_FSEL1 (*((volatile unsigned int *)(0x42A79BC4UL)))
#define bM4_PORT_PFSRD7_FSEL2 (*((volatile unsigned int *)(0x42A79BC8UL)))
#define bM4_PORT_PFSRD7_FSEL3 (*((volatile unsigned int *)(0x42A79BCCUL)))
#define bM4_PORT_PFSRD7_FSEL4 (*((volatile unsigned int *)(0x42A79BD0UL)))
#define bM4_PORT_PFSRD7_FSEL5 (*((volatile unsigned int *)(0x42A79BD4UL)))
#define bM4_PORT_PFSRD7_BFE (*((volatile unsigned int *)(0x42A79BE0UL)))
#define bM4_PORT_PCRD8_POUT (*((volatile unsigned int *)(0x42A79C00UL)))
#define bM4_PORT_PCRD8_POUTE (*((volatile unsigned int *)(0x42A79C04UL)))
#define bM4_PORT_PCRD8_NOD (*((volatile unsigned int *)(0x42A79C08UL)))
#define bM4_PORT_PCRD8_DRV0 (*((volatile unsigned int *)(0x42A79C10UL)))
#define bM4_PORT_PCRD8_DRV1 (*((volatile unsigned int *)(0x42A79C14UL)))
#define bM4_PORT_PCRD8_PUU (*((volatile unsigned int *)(0x42A79C18UL)))
#define bM4_PORT_PCRD8_PIN (*((volatile unsigned int *)(0x42A79C20UL)))
#define bM4_PORT_PCRD8_INVE (*((volatile unsigned int *)(0x42A79C24UL)))
#define bM4_PORT_PCRD8_INTE (*((volatile unsigned int *)(0x42A79C30UL)))
#define bM4_PORT_PCRD8_LTE (*((volatile unsigned int *)(0x42A79C38UL)))
#define bM4_PORT_PCRD8_DDIS (*((volatile unsigned int *)(0x42A79C3CUL)))
#define bM4_PORT_PFSRD8_FSEL0 (*((volatile unsigned int *)(0x42A79C40UL)))
#define bM4_PORT_PFSRD8_FSEL1 (*((volatile unsigned int *)(0x42A79C44UL)))
#define bM4_PORT_PFSRD8_FSEL2 (*((volatile unsigned int *)(0x42A79C48UL)))
#define bM4_PORT_PFSRD8_FSEL3 (*((volatile unsigned int *)(0x42A79C4CUL)))
#define bM4_PORT_PFSRD8_FSEL4 (*((volatile unsigned int *)(0x42A79C50UL)))
#define bM4_PORT_PFSRD8_FSEL5 (*((volatile unsigned int *)(0x42A79C54UL)))
#define bM4_PORT_PFSRD8_BFE (*((volatile unsigned int *)(0x42A79C60UL)))
#define bM4_PORT_PCRD9_POUT (*((volatile unsigned int *)(0x42A79C80UL)))
#define bM4_PORT_PCRD9_POUTE (*((volatile unsigned int *)(0x42A79C84UL)))
#define bM4_PORT_PCRD9_NOD (*((volatile unsigned int *)(0x42A79C88UL)))
#define bM4_PORT_PCRD9_DRV0 (*((volatile unsigned int *)(0x42A79C90UL)))
#define bM4_PORT_PCRD9_DRV1 (*((volatile unsigned int *)(0x42A79C94UL)))
#define bM4_PORT_PCRD9_PUU (*((volatile unsigned int *)(0x42A79C98UL)))
#define bM4_PORT_PCRD9_PIN (*((volatile unsigned int *)(0x42A79CA0UL)))
#define bM4_PORT_PCRD9_INVE (*((volatile unsigned int *)(0x42A79CA4UL)))
#define bM4_PORT_PCRD9_INTE (*((volatile unsigned int *)(0x42A79CB0UL)))
#define bM4_PORT_PCRD9_LTE (*((volatile unsigned int *)(0x42A79CB8UL)))
#define bM4_PORT_PCRD9_DDIS (*((volatile unsigned int *)(0x42A79CBCUL)))
#define bM4_PORT_PFSRD9_FSEL0 (*((volatile unsigned int *)(0x42A79CC0UL)))
#define bM4_PORT_PFSRD9_FSEL1 (*((volatile unsigned int *)(0x42A79CC4UL)))
#define bM4_PORT_PFSRD9_FSEL2 (*((volatile unsigned int *)(0x42A79CC8UL)))
#define bM4_PORT_PFSRD9_FSEL3 (*((volatile unsigned int *)(0x42A79CCCUL)))
#define bM4_PORT_PFSRD9_FSEL4 (*((volatile unsigned int *)(0x42A79CD0UL)))
#define bM4_PORT_PFSRD9_FSEL5 (*((volatile unsigned int *)(0x42A79CD4UL)))
#define bM4_PORT_PFSRD9_BFE (*((volatile unsigned int *)(0x42A79CE0UL)))
#define bM4_PORT_PCRD10_POUT (*((volatile unsigned int *)(0x42A79D00UL)))
#define bM4_PORT_PCRD10_POUTE (*((volatile unsigned int *)(0x42A79D04UL)))
#define bM4_PORT_PCRD10_NOD (*((volatile unsigned int *)(0x42A79D08UL)))
#define bM4_PORT_PCRD10_DRV0 (*((volatile unsigned int *)(0x42A79D10UL)))
#define bM4_PORT_PCRD10_DRV1 (*((volatile unsigned int *)(0x42A79D14UL)))
#define bM4_PORT_PCRD10_PUU (*((volatile unsigned int *)(0x42A79D18UL)))
#define bM4_PORT_PCRD10_PIN (*((volatile unsigned int *)(0x42A79D20UL)))
#define bM4_PORT_PCRD10_INVE (*((volatile unsigned int *)(0x42A79D24UL)))
#define bM4_PORT_PCRD10_INTE (*((volatile unsigned int *)(0x42A79D30UL)))
#define bM4_PORT_PCRD10_LTE (*((volatile unsigned int *)(0x42A79D38UL)))
#define bM4_PORT_PCRD10_DDIS (*((volatile unsigned int *)(0x42A79D3CUL)))
#define bM4_PORT_PFSRD10_FSEL0 (*((volatile unsigned int *)(0x42A79D40UL)))
#define bM4_PORT_PFSRD10_FSEL1 (*((volatile unsigned int *)(0x42A79D44UL)))
#define bM4_PORT_PFSRD10_FSEL2 (*((volatile unsigned int *)(0x42A79D48UL)))
#define bM4_PORT_PFSRD10_FSEL3 (*((volatile unsigned int *)(0x42A79D4CUL)))
#define bM4_PORT_PFSRD10_FSEL4 (*((volatile unsigned int *)(0x42A79D50UL)))
#define bM4_PORT_PFSRD10_FSEL5 (*((volatile unsigned int *)(0x42A79D54UL)))
#define bM4_PORT_PFSRD10_BFE (*((volatile unsigned int *)(0x42A79D60UL)))
#define bM4_PORT_PCRD11_POUT (*((volatile unsigned int *)(0x42A79D80UL)))
#define bM4_PORT_PCRD11_POUTE (*((volatile unsigned int *)(0x42A79D84UL)))
#define bM4_PORT_PCRD11_NOD (*((volatile unsigned int *)(0x42A79D88UL)))
#define bM4_PORT_PCRD11_DRV0 (*((volatile unsigned int *)(0x42A79D90UL)))
#define bM4_PORT_PCRD11_DRV1 (*((volatile unsigned int *)(0x42A79D94UL)))
#define bM4_PORT_PCRD11_PUU (*((volatile unsigned int *)(0x42A79D98UL)))
#define bM4_PORT_PCRD11_PIN (*((volatile unsigned int *)(0x42A79DA0UL)))
#define bM4_PORT_PCRD11_INVE (*((volatile unsigned int *)(0x42A79DA4UL)))
#define bM4_PORT_PCRD11_INTE (*((volatile unsigned int *)(0x42A79DB0UL)))
#define bM4_PORT_PCRD11_LTE (*((volatile unsigned int *)(0x42A79DB8UL)))
#define bM4_PORT_PCRD11_DDIS (*((volatile unsigned int *)(0x42A79DBCUL)))
#define bM4_PORT_PFSRD11_FSEL0 (*((volatile unsigned int *)(0x42A79DC0UL)))
#define bM4_PORT_PFSRD11_FSEL1 (*((volatile unsigned int *)(0x42A79DC4UL)))
#define bM4_PORT_PFSRD11_FSEL2 (*((volatile unsigned int *)(0x42A79DC8UL)))
#define bM4_PORT_PFSRD11_FSEL3 (*((volatile unsigned int *)(0x42A79DCCUL)))
#define bM4_PORT_PFSRD11_FSEL4 (*((volatile unsigned int *)(0x42A79DD0UL)))
#define bM4_PORT_PFSRD11_FSEL5 (*((volatile unsigned int *)(0x42A79DD4UL)))
#define bM4_PORT_PFSRD11_BFE (*((volatile unsigned int *)(0x42A79DE0UL)))
#define bM4_PORT_PCRD12_POUT (*((volatile unsigned int *)(0x42A79E00UL)))
#define bM4_PORT_PCRD12_POUTE (*((volatile unsigned int *)(0x42A79E04UL)))
#define bM4_PORT_PCRD12_NOD (*((volatile unsigned int *)(0x42A79E08UL)))
#define bM4_PORT_PCRD12_DRV0 (*((volatile unsigned int *)(0x42A79E10UL)))
#define bM4_PORT_PCRD12_DRV1 (*((volatile unsigned int *)(0x42A79E14UL)))
#define bM4_PORT_PCRD12_PUU (*((volatile unsigned int *)(0x42A79E18UL)))
#define bM4_PORT_PCRD12_PIN (*((volatile unsigned int *)(0x42A79E20UL)))
#define bM4_PORT_PCRD12_INVE (*((volatile unsigned int *)(0x42A79E24UL)))
#define bM4_PORT_PCRD12_INTE (*((volatile unsigned int *)(0x42A79E30UL)))
#define bM4_PORT_PCRD12_LTE (*((volatile unsigned int *)(0x42A79E38UL)))
#define bM4_PORT_PCRD12_DDIS (*((volatile unsigned int *)(0x42A79E3CUL)))
#define bM4_PORT_PFSRD12_FSEL0 (*((volatile unsigned int *)(0x42A79E40UL)))
#define bM4_PORT_PFSRD12_FSEL1 (*((volatile unsigned int *)(0x42A79E44UL)))
#define bM4_PORT_PFSRD12_FSEL2 (*((volatile unsigned int *)(0x42A79E48UL)))
#define bM4_PORT_PFSRD12_FSEL3 (*((volatile unsigned int *)(0x42A79E4CUL)))
#define bM4_PORT_PFSRD12_FSEL4 (*((volatile unsigned int *)(0x42A79E50UL)))
#define bM4_PORT_PFSRD12_FSEL5 (*((volatile unsigned int *)(0x42A79E54UL)))
#define bM4_PORT_PFSRD12_BFE (*((volatile unsigned int *)(0x42A79E60UL)))
#define bM4_PORT_PCRD13_POUT (*((volatile unsigned int *)(0x42A79E80UL)))
#define bM4_PORT_PCRD13_POUTE (*((volatile unsigned int *)(0x42A79E84UL)))
#define bM4_PORT_PCRD13_NOD (*((volatile unsigned int *)(0x42A79E88UL)))
#define bM4_PORT_PCRD13_DRV0 (*((volatile unsigned int *)(0x42A79E90UL)))
#define bM4_PORT_PCRD13_DRV1 (*((volatile unsigned int *)(0x42A79E94UL)))
#define bM4_PORT_PCRD13_PUU (*((volatile unsigned int *)(0x42A79E98UL)))
#define bM4_PORT_PCRD13_PIN (*((volatile unsigned int *)(0x42A79EA0UL)))
#define bM4_PORT_PCRD13_INVE (*((volatile unsigned int *)(0x42A79EA4UL)))
#define bM4_PORT_PCRD13_INTE (*((volatile unsigned int *)(0x42A79EB0UL)))
#define bM4_PORT_PCRD13_LTE (*((volatile unsigned int *)(0x42A79EB8UL)))
#define bM4_PORT_PCRD13_DDIS (*((volatile unsigned int *)(0x42A79EBCUL)))
#define bM4_PORT_PFSRD13_FSEL0 (*((volatile unsigned int *)(0x42A79EC0UL)))
#define bM4_PORT_PFSRD13_FSEL1 (*((volatile unsigned int *)(0x42A79EC4UL)))
#define bM4_PORT_PFSRD13_FSEL2 (*((volatile unsigned int *)(0x42A79EC8UL)))
#define bM4_PORT_PFSRD13_FSEL3 (*((volatile unsigned int *)(0x42A79ECCUL)))
#define bM4_PORT_PFSRD13_FSEL4 (*((volatile unsigned int *)(0x42A79ED0UL)))
#define bM4_PORT_PFSRD13_FSEL5 (*((volatile unsigned int *)(0x42A79ED4UL)))
#define bM4_PORT_PFSRD13_BFE (*((volatile unsigned int *)(0x42A79EE0UL)))
#define bM4_PORT_PCRD14_POUT (*((volatile unsigned int *)(0x42A79F00UL)))
#define bM4_PORT_PCRD14_POUTE (*((volatile unsigned int *)(0x42A79F04UL)))
#define bM4_PORT_PCRD14_NOD (*((volatile unsigned int *)(0x42A79F08UL)))
#define bM4_PORT_PCRD14_DRV0 (*((volatile unsigned int *)(0x42A79F10UL)))
#define bM4_PORT_PCRD14_DRV1 (*((volatile unsigned int *)(0x42A79F14UL)))
#define bM4_PORT_PCRD14_PUU (*((volatile unsigned int *)(0x42A79F18UL)))
#define bM4_PORT_PCRD14_PIN (*((volatile unsigned int *)(0x42A79F20UL)))
#define bM4_PORT_PCRD14_INVE (*((volatile unsigned int *)(0x42A79F24UL)))
#define bM4_PORT_PCRD14_INTE (*((volatile unsigned int *)(0x42A79F30UL)))
#define bM4_PORT_PCRD14_LTE (*((volatile unsigned int *)(0x42A79F38UL)))
#define bM4_PORT_PCRD14_DDIS (*((volatile unsigned int *)(0x42A79F3CUL)))
#define bM4_PORT_PFSRD14_FSEL0 (*((volatile unsigned int *)(0x42A79F40UL)))
#define bM4_PORT_PFSRD14_FSEL1 (*((volatile unsigned int *)(0x42A79F44UL)))
#define bM4_PORT_PFSRD14_FSEL2 (*((volatile unsigned int *)(0x42A79F48UL)))
#define bM4_PORT_PFSRD14_FSEL3 (*((volatile unsigned int *)(0x42A79F4CUL)))
#define bM4_PORT_PFSRD14_FSEL4 (*((volatile unsigned int *)(0x42A79F50UL)))
#define bM4_PORT_PFSRD14_FSEL5 (*((volatile unsigned int *)(0x42A79F54UL)))
#define bM4_PORT_PFSRD14_BFE (*((volatile unsigned int *)(0x42A79F60UL)))
#define bM4_PORT_PCRD15_POUT (*((volatile unsigned int *)(0x42A79F80UL)))
#define bM4_PORT_PCRD15_POUTE (*((volatile unsigned int *)(0x42A79F84UL)))
#define bM4_PORT_PCRD15_NOD (*((volatile unsigned int *)(0x42A79F88UL)))
#define bM4_PORT_PCRD15_DRV0 (*((volatile unsigned int *)(0x42A79F90UL)))
#define bM4_PORT_PCRD15_DRV1 (*((volatile unsigned int *)(0x42A79F94UL)))
#define bM4_PORT_PCRD15_PUU (*((volatile unsigned int *)(0x42A79F98UL)))
#define bM4_PORT_PCRD15_PIN (*((volatile unsigned int *)(0x42A79FA0UL)))
#define bM4_PORT_PCRD15_INVE (*((volatile unsigned int *)(0x42A79FA4UL)))
#define bM4_PORT_PCRD15_INTE (*((volatile unsigned int *)(0x42A79FB0UL)))
#define bM4_PORT_PCRD15_LTE (*((volatile unsigned int *)(0x42A79FB8UL)))
#define bM4_PORT_PCRD15_DDIS (*((volatile unsigned int *)(0x42A79FBCUL)))
#define bM4_PORT_PFSRD15_FSEL0 (*((volatile unsigned int *)(0x42A79FC0UL)))
#define bM4_PORT_PFSRD15_FSEL1 (*((volatile unsigned int *)(0x42A79FC4UL)))
#define bM4_PORT_PFSRD15_FSEL2 (*((volatile unsigned int *)(0x42A79FC8UL)))
#define bM4_PORT_PFSRD15_FSEL3 (*((volatile unsigned int *)(0x42A79FCCUL)))
#define bM4_PORT_PFSRD15_FSEL4 (*((volatile unsigned int *)(0x42A79FD0UL)))
#define bM4_PORT_PFSRD15_FSEL5 (*((volatile unsigned int *)(0x42A79FD4UL)))
#define bM4_PORT_PFSRD15_BFE (*((volatile unsigned int *)(0x42A79FE0UL)))
#define bM4_PORT_PCRE0_POUT (*((volatile unsigned int *)(0x42A7A000UL)))
#define bM4_PORT_PCRE0_POUTE (*((volatile unsigned int *)(0x42A7A004UL)))
#define bM4_PORT_PCRE0_NOD (*((volatile unsigned int *)(0x42A7A008UL)))
#define bM4_PORT_PCRE0_DRV0 (*((volatile unsigned int *)(0x42A7A010UL)))
#define bM4_PORT_PCRE0_DRV1 (*((volatile unsigned int *)(0x42A7A014UL)))
#define bM4_PORT_PCRE0_PUU (*((volatile unsigned int *)(0x42A7A018UL)))
#define bM4_PORT_PCRE0_PIN (*((volatile unsigned int *)(0x42A7A020UL)))
#define bM4_PORT_PCRE0_INVE (*((volatile unsigned int *)(0x42A7A024UL)))
#define bM4_PORT_PCRE0_INTE (*((volatile unsigned int *)(0x42A7A030UL)))
#define bM4_PORT_PCRE0_LTE (*((volatile unsigned int *)(0x42A7A038UL)))
#define bM4_PORT_PCRE0_DDIS (*((volatile unsigned int *)(0x42A7A03CUL)))
#define bM4_PORT_PFSRE0_FSEL0 (*((volatile unsigned int *)(0x42A7A040UL)))
#define bM4_PORT_PFSRE0_FSEL1 (*((volatile unsigned int *)(0x42A7A044UL)))
#define bM4_PORT_PFSRE0_FSEL2 (*((volatile unsigned int *)(0x42A7A048UL)))
#define bM4_PORT_PFSRE0_FSEL3 (*((volatile unsigned int *)(0x42A7A04CUL)))
#define bM4_PORT_PFSRE0_FSEL4 (*((volatile unsigned int *)(0x42A7A050UL)))
#define bM4_PORT_PFSRE0_FSEL5 (*((volatile unsigned int *)(0x42A7A054UL)))
#define bM4_PORT_PFSRE0_BFE (*((volatile unsigned int *)(0x42A7A060UL)))
#define bM4_PORT_PCRE1_POUT (*((volatile unsigned int *)(0x42A7A080UL)))
#define bM4_PORT_PCRE1_POUTE (*((volatile unsigned int *)(0x42A7A084UL)))
#define bM4_PORT_PCRE1_NOD (*((volatile unsigned int *)(0x42A7A088UL)))
#define bM4_PORT_PCRE1_DRV0 (*((volatile unsigned int *)(0x42A7A090UL)))
#define bM4_PORT_PCRE1_DRV1 (*((volatile unsigned int *)(0x42A7A094UL)))
#define bM4_PORT_PCRE1_PUU (*((volatile unsigned int *)(0x42A7A098UL)))
#define bM4_PORT_PCRE1_PIN (*((volatile unsigned int *)(0x42A7A0A0UL)))
#define bM4_PORT_PCRE1_INVE (*((volatile unsigned int *)(0x42A7A0A4UL)))
#define bM4_PORT_PCRE1_INTE (*((volatile unsigned int *)(0x42A7A0B0UL)))
#define bM4_PORT_PCRE1_LTE (*((volatile unsigned int *)(0x42A7A0B8UL)))
#define bM4_PORT_PCRE1_DDIS (*((volatile unsigned int *)(0x42A7A0BCUL)))
#define bM4_PORT_PFSRE1_FSEL0 (*((volatile unsigned int *)(0x42A7A0C0UL)))
#define bM4_PORT_PFSRE1_FSEL1 (*((volatile unsigned int *)(0x42A7A0C4UL)))
#define bM4_PORT_PFSRE1_FSEL2 (*((volatile unsigned int *)(0x42A7A0C8UL)))
#define bM4_PORT_PFSRE1_FSEL3 (*((volatile unsigned int *)(0x42A7A0CCUL)))
#define bM4_PORT_PFSRE1_FSEL4 (*((volatile unsigned int *)(0x42A7A0D0UL)))
#define bM4_PORT_PFSRE1_FSEL5 (*((volatile unsigned int *)(0x42A7A0D4UL)))
#define bM4_PORT_PFSRE1_BFE (*((volatile unsigned int *)(0x42A7A0E0UL)))
#define bM4_PORT_PCRE2_POUT (*((volatile unsigned int *)(0x42A7A100UL)))
#define bM4_PORT_PCRE2_POUTE (*((volatile unsigned int *)(0x42A7A104UL)))
#define bM4_PORT_PCRE2_NOD (*((volatile unsigned int *)(0x42A7A108UL)))
#define bM4_PORT_PCRE2_DRV0 (*((volatile unsigned int *)(0x42A7A110UL)))
#define bM4_PORT_PCRE2_DRV1 (*((volatile unsigned int *)(0x42A7A114UL)))
#define bM4_PORT_PCRE2_PUU (*((volatile unsigned int *)(0x42A7A118UL)))
#define bM4_PORT_PCRE2_PIN (*((volatile unsigned int *)(0x42A7A120UL)))
#define bM4_PORT_PCRE2_INVE (*((volatile unsigned int *)(0x42A7A124UL)))
#define bM4_PORT_PCRE2_INTE (*((volatile unsigned int *)(0x42A7A130UL)))
#define bM4_PORT_PCRE2_LTE (*((volatile unsigned int *)(0x42A7A138UL)))
#define bM4_PORT_PCRE2_DDIS (*((volatile unsigned int *)(0x42A7A13CUL)))
#define bM4_PORT_PFSRE2_FSEL0 (*((volatile unsigned int *)(0x42A7A140UL)))
#define bM4_PORT_PFSRE2_FSEL1 (*((volatile unsigned int *)(0x42A7A144UL)))
#define bM4_PORT_PFSRE2_FSEL2 (*((volatile unsigned int *)(0x42A7A148UL)))
#define bM4_PORT_PFSRE2_FSEL3 (*((volatile unsigned int *)(0x42A7A14CUL)))
#define bM4_PORT_PFSRE2_FSEL4 (*((volatile unsigned int *)(0x42A7A150UL)))
#define bM4_PORT_PFSRE2_FSEL5 (*((volatile unsigned int *)(0x42A7A154UL)))
#define bM4_PORT_PFSRE2_BFE (*((volatile unsigned int *)(0x42A7A160UL)))
#define bM4_PORT_PCRE3_POUT (*((volatile unsigned int *)(0x42A7A180UL)))
#define bM4_PORT_PCRE3_POUTE (*((volatile unsigned int *)(0x42A7A184UL)))
#define bM4_PORT_PCRE3_NOD (*((volatile unsigned int *)(0x42A7A188UL)))
#define bM4_PORT_PCRE3_DRV0 (*((volatile unsigned int *)(0x42A7A190UL)))
#define bM4_PORT_PCRE3_DRV1 (*((volatile unsigned int *)(0x42A7A194UL)))
#define bM4_PORT_PCRE3_PUU (*((volatile unsigned int *)(0x42A7A198UL)))
#define bM4_PORT_PCRE3_PIN (*((volatile unsigned int *)(0x42A7A1A0UL)))
#define bM4_PORT_PCRE3_INVE (*((volatile unsigned int *)(0x42A7A1A4UL)))
#define bM4_PORT_PCRE3_INTE (*((volatile unsigned int *)(0x42A7A1B0UL)))
#define bM4_PORT_PCRE3_LTE (*((volatile unsigned int *)(0x42A7A1B8UL)))
#define bM4_PORT_PCRE3_DDIS (*((volatile unsigned int *)(0x42A7A1BCUL)))
#define bM4_PORT_PFSRE3_FSEL0 (*((volatile unsigned int *)(0x42A7A1C0UL)))
#define bM4_PORT_PFSRE3_FSEL1 (*((volatile unsigned int *)(0x42A7A1C4UL)))
#define bM4_PORT_PFSRE3_FSEL2 (*((volatile unsigned int *)(0x42A7A1C8UL)))
#define bM4_PORT_PFSRE3_FSEL3 (*((volatile unsigned int *)(0x42A7A1CCUL)))
#define bM4_PORT_PFSRE3_FSEL4 (*((volatile unsigned int *)(0x42A7A1D0UL)))
#define bM4_PORT_PFSRE3_FSEL5 (*((volatile unsigned int *)(0x42A7A1D4UL)))
#define bM4_PORT_PFSRE3_BFE (*((volatile unsigned int *)(0x42A7A1E0UL)))
#define bM4_PORT_PCRE4_POUT (*((volatile unsigned int *)(0x42A7A200UL)))
#define bM4_PORT_PCRE4_POUTE (*((volatile unsigned int *)(0x42A7A204UL)))
#define bM4_PORT_PCRE4_NOD (*((volatile unsigned int *)(0x42A7A208UL)))
#define bM4_PORT_PCRE4_DRV0 (*((volatile unsigned int *)(0x42A7A210UL)))
#define bM4_PORT_PCRE4_DRV1 (*((volatile unsigned int *)(0x42A7A214UL)))
#define bM4_PORT_PCRE4_PUU (*((volatile unsigned int *)(0x42A7A218UL)))
#define bM4_PORT_PCRE4_PIN (*((volatile unsigned int *)(0x42A7A220UL)))
#define bM4_PORT_PCRE4_INVE (*((volatile unsigned int *)(0x42A7A224UL)))
#define bM4_PORT_PCRE4_INTE (*((volatile unsigned int *)(0x42A7A230UL)))
#define bM4_PORT_PCRE4_LTE (*((volatile unsigned int *)(0x42A7A238UL)))
#define bM4_PORT_PCRE4_DDIS (*((volatile unsigned int *)(0x42A7A23CUL)))
#define bM4_PORT_PFSRE4_FSEL0 (*((volatile unsigned int *)(0x42A7A240UL)))
#define bM4_PORT_PFSRE4_FSEL1 (*((volatile unsigned int *)(0x42A7A244UL)))
#define bM4_PORT_PFSRE4_FSEL2 (*((volatile unsigned int *)(0x42A7A248UL)))
#define bM4_PORT_PFSRE4_FSEL3 (*((volatile unsigned int *)(0x42A7A24CUL)))
#define bM4_PORT_PFSRE4_FSEL4 (*((volatile unsigned int *)(0x42A7A250UL)))
#define bM4_PORT_PFSRE4_FSEL5 (*((volatile unsigned int *)(0x42A7A254UL)))
#define bM4_PORT_PFSRE4_BFE (*((volatile unsigned int *)(0x42A7A260UL)))
#define bM4_PORT_PCRE5_POUT (*((volatile unsigned int *)(0x42A7A280UL)))
#define bM4_PORT_PCRE5_POUTE (*((volatile unsigned int *)(0x42A7A284UL)))
#define bM4_PORT_PCRE5_NOD (*((volatile unsigned int *)(0x42A7A288UL)))
#define bM4_PORT_PCRE5_DRV0 (*((volatile unsigned int *)(0x42A7A290UL)))
#define bM4_PORT_PCRE5_DRV1 (*((volatile unsigned int *)(0x42A7A294UL)))
#define bM4_PORT_PCRE5_PUU (*((volatile unsigned int *)(0x42A7A298UL)))
#define bM4_PORT_PCRE5_PIN (*((volatile unsigned int *)(0x42A7A2A0UL)))
#define bM4_PORT_PCRE5_INVE (*((volatile unsigned int *)(0x42A7A2A4UL)))
#define bM4_PORT_PCRE5_INTE (*((volatile unsigned int *)(0x42A7A2B0UL)))
#define bM4_PORT_PCRE5_LTE (*((volatile unsigned int *)(0x42A7A2B8UL)))
#define bM4_PORT_PCRE5_DDIS (*((volatile unsigned int *)(0x42A7A2BCUL)))
#define bM4_PORT_PFSRE5_FSEL0 (*((volatile unsigned int *)(0x42A7A2C0UL)))
#define bM4_PORT_PFSRE5_FSEL1 (*((volatile unsigned int *)(0x42A7A2C4UL)))
#define bM4_PORT_PFSRE5_FSEL2 (*((volatile unsigned int *)(0x42A7A2C8UL)))
#define bM4_PORT_PFSRE5_FSEL3 (*((volatile unsigned int *)(0x42A7A2CCUL)))
#define bM4_PORT_PFSRE5_FSEL4 (*((volatile unsigned int *)(0x42A7A2D0UL)))
#define bM4_PORT_PFSRE5_FSEL5 (*((volatile unsigned int *)(0x42A7A2D4UL)))
#define bM4_PORT_PFSRE5_BFE (*((volatile unsigned int *)(0x42A7A2E0UL)))
#define bM4_PORT_PCRE6_POUT (*((volatile unsigned int *)(0x42A7A300UL)))
#define bM4_PORT_PCRE6_POUTE (*((volatile unsigned int *)(0x42A7A304UL)))
#define bM4_PORT_PCRE6_NOD (*((volatile unsigned int *)(0x42A7A308UL)))
#define bM4_PORT_PCRE6_DRV0 (*((volatile unsigned int *)(0x42A7A310UL)))
#define bM4_PORT_PCRE6_DRV1 (*((volatile unsigned int *)(0x42A7A314UL)))
#define bM4_PORT_PCRE6_PUU (*((volatile unsigned int *)(0x42A7A318UL)))
#define bM4_PORT_PCRE6_PIN (*((volatile unsigned int *)(0x42A7A320UL)))
#define bM4_PORT_PCRE6_INVE (*((volatile unsigned int *)(0x42A7A324UL)))
#define bM4_PORT_PCRE6_INTE (*((volatile unsigned int *)(0x42A7A330UL)))
#define bM4_PORT_PCRE6_LTE (*((volatile unsigned int *)(0x42A7A338UL)))
#define bM4_PORT_PCRE6_DDIS (*((volatile unsigned int *)(0x42A7A33CUL)))
#define bM4_PORT_PFSRE6_FSEL0 (*((volatile unsigned int *)(0x42A7A340UL)))
#define bM4_PORT_PFSRE6_FSEL1 (*((volatile unsigned int *)(0x42A7A344UL)))
#define bM4_PORT_PFSRE6_FSEL2 (*((volatile unsigned int *)(0x42A7A348UL)))
#define bM4_PORT_PFSRE6_FSEL3 (*((volatile unsigned int *)(0x42A7A34CUL)))
#define bM4_PORT_PFSRE6_FSEL4 (*((volatile unsigned int *)(0x42A7A350UL)))
#define bM4_PORT_PFSRE6_FSEL5 (*((volatile unsigned int *)(0x42A7A354UL)))
#define bM4_PORT_PFSRE6_BFE (*((volatile unsigned int *)(0x42A7A360UL)))
#define bM4_PORT_PCRE7_POUT (*((volatile unsigned int *)(0x42A7A380UL)))
#define bM4_PORT_PCRE7_POUTE (*((volatile unsigned int *)(0x42A7A384UL)))
#define bM4_PORT_PCRE7_NOD (*((volatile unsigned int *)(0x42A7A388UL)))
#define bM4_PORT_PCRE7_DRV0 (*((volatile unsigned int *)(0x42A7A390UL)))
#define bM4_PORT_PCRE7_DRV1 (*((volatile unsigned int *)(0x42A7A394UL)))
#define bM4_PORT_PCRE7_PUU (*((volatile unsigned int *)(0x42A7A398UL)))
#define bM4_PORT_PCRE7_PIN (*((volatile unsigned int *)(0x42A7A3A0UL)))
#define bM4_PORT_PCRE7_INVE (*((volatile unsigned int *)(0x42A7A3A4UL)))
#define bM4_PORT_PCRE7_INTE (*((volatile unsigned int *)(0x42A7A3B0UL)))
#define bM4_PORT_PCRE7_LTE (*((volatile unsigned int *)(0x42A7A3B8UL)))
#define bM4_PORT_PCRE7_DDIS (*((volatile unsigned int *)(0x42A7A3BCUL)))
