MarlinFirmware/Marlin/Marlin/lib/h32_core/main/hdsc32core/common/hc32f46x.h
#define bM4_SPI2_CR1_CSUSPE (*((volatile unsigned int *)(0x4238809CUL)))
#define bM4_SPI2_CR1_EIE (*((volatile unsigned int *)(0x423880A0UL)))
#define bM4_SPI2_CR1_TXIE (*((volatile unsigned int *)(0x423880A4UL)))
#define bM4_SPI2_CR1_RXIE (*((volatile unsigned int *)(0x423880A8UL)))
#define bM4_SPI2_CR1_IDIE (*((volatile unsigned int *)(0x423880ACUL)))
#define bM4_SPI2_CR1_MODFE (*((volatile unsigned int *)(0x423880B0UL)))
#define bM4_SPI2_CR1_PATE (*((volatile unsigned int *)(0x423880B4UL)))
#define bM4_SPI2_CR1_PAOE (*((volatile unsigned int *)(0x423880B8UL)))
#define bM4_SPI2_CR1_PAE (*((volatile unsigned int *)(0x423880BCUL)))
#define bM4_SPI2_CFG1_FTHLV0 (*((volatile unsigned int *)(0x42388180UL)))
#define bM4_SPI2_CFG1_FTHLV1 (*((volatile unsigned int *)(0x42388184UL)))
#define bM4_SPI2_CFG1_SPRDTD (*((volatile unsigned int *)(0x42388198UL)))
#define bM4_SPI2_CFG1_SS0PV (*((volatile unsigned int *)(0x423881A0UL)))
#define bM4_SPI2_CFG1_SS1PV (*((volatile unsigned int *)(0x423881A4UL)))
#define bM4_SPI2_CFG1_SS2PV (*((volatile unsigned int *)(0x423881A8UL)))
#define bM4_SPI2_CFG1_SS3PV (*((volatile unsigned int *)(0x423881ACUL)))
#define bM4_SPI2_CFG1_MSSI0 (*((volatile unsigned int *)(0x423881D0UL)))
#define bM4_SPI2_CFG1_MSSI1 (*((volatile unsigned int *)(0x423881D4UL)))
#define bM4_SPI2_CFG1_MSSI2 (*((volatile unsigned int *)(0x423881D8UL)))
#define bM4_SPI2_CFG1_MSSDL0 (*((volatile unsigned int *)(0x423881E0UL)))
#define bM4_SPI2_CFG1_MSSDL1 (*((volatile unsigned int *)(0x423881E4UL)))
#define bM4_SPI2_CFG1_MSSDL2 (*((volatile unsigned int *)(0x423881E8UL)))
#define bM4_SPI2_CFG1_MIDI0 (*((volatile unsigned int *)(0x423881F0UL)))
#define bM4_SPI2_CFG1_MIDI1 (*((volatile unsigned int *)(0x423881F4UL)))
#define bM4_SPI2_CFG1_MIDI2 (*((volatile unsigned int *)(0x423881F8UL)))
#define bM4_SPI2_SR_OVRERF (*((volatile unsigned int *)(0x42388280UL)))
#define bM4_SPI2_SR_IDLNF (*((volatile unsigned int *)(0x42388284UL)))
#define bM4_SPI2_SR_MODFERF (*((volatile unsigned int *)(0x42388288UL)))
#define bM4_SPI2_SR_PERF (*((volatile unsigned int *)(0x4238828CUL)))
#define bM4_SPI2_SR_UDRERF (*((volatile unsigned int *)(0x42388290UL)))
#define bM4_SPI2_SR_TDEF (*((volatile unsigned int *)(0x42388294UL)))
#define bM4_SPI2_SR_RDFF (*((volatile unsigned int *)(0x4238829CUL)))
#define bM4_SPI2_CFG2_CPHA (*((volatile unsigned int *)(0x42388300UL)))
#define bM4_SPI2_CFG2_CPOL (*((volatile unsigned int *)(0x42388304UL)))
#define bM4_SPI2_CFG2_MBR0 (*((volatile unsigned int *)(0x42388308UL)))
#define bM4_SPI2_CFG2_MBR1 (*((volatile unsigned int *)(0x4238830CUL)))
#define bM4_SPI2_CFG2_MBR2 (*((volatile unsigned int *)(0x42388310UL)))
#define bM4_SPI2_CFG2_SSA0 (*((volatile unsigned int *)(0x42388314UL)))
#define bM4_SPI2_CFG2_SSA1 (*((volatile unsigned int *)(0x42388318UL)))
#define bM4_SPI2_CFG2_SSA2 (*((volatile unsigned int *)(0x4238831CUL)))
#define bM4_SPI2_CFG2_DSIZE0 (*((volatile unsigned int *)(0x42388320UL)))
#define bM4_SPI2_CFG2_DSIZE1 (*((volatile unsigned int *)(0x42388324UL)))
#define bM4_SPI2_CFG2_DSIZE2 (*((volatile unsigned int *)(0x42388328UL)))
#define bM4_SPI2_CFG2_DSIZE3 (*((volatile unsigned int *)(0x4238832CUL)))
#define bM4_SPI2_CFG2_LSBF (*((volatile unsigned int *)(0x42388330UL)))
#define bM4_SPI2_CFG2_NXTDLE (*((volatile unsigned int *)(0x42388334UL)))
#define bM4_SPI2_CFG2_SSDLE (*((volatile unsigned int *)(0x42388338UL)))
#define bM4_SPI2_CFG2_SCKDLE (*((volatile unsigned int *)(0x4238833CUL)))
#define bM4_SPI3_CR1_SPIMDS (*((volatile unsigned int *)(0x42400080UL)))
#define bM4_SPI3_CR1_TXMDS (*((volatile unsigned int *)(0x42400084UL)))
#define bM4_SPI3_CR1_MSTR (*((volatile unsigned int *)(0x4240008CUL)))
#define bM4_SPI3_CR1_SPLPBK (*((volatile unsigned int *)(0x42400090UL)))
#define bM4_SPI3_CR1_SPLPBK2 (*((volatile unsigned int *)(0x42400094UL)))
#define bM4_SPI3_CR1_SPE (*((volatile unsigned int *)(0x42400098UL)))
#define bM4_SPI3_CR1_CSUSPE (*((volatile unsigned int *)(0x4240009CUL)))
#define bM4_SPI3_CR1_EIE (*((volatile unsigned int *)(0x424000A0UL)))
#define bM4_SPI3_CR1_TXIE (*((volatile unsigned int *)(0x424000A4UL)))
#define bM4_SPI3_CR1_RXIE (*((volatile unsigned int *)(0x424000A8UL)))
#define bM4_SPI3_CR1_IDIE (*((volatile unsigned int *)(0x424000ACUL)))
#define bM4_SPI3_CR1_MODFE (*((volatile unsigned int *)(0x424000B0UL)))
#define bM4_SPI3_CR1_PATE (*((volatile unsigned int *)(0x424000B4UL)))
#define bM4_SPI3_CR1_PAOE (*((volatile unsigned int *)(0x424000B8UL)))
#define bM4_SPI3_CR1_PAE (*((volatile unsigned int *)(0x424000BCUL)))
#define bM4_SPI3_CFG1_FTHLV0 (*((volatile unsigned int *)(0x42400180UL)))
#define bM4_SPI3_CFG1_FTHLV1 (*((volatile unsigned int *)(0x42400184UL)))
#define bM4_SPI3_CFG1_SPRDTD (*((volatile unsigned int *)(0x42400198UL)))
#define bM4_SPI3_CFG1_SS0PV (*((volatile unsigned int *)(0x424001A0UL)))
#define bM4_SPI3_CFG1_SS1PV (*((volatile unsigned int *)(0x424001A4UL)))
#define bM4_SPI3_CFG1_SS2PV (*((volatile unsigned int *)(0x424001A8UL)))
#define bM4_SPI3_CFG1_SS3PV (*((volatile unsigned int *)(0x424001ACUL)))
#define bM4_SPI3_CFG1_MSSI0 (*((volatile unsigned int *)(0x424001D0UL)))
#define bM4_SPI3_CFG1_MSSI1 (*((volatile unsigned int *)(0x424001D4UL)))
#define bM4_SPI3_CFG1_MSSI2 (*((volatile unsigned int *)(0x424001D8UL)))
#define bM4_SPI3_CFG1_MSSDL0 (*((volatile unsigned int *)(0x424001E0UL)))
#define bM4_SPI3_CFG1_MSSDL1 (*((volatile unsigned int *)(0x424001E4UL)))
#define bM4_SPI3_CFG1_MSSDL2 (*((volatile unsigned int *)(0x424001E8UL)))
#define bM4_SPI3_CFG1_MIDI0 (*((volatile unsigned int *)(0x424001F0UL)))
#define bM4_SPI3_CFG1_MIDI1 (*((volatile unsigned int *)(0x424001F4UL)))
#define bM4_SPI3_CFG1_MIDI2 (*((volatile unsigned int *)(0x424001F8UL)))
#define bM4_SPI3_SR_OVRERF (*((volatile unsigned int *)(0x42400280UL)))
#define bM4_SPI3_SR_IDLNF (*((volatile unsigned int *)(0x42400284UL)))
#define bM4_SPI3_SR_MODFERF (*((volatile unsigned int *)(0x42400288UL)))
#define bM4_SPI3_SR_PERF (*((volatile unsigned int *)(0x4240028CUL)))
#define bM4_SPI3_SR_UDRERF (*((volatile unsigned int *)(0x42400290UL)))
#define bM4_SPI3_SR_TDEF (*((volatile unsigned int *)(0x42400294UL)))
#define bM4_SPI3_SR_RDFF (*((volatile unsigned int *)(0x4240029CUL)))
#define bM4_SPI3_CFG2_CPHA (*((volatile unsigned int *)(0x42400300UL)))
#define bM4_SPI3_CFG2_CPOL (*((volatile unsigned int *)(0x42400304UL)))
#define bM4_SPI3_CFG2_MBR0 (*((volatile unsigned int *)(0x42400308UL)))
#define bM4_SPI3_CFG2_MBR1 (*((volatile unsigned int *)(0x4240030CUL)))
#define bM4_SPI3_CFG2_MBR2 (*((volatile unsigned int *)(0x42400310UL)))
#define bM4_SPI3_CFG2_SSA0 (*((volatile unsigned int *)(0x42400314UL)))
#define bM4_SPI3_CFG2_SSA1 (*((volatile unsigned int *)(0x42400318UL)))
#define bM4_SPI3_CFG2_SSA2 (*((volatile unsigned int *)(0x4240031CUL)))
#define bM4_SPI3_CFG2_DSIZE0 (*((volatile unsigned int *)(0x42400320UL)))
#define bM4_SPI3_CFG2_DSIZE1 (*((volatile unsigned int *)(0x42400324UL)))
#define bM4_SPI3_CFG2_DSIZE2 (*((volatile unsigned int *)(0x42400328UL)))
#define bM4_SPI3_CFG2_DSIZE3 (*((volatile unsigned int *)(0x4240032CUL)))
#define bM4_SPI3_CFG2_LSBF (*((volatile unsigned int *)(0x42400330UL)))
#define bM4_SPI3_CFG2_NXTDLE (*((volatile unsigned int *)(0x42400334UL)))
#define bM4_SPI3_CFG2_SSDLE (*((volatile unsigned int *)(0x42400338UL)))
#define bM4_SPI3_CFG2_SCKDLE (*((volatile unsigned int *)(0x4240033CUL)))
#define bM4_SPI4_CR1_SPIMDS (*((volatile unsigned int *)(0x42408080UL)))
#define bM4_SPI4_CR1_TXMDS (*((volatile unsigned int *)(0x42408084UL)))
#define bM4_SPI4_CR1_MSTR (*((volatile unsigned int *)(0x4240808CUL)))
#define bM4_SPI4_CR1_SPLPBK (*((volatile unsigned int *)(0x42408090UL)))
#define bM4_SPI4_CR1_SPLPBK2 (*((volatile unsigned int *)(0x42408094UL)))
#define bM4_SPI4_CR1_SPE (*((volatile unsigned int *)(0x42408098UL)))
#define bM4_SPI4_CR1_CSUSPE (*((volatile unsigned int *)(0x4240809CUL)))
#define bM4_SPI4_CR1_EIE (*((volatile unsigned int *)(0x424080A0UL)))
#define bM4_SPI4_CR1_TXIE (*((volatile unsigned int *)(0x424080A4UL)))
#define bM4_SPI4_CR1_RXIE (*((volatile unsigned int *)(0x424080A8UL)))
#define bM4_SPI4_CR1_IDIE (*((volatile unsigned int *)(0x424080ACUL)))
#define bM4_SPI4_CR1_MODFE (*((volatile unsigned int *)(0x424080B0UL)))
#define bM4_SPI4_CR1_PATE (*((volatile unsigned int *)(0x424080B4UL)))
#define bM4_SPI4_CR1_PAOE (*((volatile unsigned int *)(0x424080B8UL)))
#define bM4_SPI4_CR1_PAE (*((volatile unsigned int *)(0x424080BCUL)))
#define bM4_SPI4_CFG1_FTHLV0 (*((volatile unsigned int *)(0x42408180UL)))
#define bM4_SPI4_CFG1_FTHLV1 (*((volatile unsigned int *)(0x42408184UL)))
#define bM4_SPI4_CFG1_SPRDTD (*((volatile unsigned int *)(0x42408198UL)))
#define bM4_SPI4_CFG1_SS0PV (*((volatile unsigned int *)(0x424081A0UL)))
#define bM4_SPI4_CFG1_SS1PV (*((volatile unsigned int *)(0x424081A4UL)))
#define bM4_SPI4_CFG1_SS2PV (*((volatile unsigned int *)(0x424081A8UL)))
#define bM4_SPI4_CFG1_SS3PV (*((volatile unsigned int *)(0x424081ACUL)))
#define bM4_SPI4_CFG1_MSSI0 (*((volatile unsigned int *)(0x424081D0UL)))
#define bM4_SPI4_CFG1_MSSI1 (*((volatile unsigned int *)(0x424081D4UL)))
#define bM4_SPI4_CFG1_MSSI2 (*((volatile unsigned int *)(0x424081D8UL)))
#define bM4_SPI4_CFG1_MSSDL0 (*((volatile unsigned int *)(0x424081E0UL)))
#define bM4_SPI4_CFG1_MSSDL1 (*((volatile unsigned int *)(0x424081E4UL)))
#define bM4_SPI4_CFG1_MSSDL2 (*((volatile unsigned int *)(0x424081E8UL)))
#define bM4_SPI4_CFG1_MIDI0 (*((volatile unsigned int *)(0x424081F0UL)))
#define bM4_SPI4_CFG1_MIDI1 (*((volatile unsigned int *)(0x424081F4UL)))
#define bM4_SPI4_CFG1_MIDI2 (*((volatile unsigned int *)(0x424081F8UL)))
#define bM4_SPI4_SR_OVRERF (*((volatile unsigned int *)(0x42408280UL)))
#define bM4_SPI4_SR_IDLNF (*((volatile unsigned int *)(0x42408284UL)))
#define bM4_SPI4_SR_MODFERF (*((volatile unsigned int *)(0x42408288UL)))
#define bM4_SPI4_SR_PERF (*((volatile unsigned int *)(0x4240828CUL)))
#define bM4_SPI4_SR_UDRERF (*((volatile unsigned int *)(0x42408290UL)))
#define bM4_SPI4_SR_TDEF (*((volatile unsigned int *)(0x42408294UL)))
#define bM4_SPI4_SR_RDFF (*((volatile unsigned int *)(0x4240829CUL)))
#define bM4_SPI4_CFG2_CPHA (*((volatile unsigned int *)(0x42408300UL)))
#define bM4_SPI4_CFG2_CPOL (*((volatile unsigned int *)(0x42408304UL)))
#define bM4_SPI4_CFG2_MBR0 (*((volatile unsigned int *)(0x42408308UL)))
#define bM4_SPI4_CFG2_MBR1 (*((volatile unsigned int *)(0x4240830CUL)))
#define bM4_SPI4_CFG2_MBR2 (*((volatile unsigned int *)(0x42408310UL)))
#define bM4_SPI4_CFG2_SSA0 (*((volatile unsigned int *)(0x42408314UL)))
#define bM4_SPI4_CFG2_SSA1 (*((volatile unsigned int *)(0x42408318UL)))
#define bM4_SPI4_CFG2_SSA2 (*((volatile unsigned int *)(0x4240831CUL)))
#define bM4_SPI4_CFG2_DSIZE0 (*((volatile unsigned int *)(0x42408320UL)))
#define bM4_SPI4_CFG2_DSIZE1 (*((volatile unsigned int *)(0x42408324UL)))
#define bM4_SPI4_CFG2_DSIZE2 (*((volatile unsigned int *)(0x42408328UL)))
#define bM4_SPI4_CFG2_DSIZE3 (*((volatile unsigned int *)(0x4240832CUL)))
#define bM4_SPI4_CFG2_LSBF (*((volatile unsigned int *)(0x42408330UL)))
#define bM4_SPI4_CFG2_NXTDLE (*((volatile unsigned int *)(0x42408334UL)))
#define bM4_SPI4_CFG2_SSDLE (*((volatile unsigned int *)(0x42408338UL)))
#define bM4_SPI4_CFG2_SCKDLE (*((volatile unsigned int *)(0x4240833CUL)))
#define bM4_SRAMC_WTCR_SRAMSYSRWT0 (*((volatile unsigned int *)(0x42A10000UL)))
#define bM4_SRAMC_WTCR_SRAMSYSRWT1 (*((volatile unsigned int *)(0x42A10004UL)))
#define bM4_SRAMC_WTCR_SRAMSYSRWT2 (*((volatile unsigned int *)(0x42A10008UL)))
#define bM4_SRAMC_WTCR_SRAMSYSWWT0 (*((volatile unsigned int *)(0x42A10010UL)))
#define bM4_SRAMC_WTCR_SRAMSYSWWT1 (*((volatile unsigned int *)(0x42A10014UL)))
#define bM4_SRAMC_WTCR_SRAMSYSWWT2 (*((volatile unsigned int *)(0x42A10018UL)))
#define bM4_SRAMC_WTCR_SRAMECCRWT0 (*((volatile unsigned int *)(0x42A10020UL)))
#define bM4_SRAMC_WTCR_SRAMECCRWT1 (*((volatile unsigned int *)(0x42A10024UL)))
#define bM4_SRAMC_WTCR_SRAMECCRWT2 (*((volatile unsigned int *)(0x42A10028UL)))
#define bM4_SRAMC_WTCR_SRAMECCWWT0 (*((volatile unsigned int *)(0x42A10030UL)))
#define bM4_SRAMC_WTCR_SRAMECCWWT1 (*((volatile unsigned int *)(0x42A10034UL)))
#define bM4_SRAMC_WTCR_SRAMECCWWT2 (*((volatile unsigned int *)(0x42A10038UL)))
#define bM4_SRAMC_WTCR_SRAMHSRWT0 (*((volatile unsigned int *)(0x42A10040UL)))
#define bM4_SRAMC_WTCR_SRAMHSRWT1 (*((volatile unsigned int *)(0x42A10044UL)))
#define bM4_SRAMC_WTCR_SRAMHSRWT2 (*((volatile unsigned int *)(0x42A10048UL)))
#define bM4_SRAMC_WTCR_SRAMHSWWT0 (*((volatile unsigned int *)(0x42A10050UL)))
#define bM4_SRAMC_WTCR_SRAMHSWWT1 (*((volatile unsigned int *)(0x42A10054UL)))
#define bM4_SRAMC_WTCR_SRAMHSWWT2 (*((volatile unsigned int *)(0x42A10058UL)))
#define bM4_SRAMC_WTCR_SRAMBKRWT0 (*((volatile unsigned int *)(0x42A10060UL)))
#define bM4_SRAMC_WTCR_SRAMBKRWT1 (*((volatile unsigned int *)(0x42A10064UL)))
#define bM4_SRAMC_WTCR_SRAMBKRWT2 (*((volatile unsigned int *)(0x42A10068UL)))
#define bM4_SRAMC_WTCR_SRAMBKWWT0 (*((volatile unsigned int *)(0x42A10070UL)))
#define bM4_SRAMC_WTCR_SRAMBKWWT1 (*((volatile unsigned int *)(0x42A10074UL)))
#define bM4_SRAMC_WTCR_SRAMBKWWT2 (*((volatile unsigned int *)(0x42A10078UL)))
#define bM4_SRAMC_WTPR_WTPRC (*((volatile unsigned int *)(0x42A10080UL)))
#define bM4_SRAMC_WTPR_WTPRKW0 (*((volatile unsigned int *)(0x42A10084UL)))
#define bM4_SRAMC_WTPR_WTPRKW1 (*((volatile unsigned int *)(0x42A10088UL)))
#define bM4_SRAMC_WTPR_WTPRKW2 (*((volatile unsigned int *)(0x42A1008CUL)))
#define bM4_SRAMC_WTPR_WTPRKW3 (*((volatile unsigned int *)(0x42A10090UL)))
#define bM4_SRAMC_WTPR_WTPRKW4 (*((volatile unsigned int *)(0x42A10094UL)))
#define bM4_SRAMC_WTPR_WTPRKW5 (*((volatile unsigned int *)(0x42A10098UL)))
#define bM4_SRAMC_WTPR_WTPRKW6 (*((volatile unsigned int *)(0x42A1009CUL)))
#define bM4_SRAMC_CKCR_PYOAD (*((volatile unsigned int *)(0x42A10100UL)))
#define bM4_SRAMC_CKCR_ECCOAD (*((volatile unsigned int *)(0x42A10140UL)))
#define bM4_SRAMC_CKCR_ECCMOD0 (*((volatile unsigned int *)(0x42A10160UL)))
#define bM4_SRAMC_CKCR_ECCMOD1 (*((volatile unsigned int *)(0x42A10164UL)))
#define bM4_SRAMC_CKPR_CKPRC (*((volatile unsigned int *)(0x42A10180UL)))
#define bM4_SRAMC_CKPR_CKPRKW0 (*((volatile unsigned int *)(0x42A10184UL)))
#define bM4_SRAMC_CKPR_CKPRKW1 (*((volatile unsigned int *)(0x42A10188UL)))
#define bM4_SRAMC_CKPR_CKPRKW2 (*((volatile unsigned int *)(0x42A1018CUL)))
#define bM4_SRAMC_CKPR_CKPRKW3 (*((volatile unsigned int *)(0x42A10190UL)))
#define bM4_SRAMC_CKPR_CKPRKW4 (*((volatile unsigned int *)(0x42A10194UL)))
#define bM4_SRAMC_CKPR_CKPRKW5 (*((volatile unsigned int *)(0x42A10198UL)))
#define bM4_SRAMC_CKPR_CKPRKW6 (*((volatile unsigned int *)(0x42A1019CUL)))
#define bM4_SRAMC_CKSR_SRAMECC1ERR (*((volatile unsigned int *)(0x42A10200UL)))
#define bM4_SRAMC_CKSR_SRAMECC2ERR (*((volatile unsigned int *)(0x42A10204UL)))
#define bM4_SRAMC_CKSR_SRAMSYSPYERR (*((volatile unsigned int *)(0x42A10208UL)))
#define bM4_SRAMC_CKSR_SRAMHSPYERR (*((volatile unsigned int *)(0x42A1020CUL)))
#define bM4_SRAMC_CKSR_SRAMBKPYERR (*((volatile unsigned int *)(0x42A10210UL)))
#define bM4_SWDT_SR_CNT0 (*((volatile unsigned int *)(0x42928080UL)))
#define bM4_SWDT_SR_CNT1 (*((volatile unsigned int *)(0x42928084UL)))
#define bM4_SWDT_SR_CNT2 (*((volatile unsigned int *)(0x42928088UL)))
#define bM4_SWDT_SR_CNT3 (*((volatile unsigned int *)(0x4292808CUL)))
#define bM4_SWDT_SR_CNT4 (*((volatile unsigned int *)(0x42928090UL)))
#define bM4_SWDT_SR_CNT5 (*((volatile unsigned int *)(0x42928094UL)))
#define bM4_SWDT_SR_CNT6 (*((volatile unsigned int *)(0x42928098UL)))
#define bM4_SWDT_SR_CNT7 (*((volatile unsigned int *)(0x4292809CUL)))
#define bM4_SWDT_SR_CNT8 (*((volatile unsigned int *)(0x429280A0UL)))
#define bM4_SWDT_SR_CNT9 (*((volatile unsigned int *)(0x429280A4UL)))
#define bM4_SWDT_SR_CNT10 (*((volatile unsigned int *)(0x429280A8UL)))
#define bM4_SWDT_SR_CNT11 (*((volatile unsigned int *)(0x429280ACUL)))
#define bM4_SWDT_SR_CNT12 (*((volatile unsigned int *)(0x429280B0UL)))
#define bM4_SWDT_SR_CNT13 (*((volatile unsigned int *)(0x429280B4UL)))
#define bM4_SWDT_SR_CNT14 (*((volatile unsigned int *)(0x429280B8UL)))
#define bM4_SWDT_SR_CNT15 (*((volatile unsigned int *)(0x429280BCUL)))
#define bM4_SWDT_SR_UDF (*((volatile unsigned int *)(0x429280C0UL)))
#define bM4_SWDT_SR_REF (*((volatile unsigned int *)(0x429280C4UL)))
#define bM4_SWDT_RR_RF0 (*((volatile unsigned int *)(0x42928100UL)))
#define bM4_SWDT_RR_RF1 (*((volatile unsigned int *)(0x42928104UL)))
#define bM4_SWDT_RR_RF2 (*((volatile unsigned int *)(0x42928108UL)))
#define bM4_SWDT_RR_RF3 (*((volatile unsigned int *)(0x4292810CUL)))
#define bM4_SWDT_RR_RF4 (*((volatile unsigned int *)(0x42928110UL)))
#define bM4_SWDT_RR_RF5 (*((volatile unsigned int *)(0x42928114UL)))
#define bM4_SWDT_RR_RF6 (*((volatile unsigned int *)(0x42928118UL)))
#define bM4_SWDT_RR_RF7 (*((volatile unsigned int *)(0x4292811CUL)))
#define bM4_SWDT_RR_RF8 (*((volatile unsigned int *)(0x42928120UL)))
#define bM4_SWDT_RR_RF9 (*((volatile unsigned int *)(0x42928124UL)))
#define bM4_SWDT_RR_RF10 (*((volatile unsigned int *)(0x42928128UL)))
#define bM4_SWDT_RR_RF11 (*((volatile unsigned int *)(0x4292812CUL)))
#define bM4_SWDT_RR_RF12 (*((volatile unsigned int *)(0x42928130UL)))
#define bM4_SWDT_RR_RF13 (*((volatile unsigned int *)(0x42928134UL)))
#define bM4_SWDT_RR_RF14 (*((volatile unsigned int *)(0x42928138UL)))
#define bM4_SWDT_RR_RF15 (*((volatile unsigned int *)(0x4292813CUL)))
#define bM4_SYSREG_PWR_STPMCR_FLNWT (*((volatile unsigned int *)(0x42A80180UL)))
#define bM4_SYSREG_PWR_STPMCR_CKSMRC (*((volatile unsigned int *)(0x42A80184UL)))
#define bM4_SYSREG_PWR_STPMCR_STOP (*((volatile unsigned int *)(0x42A801BCUL)))
#define bM4_SYSREG_CMU_PERICKSEL_PERICKSEL0 (*((volatile unsigned int *)(0x42A80200UL)))
#define bM4_SYSREG_CMU_PERICKSEL_PERICKSEL1 (*((volatile unsigned int *)(0x42A80204UL)))
#define bM4_SYSREG_CMU_PERICKSEL_PERICKSEL2 (*((volatile unsigned int *)(0x42A80208UL)))
#define bM4_SYSREG_CMU_PERICKSEL_PERICKSEL3 (*((volatile unsigned int *)(0x42A8020CUL)))
#define bM4_SYSREG_CMU_I2SCKSEL_I2S1CKSEL0 (*((volatile unsigned int *)(0x42A80240UL)))
#define bM4_SYSREG_CMU_I2SCKSEL_I2S1CKSEL1 (*((volatile unsigned int *)(0x42A80244UL)))
#define bM4_SYSREG_CMU_I2SCKSEL_I2S1CKSEL2 (*((volatile unsigned int *)(0x42A80248UL)))
#define bM4_SYSREG_CMU_I2SCKSEL_I2S1CKSEL3 (*((volatile unsigned int *)(0x42A8024CUL)))
#define bM4_SYSREG_CMU_I2SCKSEL_I2S2CKSEL0 (*((volatile unsigned int *)(0x42A80250UL)))
#define bM4_SYSREG_CMU_I2SCKSEL_I2S2CKSEL1 (*((volatile unsigned int *)(0x42A80254UL)))
#define bM4_SYSREG_CMU_I2SCKSEL_I2S2CKSEL2 (*((volatile unsigned int *)(0x42A80258UL)))
#define bM4_SYSREG_CMU_I2SCKSEL_I2S2CKSEL3 (*((volatile unsigned int *)(0x42A8025CUL)))
#define bM4_SYSREG_CMU_I2SCKSEL_I2S3CKSEL0 (*((volatile unsigned int *)(0x42A80260UL)))
#define bM4_SYSREG_CMU_I2SCKSEL_I2S3CKSEL1 (*((volatile unsigned int *)(0x42A80264UL)))
#define bM4_SYSREG_CMU_I2SCKSEL_I2S3CKSEL2 (*((volatile unsigned int *)(0x42A80268UL)))
#define bM4_SYSREG_CMU_I2SCKSEL_I2S3CKSEL3 (*((volatile unsigned int *)(0x42A8026CUL)))
#define bM4_SYSREG_CMU_I2SCKSEL_I2S4CKSEL0 (*((volatile unsigned int *)(0x42A80270UL)))
#define bM4_SYSREG_CMU_I2SCKSEL_I2S4CKSEL1 (*((volatile unsigned int *)(0x42A80274UL)))
#define bM4_SYSREG_CMU_I2SCKSEL_I2S4CKSEL2 (*((volatile unsigned int *)(0x42A80278UL)))
#define bM4_SYSREG_CMU_I2SCKSEL_I2S4CKSEL3 (*((volatile unsigned int *)(0x42A8027CUL)))
#define bM4_SYSREG_PWR_RAMPC0_RAMPDC0 (*((volatile unsigned int *)(0x42A80280UL)))
#define bM4_SYSREG_PWR_RAMPC0_RAMPDC1 (*((volatile unsigned int *)(0x42A80284UL)))
#define bM4_SYSREG_PWR_RAMPC0_RAMPDC2 (*((volatile unsigned int *)(0x42A80288UL)))
#define bM4_SYSREG_PWR_RAMPC0_RAMPDC3 (*((volatile unsigned int *)(0x42A8028CUL)))
#define bM4_SYSREG_PWR_RAMPC0_RAMPDC4 (*((volatile unsigned int *)(0x42A80290UL)))
#define bM4_SYSREG_PWR_RAMPC0_RAMPDC5 (*((volatile unsigned int *)(0x42A80294UL)))
#define bM4_SYSREG_PWR_RAMPC0_RAMPDC6 (*((volatile unsigned int *)(0x42A80298UL)))
#define bM4_SYSREG_PWR_RAMPC0_RAMPDC7 (*((volatile unsigned int *)(0x42A8029CUL)))
#define bM4_SYSREG_PWR_RAMPC0_RAMPDC8 (*((volatile unsigned int *)(0x42A802A0UL)))
#define bM4_SYSREG_PWR_RAMOPM_RAMOPM0 (*((volatile unsigned int *)(0x42A80300UL)))
#define bM4_SYSREG_PWR_RAMOPM_RAMOPM1 (*((volatile unsigned int *)(0x42A80304UL)))
#define bM4_SYSREG_PWR_RAMOPM_RAMOPM2 (*((volatile unsigned int *)(0x42A80308UL)))
#define bM4_SYSREG_PWR_RAMOPM_RAMOPM3 (*((volatile unsigned int *)(0x42A8030CUL)))
#define bM4_SYSREG_PWR_RAMOPM_RAMOPM4 (*((volatile unsigned int *)(0x42A80310UL)))
#define bM4_SYSREG_PWR_RAMOPM_RAMOPM5 (*((volatile unsigned int *)(0x42A80314UL)))
#define bM4_SYSREG_PWR_RAMOPM_RAMOPM6 (*((volatile unsigned int *)(0x42A80318UL)))
#define bM4_SYSREG_PWR_RAMOPM_RAMOPM7 (*((volatile unsigned int *)(0x42A8031CUL)))
#define bM4_SYSREG_PWR_RAMOPM_RAMOPM8 (*((volatile unsigned int *)(0x42A80320UL)))
#define bM4_SYSREG_PWR_RAMOPM_RAMOPM9 (*((volatile unsigned int *)(0x42A80324UL)))
#define bM4_SYSREG_PWR_RAMOPM_RAMOPM10 (*((volatile unsigned int *)(0x42A80328UL)))
#define bM4_SYSREG_PWR_RAMOPM_RAMOPM11 (*((volatile unsigned int *)(0x42A8032CUL)))
#define bM4_SYSREG_PWR_RAMOPM_RAMOPM12 (*((volatile unsigned int *)(0x42A80330UL)))
#define bM4_SYSREG_PWR_RAMOPM_RAMOPM13 (*((volatile unsigned int *)(0x42A80334UL)))
#define bM4_SYSREG_PWR_RAMOPM_RAMOPM14 (*((volatile unsigned int *)(0x42A80338UL)))
#define bM4_SYSREG_PWR_RAMOPM_RAMOPM15 (*((volatile unsigned int *)(0x42A8033CUL)))
#define bM4_SYSREG_MPU_IPPR_AESRDP (*((volatile unsigned int *)(0x42A80380UL)))
#define bM4_SYSREG_MPU_IPPR_AESWRP (*((volatile unsigned int *)(0x42A80384UL)))
#define bM4_SYSREG_MPU_IPPR_HASHRDP (*((volatile unsigned int *)(0x42A80388UL)))
#define bM4_SYSREG_MPU_IPPR_HASHWRP (*((volatile unsigned int *)(0x42A8038CUL)))
#define bM4_SYSREG_MPU_IPPR_TRNGRDP (*((volatile unsigned int *)(0x42A80390UL)))
#define bM4_SYSREG_MPU_IPPR_TRNGWRP (*((volatile unsigned int *)(0x42A80394UL)))
#define bM4_SYSREG_MPU_IPPR_CRCRDP (*((volatile unsigned int *)(0x42A80398UL)))
#define bM4_SYSREG_MPU_IPPR_CRCWRP (*((volatile unsigned int *)(0x42A8039CUL)))
#define bM4_SYSREG_MPU_IPPR_FMCRDP (*((volatile unsigned int *)(0x42A803A0UL)))
#define bM4_SYSREG_MPU_IPPR_FMCWRP (*((volatile unsigned int *)(0x42A803A4UL)))
#define bM4_SYSREG_MPU_IPPR_WDTRDP (*((volatile unsigned int *)(0x42A803B0UL)))
#define bM4_SYSREG_MPU_IPPR_WDTWRP (*((volatile unsigned int *)(0x42A803B4UL)))
#define bM4_SYSREG_MPU_IPPR_SWDTRDP (*((volatile unsigned int *)(0x42A803B8UL)))
#define bM4_SYSREG_MPU_IPPR_SWDTWRP (*((volatile unsigned int *)(0x42A803BCUL)))
#define bM4_SYSREG_MPU_IPPR_BKSRAMRDP (*((volatile unsigned int *)(0x42A803C0UL)))
#define bM4_SYSREG_MPU_IPPR_BKSRAMWRP (*((volatile unsigned int *)(0x42A803C4UL)))
#define bM4_SYSREG_MPU_IPPR_RTCRDP (*((volatile unsigned int *)(0x42A803C8UL)))
#define bM4_SYSREG_MPU_IPPR_RTCWRP (*((volatile unsigned int *)(0x42A803CCUL)))
#define bM4_SYSREG_MPU_IPPR_DMPURDP (*((volatile unsigned int *)(0x42A803D0UL)))
#define bM4_SYSREG_MPU_IPPR_DMPUWRP (*((volatile unsigned int *)(0x42A803D4UL)))
#define bM4_SYSREG_MPU_IPPR_SRAMCRDP (*((volatile unsigned int *)(0x42A803D8UL)))
#define bM4_SYSREG_MPU_IPPR_SRAMCWRP (*((volatile unsigned int *)(0x42A803DCUL)))
#define bM4_SYSREG_MPU_IPPR_INTCRDP (*((volatile unsigned int *)(0x42A803E0UL)))
#define bM4_SYSREG_MPU_IPPR_INTCWRP (*((volatile unsigned int *)(0x42A803E4UL)))
#define bM4_SYSREG_MPU_IPPR_SYSCRDP (*((volatile unsigned int *)(0x42A803E8UL)))
#define bM4_SYSREG_MPU_IPPR_SYSCWRP (*((volatile unsigned int *)(0x42A803ECUL)))
#define bM4_SYSREG_MPU_IPPR_MSTPRDP (*((volatile unsigned int *)(0x42A803F0UL)))
#define bM4_SYSREG_MPU_IPPR_MSTPWRP (*((volatile unsigned int *)(0x42A803F4UL)))
#define bM4_SYSREG_MPU_IPPR_BUSERRE (*((volatile unsigned int *)(0x42A803FCUL)))
