MarlinFirmware/Marlin/Marlin/lib/h32_core/main/hdsc32core/common/hc32f46x.h
#define bM4_TMR42_OCMRLUL_EOPDCL0 (*((volatile unsigned int *)(0x42490550UL)))
#define bM4_TMR42_OCMRLUL_EOPDCL1 (*((volatile unsigned int *)(0x42490554UL)))
#define bM4_TMR42_OCMRLUL_EOPPKL0 (*((volatile unsigned int *)(0x42490558UL)))
#define bM4_TMR42_OCMRLUL_EOPPKL1 (*((volatile unsigned int *)(0x4249055CUL)))
#define bM4_TMR42_OCMRLUL_EOPUCL0 (*((volatile unsigned int *)(0x42490560UL)))
#define bM4_TMR42_OCMRLUL_EOPUCL1 (*((volatile unsigned int *)(0x42490564UL)))
#define bM4_TMR42_OCMRLUL_EOPZRL0 (*((volatile unsigned int *)(0x42490568UL)))
#define bM4_TMR42_OCMRLUL_EOPZRL1 (*((volatile unsigned int *)(0x4249056CUL)))
#define bM4_TMR42_OCMRLUL_EOPNPKL0 (*((volatile unsigned int *)(0x42490570UL)))
#define bM4_TMR42_OCMRLUL_EOPNPKL1 (*((volatile unsigned int *)(0x42490574UL)))
#define bM4_TMR42_OCMRLUL_EOPNZRL0 (*((volatile unsigned int *)(0x42490578UL)))
#define bM4_TMR42_OCMRLUL_EOPNZRL1 (*((volatile unsigned int *)(0x4249057CUL)))
#define bM4_TMR42_OCMRHVH_OCFDCH (*((volatile unsigned int *)(0x42490580UL)))
#define bM4_TMR42_OCMRHVH_OCFPKH (*((volatile unsigned int *)(0x42490584UL)))
#define bM4_TMR42_OCMRHVH_OCFUCH (*((volatile unsigned int *)(0x42490588UL)))
#define bM4_TMR42_OCMRHVH_OCFZRH (*((volatile unsigned int *)(0x4249058CUL)))
#define bM4_TMR42_OCMRHVH_OPDCH0 (*((volatile unsigned int *)(0x42490590UL)))
#define bM4_TMR42_OCMRHVH_OPDCH1 (*((volatile unsigned int *)(0x42490594UL)))
#define bM4_TMR42_OCMRHVH_OPPKH0 (*((volatile unsigned int *)(0x42490598UL)))
#define bM4_TMR42_OCMRHVH_OPPKH1 (*((volatile unsigned int *)(0x4249059CUL)))
#define bM4_TMR42_OCMRHVH_OPUCH0 (*((volatile unsigned int *)(0x424905A0UL)))
#define bM4_TMR42_OCMRHVH_OPUCH1 (*((volatile unsigned int *)(0x424905A4UL)))
#define bM4_TMR42_OCMRHVH_OPZRH0 (*((volatile unsigned int *)(0x424905A8UL)))
#define bM4_TMR42_OCMRHVH_OPZRH1 (*((volatile unsigned int *)(0x424905ACUL)))
#define bM4_TMR42_OCMRHVH_OPNPKH0 (*((volatile unsigned int *)(0x424905B0UL)))
#define bM4_TMR42_OCMRHVH_OPNPKH1 (*((volatile unsigned int *)(0x424905B4UL)))
#define bM4_TMR42_OCMRHVH_OPNZRH0 (*((volatile unsigned int *)(0x424905B8UL)))
#define bM4_TMR42_OCMRHVH_OPNZRH1 (*((volatile unsigned int *)(0x424905BCUL)))
#define bM4_TMR42_OCMRLVL_OCFDCL (*((volatile unsigned int *)(0x42490600UL)))
#define bM4_TMR42_OCMRLVL_OCFPKL (*((volatile unsigned int *)(0x42490604UL)))
#define bM4_TMR42_OCMRLVL_OCFUCL (*((volatile unsigned int *)(0x42490608UL)))
#define bM4_TMR42_OCMRLVL_OCFZRL (*((volatile unsigned int *)(0x4249060CUL)))
#define bM4_TMR42_OCMRLVL_OPDCL0 (*((volatile unsigned int *)(0x42490610UL)))
#define bM4_TMR42_OCMRLVL_OPDCL1 (*((volatile unsigned int *)(0x42490614UL)))
#define bM4_TMR42_OCMRLVL_OPPKL0 (*((volatile unsigned int *)(0x42490618UL)))
#define bM4_TMR42_OCMRLVL_OPPKL1 (*((volatile unsigned int *)(0x4249061CUL)))
#define bM4_TMR42_OCMRLVL_OPUCL0 (*((volatile unsigned int *)(0x42490620UL)))
#define bM4_TMR42_OCMRLVL_OPUCL1 (*((volatile unsigned int *)(0x42490624UL)))
#define bM4_TMR42_OCMRLVL_OPZRL0 (*((volatile unsigned int *)(0x42490628UL)))
#define bM4_TMR42_OCMRLVL_OPZRL1 (*((volatile unsigned int *)(0x4249062CUL)))
#define bM4_TMR42_OCMRLVL_OPNPKL0 (*((volatile unsigned int *)(0x42490630UL)))
#define bM4_TMR42_OCMRLVL_OPNPKL1 (*((volatile unsigned int *)(0x42490634UL)))
#define bM4_TMR42_OCMRLVL_OPNZRL0 (*((volatile unsigned int *)(0x42490638UL)))
#define bM4_TMR42_OCMRLVL_OPNZRL1 (*((volatile unsigned int *)(0x4249063CUL)))
#define bM4_TMR42_OCMRLVL_EOPNDCL0 (*((volatile unsigned int *)(0x42490640UL)))
#define bM4_TMR42_OCMRLVL_EOPNDCL1 (*((volatile unsigned int *)(0x42490644UL)))
#define bM4_TMR42_OCMRLVL_EOPNUCL0 (*((volatile unsigned int *)(0x42490648UL)))
#define bM4_TMR42_OCMRLVL_EOPNUCL1 (*((volatile unsigned int *)(0x4249064CUL)))
#define bM4_TMR42_OCMRLVL_EOPDCL0 (*((volatile unsigned int *)(0x42490650UL)))
#define bM4_TMR42_OCMRLVL_EOPDCL1 (*((volatile unsigned int *)(0x42490654UL)))
#define bM4_TMR42_OCMRLVL_EOPPKL0 (*((volatile unsigned int *)(0x42490658UL)))
#define bM4_TMR42_OCMRLVL_EOPPKL1 (*((volatile unsigned int *)(0x4249065CUL)))
#define bM4_TMR42_OCMRLVL_EOPUCL0 (*((volatile unsigned int *)(0x42490660UL)))
#define bM4_TMR42_OCMRLVL_EOPUCL1 (*((volatile unsigned int *)(0x42490664UL)))
#define bM4_TMR42_OCMRLVL_EOPZRL0 (*((volatile unsigned int *)(0x42490668UL)))
#define bM4_TMR42_OCMRLVL_EOPZRL1 (*((volatile unsigned int *)(0x4249066CUL)))
#define bM4_TMR42_OCMRLVL_EOPNPKL0 (*((volatile unsigned int *)(0x42490670UL)))
#define bM4_TMR42_OCMRLVL_EOPNPKL1 (*((volatile unsigned int *)(0x42490674UL)))
#define bM4_TMR42_OCMRLVL_EOPNZRL0 (*((volatile unsigned int *)(0x42490678UL)))
#define bM4_TMR42_OCMRLVL_EOPNZRL1 (*((volatile unsigned int *)(0x4249067CUL)))
#define bM4_TMR42_OCMRHWH_OCFDCH (*((volatile unsigned int *)(0x42490680UL)))
#define bM4_TMR42_OCMRHWH_OCFPKH (*((volatile unsigned int *)(0x42490684UL)))
#define bM4_TMR42_OCMRHWH_OCFUCH (*((volatile unsigned int *)(0x42490688UL)))
#define bM4_TMR42_OCMRHWH_OCFZRH (*((volatile unsigned int *)(0x4249068CUL)))
#define bM4_TMR42_OCMRHWH_OPDCH0 (*((volatile unsigned int *)(0x42490690UL)))
#define bM4_TMR42_OCMRHWH_OPDCH1 (*((volatile unsigned int *)(0x42490694UL)))
#define bM4_TMR42_OCMRHWH_OPPKH0 (*((volatile unsigned int *)(0x42490698UL)))
#define bM4_TMR42_OCMRHWH_OPPKH1 (*((volatile unsigned int *)(0x4249069CUL)))
#define bM4_TMR42_OCMRHWH_OPUCH0 (*((volatile unsigned int *)(0x424906A0UL)))
#define bM4_TMR42_OCMRHWH_OPUCH1 (*((volatile unsigned int *)(0x424906A4UL)))
#define bM4_TMR42_OCMRHWH_OPZRH0 (*((volatile unsigned int *)(0x424906A8UL)))
#define bM4_TMR42_OCMRHWH_OPZRH1 (*((volatile unsigned int *)(0x424906ACUL)))
#define bM4_TMR42_OCMRHWH_OPNPKH0 (*((volatile unsigned int *)(0x424906B0UL)))
#define bM4_TMR42_OCMRHWH_OPNPKH1 (*((volatile unsigned int *)(0x424906B4UL)))
#define bM4_TMR42_OCMRHWH_OPNZRH0 (*((volatile unsigned int *)(0x424906B8UL)))
#define bM4_TMR42_OCMRHWH_OPNZRH1 (*((volatile unsigned int *)(0x424906BCUL)))
#define bM4_TMR42_OCMRLWL_OCFDCL (*((volatile unsigned int *)(0x42490700UL)))
#define bM4_TMR42_OCMRLWL_OCFPKL (*((volatile unsigned int *)(0x42490704UL)))
#define bM4_TMR42_OCMRLWL_OCFUCL (*((volatile unsigned int *)(0x42490708UL)))
#define bM4_TMR42_OCMRLWL_OCFZRL (*((volatile unsigned int *)(0x4249070CUL)))
#define bM4_TMR42_OCMRLWL_OPDCL0 (*((volatile unsigned int *)(0x42490710UL)))
#define bM4_TMR42_OCMRLWL_OPDCL1 (*((volatile unsigned int *)(0x42490714UL)))
#define bM4_TMR42_OCMRLWL_OPPKL0 (*((volatile unsigned int *)(0x42490718UL)))
#define bM4_TMR42_OCMRLWL_OPPKL1 (*((volatile unsigned int *)(0x4249071CUL)))
#define bM4_TMR42_OCMRLWL_OPUCL0 (*((volatile unsigned int *)(0x42490720UL)))
#define bM4_TMR42_OCMRLWL_OPUCL1 (*((volatile unsigned int *)(0x42490724UL)))
#define bM4_TMR42_OCMRLWL_OPZRL0 (*((volatile unsigned int *)(0x42490728UL)))
#define bM4_TMR42_OCMRLWL_OPZRL1 (*((volatile unsigned int *)(0x4249072CUL)))
#define bM4_TMR42_OCMRLWL_OPNPKL0 (*((volatile unsigned int *)(0x42490730UL)))
#define bM4_TMR42_OCMRLWL_OPNPKL1 (*((volatile unsigned int *)(0x42490734UL)))
#define bM4_TMR42_OCMRLWL_OPNZRL0 (*((volatile unsigned int *)(0x42490738UL)))
#define bM4_TMR42_OCMRLWL_OPNZRL1 (*((volatile unsigned int *)(0x4249073CUL)))
#define bM4_TMR42_OCMRLWL_EOPNDCL0 (*((volatile unsigned int *)(0x42490740UL)))
#define bM4_TMR42_OCMRLWL_EOPNDCL1 (*((volatile unsigned int *)(0x42490744UL)))
#define bM4_TMR42_OCMRLWL_EOPNUCL0 (*((volatile unsigned int *)(0x42490748UL)))
#define bM4_TMR42_OCMRLWL_EOPNUCL1 (*((volatile unsigned int *)(0x4249074CUL)))
#define bM4_TMR42_OCMRLWL_EOPDCL0 (*((volatile unsigned int *)(0x42490750UL)))
#define bM4_TMR42_OCMRLWL_EOPDCL1 (*((volatile unsigned int *)(0x42490754UL)))
#define bM4_TMR42_OCMRLWL_EOPPKL0 (*((volatile unsigned int *)(0x42490758UL)))
#define bM4_TMR42_OCMRLWL_EOPPKL1 (*((volatile unsigned int *)(0x4249075CUL)))
#define bM4_TMR42_OCMRLWL_EOPUCL0 (*((volatile unsigned int *)(0x42490760UL)))
#define bM4_TMR42_OCMRLWL_EOPUCL1 (*((volatile unsigned int *)(0x42490764UL)))
#define bM4_TMR42_OCMRLWL_EOPZRL0 (*((volatile unsigned int *)(0x42490768UL)))
#define bM4_TMR42_OCMRLWL_EOPZRL1 (*((volatile unsigned int *)(0x4249076CUL)))
#define bM4_TMR42_OCMRLWL_EOPNPKL0 (*((volatile unsigned int *)(0x42490770UL)))
#define bM4_TMR42_OCMRLWL_EOPNPKL1 (*((volatile unsigned int *)(0x42490774UL)))
#define bM4_TMR42_OCMRLWL_EOPNZRL0 (*((volatile unsigned int *)(0x42490778UL)))
#define bM4_TMR42_OCMRLWL_EOPNZRL1 (*((volatile unsigned int *)(0x4249077CUL)))
#define bM4_TMR42_CCSR_CKDIV0 (*((volatile unsigned int *)(0x42490900UL)))
#define bM4_TMR42_CCSR_CKDIV1 (*((volatile unsigned int *)(0x42490904UL)))
#define bM4_TMR42_CCSR_CKDIV2 (*((volatile unsigned int *)(0x42490908UL)))
#define bM4_TMR42_CCSR_CKDIV3 (*((volatile unsigned int *)(0x4249090CUL)))
#define bM4_TMR42_CCSR_CLEAR (*((volatile unsigned int *)(0x42490910UL)))
#define bM4_TMR42_CCSR_MODE (*((volatile unsigned int *)(0x42490914UL)))
#define bM4_TMR42_CCSR_STOP (*((volatile unsigned int *)(0x42490918UL)))
#define bM4_TMR42_CCSR_BUFEN (*((volatile unsigned int *)(0x4249091CUL)))
#define bM4_TMR42_CCSR_IRQPEN (*((volatile unsigned int *)(0x42490920UL)))
#define bM4_TMR42_CCSR_IRQPF (*((volatile unsigned int *)(0x42490924UL)))
#define bM4_TMR42_CCSR_IRQZEN (*((volatile unsigned int *)(0x42490934UL)))
#define bM4_TMR42_CCSR_IRQZF (*((volatile unsigned int *)(0x42490938UL)))
#define bM4_TMR42_CCSR_ECKEN (*((volatile unsigned int *)(0x4249093CUL)))
#define bM4_TMR42_CVPR_ZIM0 (*((volatile unsigned int *)(0x42490940UL)))
#define bM4_TMR42_CVPR_ZIM1 (*((volatile unsigned int *)(0x42490944UL)))
#define bM4_TMR42_CVPR_ZIM2 (*((volatile unsigned int *)(0x42490948UL)))
#define bM4_TMR42_CVPR_ZIM3 (*((volatile unsigned int *)(0x4249094CUL)))
#define bM4_TMR42_CVPR_PIM0 (*((volatile unsigned int *)(0x42490950UL)))
#define bM4_TMR42_CVPR_PIM1 (*((volatile unsigned int *)(0x42490954UL)))
#define bM4_TMR42_CVPR_PIM2 (*((volatile unsigned int *)(0x42490958UL)))
#define bM4_TMR42_CVPR_PIM3 (*((volatile unsigned int *)(0x4249095CUL)))
#define bM4_TMR42_CVPR_ZIC0 (*((volatile unsigned int *)(0x42490960UL)))
#define bM4_TMR42_CVPR_ZIC1 (*((volatile unsigned int *)(0x42490964UL)))
#define bM4_TMR42_CVPR_ZIC2 (*((volatile unsigned int *)(0x42490968UL)))
#define bM4_TMR42_CVPR_ZIC3 (*((volatile unsigned int *)(0x4249096CUL)))
#define bM4_TMR42_CVPR_PIC0 (*((volatile unsigned int *)(0x42490970UL)))
#define bM4_TMR42_CVPR_PIC1 (*((volatile unsigned int *)(0x42490974UL)))
#define bM4_TMR42_CVPR_PIC2 (*((volatile unsigned int *)(0x42490978UL)))
#define bM4_TMR42_CVPR_PIC3 (*((volatile unsigned int *)(0x4249097CUL)))
#define bM4_TMR42_POCRU_DIVCK0 (*((volatile unsigned int *)(0x42491300UL)))
#define bM4_TMR42_POCRU_DIVCK1 (*((volatile unsigned int *)(0x42491304UL)))
#define bM4_TMR42_POCRU_DIVCK2 (*((volatile unsigned int *)(0x42491308UL)))
#define bM4_TMR42_POCRU_DIVCK3 (*((volatile unsigned int *)(0x4249130CUL)))
#define bM4_TMR42_POCRU_PWMMD0 (*((volatile unsigned int *)(0x42491310UL)))
#define bM4_TMR42_POCRU_PWMMD1 (*((volatile unsigned int *)(0x42491314UL)))
#define bM4_TMR42_POCRU_LVLS0 (*((volatile unsigned int *)(0x42491318UL)))
#define bM4_TMR42_POCRU_LVLS1 (*((volatile unsigned int *)(0x4249131CUL)))
#define bM4_TMR42_POCRV_DIVCK0 (*((volatile unsigned int *)(0x42491380UL)))
#define bM4_TMR42_POCRV_DIVCK1 (*((volatile unsigned int *)(0x42491384UL)))
#define bM4_TMR42_POCRV_DIVCK2 (*((volatile unsigned int *)(0x42491388UL)))
#define bM4_TMR42_POCRV_DIVCK3 (*((volatile unsigned int *)(0x4249138CUL)))
#define bM4_TMR42_POCRV_PWMMD0 (*((volatile unsigned int *)(0x42491390UL)))
#define bM4_TMR42_POCRV_PWMMD1 (*((volatile unsigned int *)(0x42491394UL)))
#define bM4_TMR42_POCRV_LVLS0 (*((volatile unsigned int *)(0x42491398UL)))
#define bM4_TMR42_POCRV_LVLS1 (*((volatile unsigned int *)(0x4249139CUL)))
#define bM4_TMR42_POCRW_DIVCK0 (*((volatile unsigned int *)(0x42491400UL)))
#define bM4_TMR42_POCRW_DIVCK1 (*((volatile unsigned int *)(0x42491404UL)))
#define bM4_TMR42_POCRW_DIVCK2 (*((volatile unsigned int *)(0x42491408UL)))
#define bM4_TMR42_POCRW_DIVCK3 (*((volatile unsigned int *)(0x4249140CUL)))
#define bM4_TMR42_POCRW_PWMMD0 (*((volatile unsigned int *)(0x42491410UL)))
#define bM4_TMR42_POCRW_PWMMD1 (*((volatile unsigned int *)(0x42491414UL)))
#define bM4_TMR42_POCRW_LVLS0 (*((volatile unsigned int *)(0x42491418UL)))
#define bM4_TMR42_POCRW_LVLS1 (*((volatile unsigned int *)(0x4249141CUL)))
#define bM4_TMR42_RCSR_RTIDU (*((volatile unsigned int *)(0x42491480UL)))
#define bM4_TMR42_RCSR_RTIDV (*((volatile unsigned int *)(0x42491484UL)))
#define bM4_TMR42_RCSR_RTIDW (*((volatile unsigned int *)(0x42491488UL)))
#define bM4_TMR42_RCSR_RTIFU (*((volatile unsigned int *)(0x42491490UL)))
#define bM4_TMR42_RCSR_RTICU (*((volatile unsigned int *)(0x42491494UL)))
#define bM4_TMR42_RCSR_RTEU (*((volatile unsigned int *)(0x42491498UL)))
#define bM4_TMR42_RCSR_RTSU (*((volatile unsigned int *)(0x4249149CUL)))
#define bM4_TMR42_RCSR_RTIFV (*((volatile unsigned int *)(0x424914A0UL)))
#define bM4_TMR42_RCSR_RTICV (*((volatile unsigned int *)(0x424914A4UL)))
#define bM4_TMR42_RCSR_RTEV (*((volatile unsigned int *)(0x424914A8UL)))
#define bM4_TMR42_RCSR_RTSV (*((volatile unsigned int *)(0x424914ACUL)))
#define bM4_TMR42_RCSR_RTIFW (*((volatile unsigned int *)(0x424914B0UL)))
#define bM4_TMR42_RCSR_RTICW (*((volatile unsigned int *)(0x424914B4UL)))
#define bM4_TMR42_RCSR_RTEW (*((volatile unsigned int *)(0x424914B8UL)))
#define bM4_TMR42_RCSR_RTSW (*((volatile unsigned int *)(0x424914BCUL)))
#define bM4_TMR42_SCSRUH_BUFEN0 (*((volatile unsigned int *)(0x42491900UL)))
#define bM4_TMR42_SCSRUH_BUFEN1 (*((volatile unsigned int *)(0x42491904UL)))
#define bM4_TMR42_SCSRUH_EVTOS0 (*((volatile unsigned int *)(0x42491908UL)))
#define bM4_TMR42_SCSRUH_EVTOS1 (*((volatile unsigned int *)(0x4249190CUL)))
#define bM4_TMR42_SCSRUH_EVTOS2 (*((volatile unsigned int *)(0x42491910UL)))
#define bM4_TMR42_SCSRUH_LMC (*((volatile unsigned int *)(0x42491914UL)))
#define bM4_TMR42_SCSRUH_EVTMS (*((volatile unsigned int *)(0x42491920UL)))
#define bM4_TMR42_SCSRUH_EVTDS (*((volatile unsigned int *)(0x42491924UL)))
#define bM4_TMR42_SCSRUH_DEN (*((volatile unsigned int *)(0x42491930UL)))
#define bM4_TMR42_SCSRUH_PEN (*((volatile unsigned int *)(0x42491934UL)))
#define bM4_TMR42_SCSRUH_UEN (*((volatile unsigned int *)(0x42491938UL)))
#define bM4_TMR42_SCSRUH_ZEN (*((volatile unsigned int *)(0x4249193CUL)))
#define bM4_TMR42_SCMRUH_AMC0 (*((volatile unsigned int *)(0x42491940UL)))
#define bM4_TMR42_SCMRUH_AMC1 (*((volatile unsigned int *)(0x42491944UL)))
#define bM4_TMR42_SCMRUH_AMC2 (*((volatile unsigned int *)(0x42491948UL)))
#define bM4_TMR42_SCMRUH_AMC3 (*((volatile unsigned int *)(0x4249194CUL)))
#define bM4_TMR42_SCMRUH_MZCE (*((volatile unsigned int *)(0x42491958UL)))
#define bM4_TMR42_SCMRUH_MPCE (*((volatile unsigned int *)(0x4249195CUL)))
#define bM4_TMR42_SCSRUL_BUFEN0 (*((volatile unsigned int *)(0x42491980UL)))
#define bM4_TMR42_SCSRUL_BUFEN1 (*((volatile unsigned int *)(0x42491984UL)))
#define bM4_TMR42_SCSRUL_EVTOS0 (*((volatile unsigned int *)(0x42491988UL)))
#define bM4_TMR42_SCSRUL_EVTOS1 (*((volatile unsigned int *)(0x4249198CUL)))
#define bM4_TMR42_SCSRUL_EVTOS2 (*((volatile unsigned int *)(0x42491990UL)))
#define bM4_TMR42_SCSRUL_LMC (*((volatile unsigned int *)(0x42491994UL)))
#define bM4_TMR42_SCSRUL_EVTMS (*((volatile unsigned int *)(0x424919A0UL)))
#define bM4_TMR42_SCSRUL_EVTDS (*((volatile unsigned int *)(0x424919A4UL)))
#define bM4_TMR42_SCSRUL_DEN (*((volatile unsigned int *)(0x424919B0UL)))
#define bM4_TMR42_SCSRUL_PEN (*((volatile unsigned int *)(0x424919B4UL)))
#define bM4_TMR42_SCSRUL_UEN (*((volatile unsigned int *)(0x424919B8UL)))
#define bM4_TMR42_SCSRUL_ZEN (*((volatile unsigned int *)(0x424919BCUL)))
#define bM4_TMR42_SCMRUL_AMC0 (*((volatile unsigned int *)(0x424919C0UL)))
#define bM4_TMR42_SCMRUL_AMC1 (*((volatile unsigned int *)(0x424919C4UL)))
#define bM4_TMR42_SCMRUL_AMC2 (*((volatile unsigned int *)(0x424919C8UL)))
#define bM4_TMR42_SCMRUL_AMC3 (*((volatile unsigned int *)(0x424919CCUL)))
#define bM4_TMR42_SCMRUL_MZCE (*((volatile unsigned int *)(0x424919D8UL)))
#define bM4_TMR42_SCMRUL_MPCE (*((volatile unsigned int *)(0x424919DCUL)))
#define bM4_TMR42_SCSRVH_BUFEN0 (*((volatile unsigned int *)(0x42491A00UL)))
#define bM4_TMR42_SCSRVH_BUFEN1 (*((volatile unsigned int *)(0x42491A04UL)))
#define bM4_TMR42_SCSRVH_EVTOS0 (*((volatile unsigned int *)(0x42491A08UL)))
#define bM4_TMR42_SCSRVH_EVTOS1 (*((volatile unsigned int *)(0x42491A0CUL)))
#define bM4_TMR42_SCSRVH_EVTOS2 (*((volatile unsigned int *)(0x42491A10UL)))
#define bM4_TMR42_SCSRVH_LMC (*((volatile unsigned int *)(0x42491A14UL)))
#define bM4_TMR42_SCSRVH_EVTMS (*((volatile unsigned int *)(0x42491A20UL)))
#define bM4_TMR42_SCSRVH_EVTDS (*((volatile unsigned int *)(0x42491A24UL)))
#define bM4_TMR42_SCSRVH_DEN (*((volatile unsigned int *)(0x42491A30UL)))
#define bM4_TMR42_SCSRVH_PEN (*((volatile unsigned int *)(0x42491A34UL)))
#define bM4_TMR42_SCSRVH_UEN (*((volatile unsigned int *)(0x42491A38UL)))
#define bM4_TMR42_SCSRVH_ZEN (*((volatile unsigned int *)(0x42491A3CUL)))
#define bM4_TMR42_SCMRVH_AMC0 (*((volatile unsigned int *)(0x42491A40UL)))
#define bM4_TMR42_SCMRVH_AMC1 (*((volatile unsigned int *)(0x42491A44UL)))
#define bM4_TMR42_SCMRVH_AMC2 (*((volatile unsigned int *)(0x42491A48UL)))
#define bM4_TMR42_SCMRVH_AMC3 (*((volatile unsigned int *)(0x42491A4CUL)))
#define bM4_TMR42_SCMRVH_MZCE (*((volatile unsigned int *)(0x42491A58UL)))
#define bM4_TMR42_SCMRVH_MPCE (*((volatile unsigned int *)(0x42491A5CUL)))
#define bM4_TMR42_SCSRVL_BUFEN0 (*((volatile unsigned int *)(0x42491A80UL)))
#define bM4_TMR42_SCSRVL_BUFEN1 (*((volatile unsigned int *)(0x42491A84UL)))
#define bM4_TMR42_SCSRVL_EVTOS0 (*((volatile unsigned int *)(0x42491A88UL)))
#define bM4_TMR42_SCSRVL_EVTOS1 (*((volatile unsigned int *)(0x42491A8CUL)))
#define bM4_TMR42_SCSRVL_EVTOS2 (*((volatile unsigned int *)(0x42491A90UL)))
#define bM4_TMR42_SCSRVL_LMC (*((volatile unsigned int *)(0x42491A94UL)))
#define bM4_TMR42_SCSRVL_EVTMS (*((volatile unsigned int *)(0x42491AA0UL)))
#define bM4_TMR42_SCSRVL_EVTDS (*((volatile unsigned int *)(0x42491AA4UL)))
#define bM4_TMR42_SCSRVL_DEN (*((volatile unsigned int *)(0x42491AB0UL)))
#define bM4_TMR42_SCSRVL_PEN (*((volatile unsigned int *)(0x42491AB4UL)))
#define bM4_TMR42_SCSRVL_UEN (*((volatile unsigned int *)(0x42491AB8UL)))
#define bM4_TMR42_SCSRVL_ZEN (*((volatile unsigned int *)(0x42491ABCUL)))
#define bM4_TMR42_SCMRVL_AMC0 (*((volatile unsigned int *)(0x42491AC0UL)))
#define bM4_TMR42_SCMRVL_AMC1 (*((volatile unsigned int *)(0x42491AC4UL)))
#define bM4_TMR42_SCMRVL_AMC2 (*((volatile unsigned int *)(0x42491AC8UL)))
#define bM4_TMR42_SCMRVL_AMC3 (*((volatile unsigned int *)(0x42491ACCUL)))
#define bM4_TMR42_SCMRVL_MZCE (*((volatile unsigned int *)(0x42491AD8UL)))
#define bM4_TMR42_SCMRVL_MPCE (*((volatile unsigned int *)(0x42491ADCUL)))
#define bM4_TMR42_SCSRWH_BUFEN0 (*((volatile unsigned int *)(0x42491B00UL)))
#define bM4_TMR42_SCSRWH_BUFEN1 (*((volatile unsigned int *)(0x42491B04UL)))
#define bM4_TMR42_SCSRWH_EVTOS0 (*((volatile unsigned int *)(0x42491B08UL)))
#define bM4_TMR42_SCSRWH_EVTOS1 (*((volatile unsigned int *)(0x42491B0CUL)))
#define bM4_TMR42_SCSRWH_EVTOS2 (*((volatile unsigned int *)(0x42491B10UL)))
#define bM4_TMR42_SCSRWH_LMC (*((volatile unsigned int *)(0x42491B14UL)))
#define bM4_TMR42_SCSRWH_EVTMS (*((volatile unsigned int *)(0x42491B20UL)))
#define bM4_TMR42_SCSRWH_EVTDS (*((volatile unsigned int *)(0x42491B24UL)))
#define bM4_TMR42_SCSRWH_DEN (*((volatile unsigned int *)(0x42491B30UL)))
#define bM4_TMR42_SCSRWH_PEN (*((volatile unsigned int *)(0x42491B34UL)))
#define bM4_TMR42_SCSRWH_UEN (*((volatile unsigned int *)(0x42491B38UL)))
#define bM4_TMR42_SCSRWH_ZEN (*((volatile unsigned int *)(0x42491B3CUL)))
#define bM4_TMR42_SCMRWH_AMC0 (*((volatile unsigned int *)(0x42491B40UL)))
#define bM4_TMR42_SCMRWH_AMC1 (*((volatile unsigned int *)(0x42491B44UL)))
#define bM4_TMR42_SCMRWH_AMC2 (*((volatile unsigned int *)(0x42491B48UL)))
#define bM4_TMR42_SCMRWH_AMC3 (*((volatile unsigned int *)(0x42491B4CUL)))
#define bM4_TMR42_SCMRWH_MZCE (*((volatile unsigned int *)(0x42491B58UL)))
#define bM4_TMR42_SCMRWH_MPCE (*((volatile unsigned int *)(0x42491B5CUL)))
#define bM4_TMR42_SCSRWL_BUFEN0 (*((volatile unsigned int *)(0x42491B80UL)))
#define bM4_TMR42_SCSRWL_BUFEN1 (*((volatile unsigned int *)(0x42491B84UL)))
#define bM4_TMR42_SCSRWL_EVTOS0 (*((volatile unsigned int *)(0x42491B88UL)))
#define bM4_TMR42_SCSRWL_EVTOS1 (*((volatile unsigned int *)(0x42491B8CUL)))
#define bM4_TMR42_SCSRWL_EVTOS2 (*((volatile unsigned int *)(0x42491B90UL)))
#define bM4_TMR42_SCSRWL_LMC (*((volatile unsigned int *)(0x42491B94UL)))
#define bM4_TMR42_SCSRWL_EVTMS (*((volatile unsigned int *)(0x42491BA0UL)))
#define bM4_TMR42_SCSRWL_EVTDS (*((volatile unsigned int *)(0x42491BA4UL)))
#define bM4_TMR42_SCSRWL_DEN (*((volatile unsigned int *)(0x42491BB0UL)))
#define bM4_TMR42_SCSRWL_PEN (*((volatile unsigned int *)(0x42491BB4UL)))
#define bM4_TMR42_SCSRWL_UEN (*((volatile unsigned int *)(0x42491BB8UL)))
#define bM4_TMR42_SCSRWL_ZEN (*((volatile unsigned int *)(0x42491BBCUL)))
#define bM4_TMR42_SCMRWL_AMC0 (*((volatile unsigned int *)(0x42491BC0UL)))
#define bM4_TMR42_SCMRWL_AMC1 (*((volatile unsigned int *)(0x42491BC4UL)))
#define bM4_TMR42_SCMRWL_AMC2 (*((volatile unsigned int *)(0x42491BC8UL)))
#define bM4_TMR42_SCMRWL_AMC3 (*((volatile unsigned int *)(0x42491BCCUL)))
#define bM4_TMR42_SCMRWL_MZCE (*((volatile unsigned int *)(0x42491BD8UL)))
#define bM4_TMR42_SCMRWL_MPCE (*((volatile unsigned int *)(0x42491BDCUL)))
#define bM4_TMR42_ECSR_HOLD (*((volatile unsigned int *)(0x42491E1CUL)))
#define bM4_TMR43_OCSRU_OCEH (*((volatile unsigned int *)(0x42498300UL)))
#define bM4_TMR43_OCSRU_OCEL (*((volatile unsigned int *)(0x42498304UL)))
#define bM4_TMR43_OCSRU_OCPH (*((volatile unsigned int *)(0x42498308UL)))
#define bM4_TMR43_OCSRU_OCPL (*((volatile unsigned int *)(0x4249830CUL)))
#define bM4_TMR43_OCSRU_OCIEH (*((volatile unsigned int *)(0x42498310UL)))
#define bM4_TMR43_OCSRU_OCIEL (*((volatile unsigned int *)(0x42498314UL)))
#define bM4_TMR43_OCSRU_OCFH (*((volatile unsigned int *)(0x42498318UL)))
#define bM4_TMR43_OCSRU_OCFL (*((volatile unsigned int *)(0x4249831CUL)))
#define bM4_TMR43_OCERU_CHBUFEN0 (*((volatile unsigned int *)(0x42498340UL)))
#define bM4_TMR43_OCERU_CHBUFEN1 (*((volatile unsigned int *)(0x42498344UL)))
#define bM4_TMR43_OCERU_CLBUFEN0 (*((volatile unsigned int *)(0x42498348UL)))
#define bM4_TMR43_OCERU_CLBUFEN1 (*((volatile unsigned int *)(0x4249834CUL)))
#define bM4_TMR43_OCERU_MHBUFEN0 (*((volatile unsigned int *)(0x42498350UL)))
#define bM4_TMR43_OCERU_MHBUFEN1 (*((volatile unsigned int *)(0x42498354UL)))
#define bM4_TMR43_OCERU_MLBUFEN0 (*((volatile unsigned int *)(0x42498358UL)))
#define bM4_TMR43_OCERU_MLBUFEN1 (*((volatile unsigned int *)(0x4249835CUL)))
#define bM4_TMR43_OCERU_LMCH (*((volatile unsigned int *)(0x42498360UL)))
#define bM4_TMR43_OCERU_LMCL (*((volatile unsigned int *)(0x42498364UL)))
#define bM4_TMR43_OCERU_LMMH (*((volatile unsigned int *)(0x42498368UL)))
#define bM4_TMR43_OCERU_LMML (*((volatile unsigned int *)(0x4249836CUL)))
#define bM4_TMR43_OCERU_MCECH (*((volatile unsigned int *)(0x42498370UL)))
#define bM4_TMR43_OCERU_MCECL (*((volatile unsigned int *)(0x42498374UL)))
#define bM4_TMR43_OCSRV_OCEH (*((volatile unsigned int *)(0x42498380UL)))
#define bM4_TMR43_OCSRV_OCEL (*((volatile unsigned int *)(0x42498384UL)))
#define bM4_TMR43_OCSRV_OCPH (*((volatile unsigned int *)(0x42498388UL)))
#define bM4_TMR43_OCSRV_OCPL (*((volatile unsigned int *)(0x4249838CUL)))
#define bM4_TMR43_OCSRV_OCIEH (*((volatile unsigned int *)(0x42498390UL)))
#define bM4_TMR43_OCSRV_OCIEL (*((volatile unsigned int *)(0x42498394UL)))
#define bM4_TMR43_OCSRV_OCFH (*((volatile unsigned int *)(0x42498398UL)))
