MarlinFirmware/Marlin/Marlin/lib/h32_core/main/hdsc32core/common/hc32f46x.h
#define bM4_TMR43_OCSRV_OCFL (*((volatile unsigned int *)(0x4249839CUL)))
#define bM4_TMR43_OCERV_CHBUFEN0 (*((volatile unsigned int *)(0x424983C0UL)))
#define bM4_TMR43_OCERV_CHBUFEN1 (*((volatile unsigned int *)(0x424983C4UL)))
#define bM4_TMR43_OCERV_CLBUFEN0 (*((volatile unsigned int *)(0x424983C8UL)))
#define bM4_TMR43_OCERV_CLBUFEN1 (*((volatile unsigned int *)(0x424983CCUL)))
#define bM4_TMR43_OCERV_MHBUFEN0 (*((volatile unsigned int *)(0x424983D0UL)))
#define bM4_TMR43_OCERV_MHBUFEN1 (*((volatile unsigned int *)(0x424983D4UL)))
#define bM4_TMR43_OCERV_MLBUFEN0 (*((volatile unsigned int *)(0x424983D8UL)))
#define bM4_TMR43_OCERV_MLBUFEN1 (*((volatile unsigned int *)(0x424983DCUL)))
#define bM4_TMR43_OCERV_LMCH (*((volatile unsigned int *)(0x424983E0UL)))
#define bM4_TMR43_OCERV_LMCL (*((volatile unsigned int *)(0x424983E4UL)))
#define bM4_TMR43_OCERV_LMMH (*((volatile unsigned int *)(0x424983E8UL)))
#define bM4_TMR43_OCERV_LMML (*((volatile unsigned int *)(0x424983ECUL)))
#define bM4_TMR43_OCERV_MCECH (*((volatile unsigned int *)(0x424983F0UL)))
#define bM4_TMR43_OCERV_MCECL (*((volatile unsigned int *)(0x424983F4UL)))
#define bM4_TMR43_OCSRW_OCEH (*((volatile unsigned int *)(0x42498400UL)))
#define bM4_TMR43_OCSRW_OCEL (*((volatile unsigned int *)(0x42498404UL)))
#define bM4_TMR43_OCSRW_OCPH (*((volatile unsigned int *)(0x42498408UL)))
#define bM4_TMR43_OCSRW_OCPL (*((volatile unsigned int *)(0x4249840CUL)))
#define bM4_TMR43_OCSRW_OCIEH (*((volatile unsigned int *)(0x42498410UL)))
#define bM4_TMR43_OCSRW_OCIEL (*((volatile unsigned int *)(0x42498414UL)))
#define bM4_TMR43_OCSRW_OCFH (*((volatile unsigned int *)(0x42498418UL)))
#define bM4_TMR43_OCSRW_OCFL (*((volatile unsigned int *)(0x4249841CUL)))
#define bM4_TMR43_OCERW_CHBUFEN0 (*((volatile unsigned int *)(0x42498440UL)))
#define bM4_TMR43_OCERW_CHBUFEN1 (*((volatile unsigned int *)(0x42498444UL)))
#define bM4_TMR43_OCERW_CLBUFEN0 (*((volatile unsigned int *)(0x42498448UL)))
#define bM4_TMR43_OCERW_CLBUFEN1 (*((volatile unsigned int *)(0x4249844CUL)))
#define bM4_TMR43_OCERW_MHBUFEN0 (*((volatile unsigned int *)(0x42498450UL)))
#define bM4_TMR43_OCERW_MHBUFEN1 (*((volatile unsigned int *)(0x42498454UL)))
#define bM4_TMR43_OCERW_MLBUFEN0 (*((volatile unsigned int *)(0x42498458UL)))
#define bM4_TMR43_OCERW_MLBUFEN1 (*((volatile unsigned int *)(0x4249845CUL)))
#define bM4_TMR43_OCERW_LMCH (*((volatile unsigned int *)(0x42498460UL)))
#define bM4_TMR43_OCERW_LMCL (*((volatile unsigned int *)(0x42498464UL)))
#define bM4_TMR43_OCERW_LMMH (*((volatile unsigned int *)(0x42498468UL)))
#define bM4_TMR43_OCERW_LMML (*((volatile unsigned int *)(0x4249846CUL)))
#define bM4_TMR43_OCERW_MCECH (*((volatile unsigned int *)(0x42498470UL)))
#define bM4_TMR43_OCERW_MCECL (*((volatile unsigned int *)(0x42498474UL)))
#define bM4_TMR43_OCMRHUH_OCFDCH (*((volatile unsigned int *)(0x42498480UL)))
#define bM4_TMR43_OCMRHUH_OCFPKH (*((volatile unsigned int *)(0x42498484UL)))
#define bM4_TMR43_OCMRHUH_OCFUCH (*((volatile unsigned int *)(0x42498488UL)))
#define bM4_TMR43_OCMRHUH_OCFZRH (*((volatile unsigned int *)(0x4249848CUL)))
#define bM4_TMR43_OCMRHUH_OPDCH0 (*((volatile unsigned int *)(0x42498490UL)))
#define bM4_TMR43_OCMRHUH_OPDCH1 (*((volatile unsigned int *)(0x42498494UL)))
#define bM4_TMR43_OCMRHUH_OPPKH0 (*((volatile unsigned int *)(0x42498498UL)))
#define bM4_TMR43_OCMRHUH_OPPKH1 (*((volatile unsigned int *)(0x4249849CUL)))
#define bM4_TMR43_OCMRHUH_OPUCH0 (*((volatile unsigned int *)(0x424984A0UL)))
#define bM4_TMR43_OCMRHUH_OPUCH1 (*((volatile unsigned int *)(0x424984A4UL)))
#define bM4_TMR43_OCMRHUH_OPZRH0 (*((volatile unsigned int *)(0x424984A8UL)))
#define bM4_TMR43_OCMRHUH_OPZRH1 (*((volatile unsigned int *)(0x424984ACUL)))
#define bM4_TMR43_OCMRHUH_OPNPKH0 (*((volatile unsigned int *)(0x424984B0UL)))
#define bM4_TMR43_OCMRHUH_OPNPKH1 (*((volatile unsigned int *)(0x424984B4UL)))
#define bM4_TMR43_OCMRHUH_OPNZRH0 (*((volatile unsigned int *)(0x424984B8UL)))
#define bM4_TMR43_OCMRHUH_OPNZRH1 (*((volatile unsigned int *)(0x424984BCUL)))
#define bM4_TMR43_OCMRLUL_OCFDCL (*((volatile unsigned int *)(0x42498500UL)))
#define bM4_TMR43_OCMRLUL_OCFPKL (*((volatile unsigned int *)(0x42498504UL)))
#define bM4_TMR43_OCMRLUL_OCFUCL (*((volatile unsigned int *)(0x42498508UL)))
#define bM4_TMR43_OCMRLUL_OCFZRL (*((volatile unsigned int *)(0x4249850CUL)))
#define bM4_TMR43_OCMRLUL_OPDCL0 (*((volatile unsigned int *)(0x42498510UL)))
#define bM4_TMR43_OCMRLUL_OPDCL1 (*((volatile unsigned int *)(0x42498514UL)))
#define bM4_TMR43_OCMRLUL_OPPKL0 (*((volatile unsigned int *)(0x42498518UL)))
#define bM4_TMR43_OCMRLUL_OPPKL1 (*((volatile unsigned int *)(0x4249851CUL)))
#define bM4_TMR43_OCMRLUL_OPUCL0 (*((volatile unsigned int *)(0x42498520UL)))
#define bM4_TMR43_OCMRLUL_OPUCL1 (*((volatile unsigned int *)(0x42498524UL)))
#define bM4_TMR43_OCMRLUL_OPZRL0 (*((volatile unsigned int *)(0x42498528UL)))
#define bM4_TMR43_OCMRLUL_OPZRL1 (*((volatile unsigned int *)(0x4249852CUL)))
#define bM4_TMR43_OCMRLUL_OPNPKL0 (*((volatile unsigned int *)(0x42498530UL)))
#define bM4_TMR43_OCMRLUL_OPNPKL1 (*((volatile unsigned int *)(0x42498534UL)))
#define bM4_TMR43_OCMRLUL_OPNZRL0 (*((volatile unsigned int *)(0x42498538UL)))
#define bM4_TMR43_OCMRLUL_OPNZRL1 (*((volatile unsigned int *)(0x4249853CUL)))
#define bM4_TMR43_OCMRLUL_EOPNDCL0 (*((volatile unsigned int *)(0x42498540UL)))
#define bM4_TMR43_OCMRLUL_EOPNDCL1 (*((volatile unsigned int *)(0x42498544UL)))
#define bM4_TMR43_OCMRLUL_EOPNUCL0 (*((volatile unsigned int *)(0x42498548UL)))
#define bM4_TMR43_OCMRLUL_EOPNUCL1 (*((volatile unsigned int *)(0x4249854CUL)))
#define bM4_TMR43_OCMRLUL_EOPDCL0 (*((volatile unsigned int *)(0x42498550UL)))
#define bM4_TMR43_OCMRLUL_EOPDCL1 (*((volatile unsigned int *)(0x42498554UL)))
#define bM4_TMR43_OCMRLUL_EOPPKL0 (*((volatile unsigned int *)(0x42498558UL)))
#define bM4_TMR43_OCMRLUL_EOPPKL1 (*((volatile unsigned int *)(0x4249855CUL)))
#define bM4_TMR43_OCMRLUL_EOPUCL0 (*((volatile unsigned int *)(0x42498560UL)))
#define bM4_TMR43_OCMRLUL_EOPUCL1 (*((volatile unsigned int *)(0x42498564UL)))
#define bM4_TMR43_OCMRLUL_EOPZRL0 (*((volatile unsigned int *)(0x42498568UL)))
#define bM4_TMR43_OCMRLUL_EOPZRL1 (*((volatile unsigned int *)(0x4249856CUL)))
#define bM4_TMR43_OCMRLUL_EOPNPKL0 (*((volatile unsigned int *)(0x42498570UL)))
#define bM4_TMR43_OCMRLUL_EOPNPKL1 (*((volatile unsigned int *)(0x42498574UL)))
#define bM4_TMR43_OCMRLUL_EOPNZRL0 (*((volatile unsigned int *)(0x42498578UL)))
#define bM4_TMR43_OCMRLUL_EOPNZRL1 (*((volatile unsigned int *)(0x4249857CUL)))
#define bM4_TMR43_OCMRHVH_OCFDCH (*((volatile unsigned int *)(0x42498580UL)))
#define bM4_TMR43_OCMRHVH_OCFPKH (*((volatile unsigned int *)(0x42498584UL)))
#define bM4_TMR43_OCMRHVH_OCFUCH (*((volatile unsigned int *)(0x42498588UL)))
#define bM4_TMR43_OCMRHVH_OCFZRH (*((volatile unsigned int *)(0x4249858CUL)))
#define bM4_TMR43_OCMRHVH_OPDCH0 (*((volatile unsigned int *)(0x42498590UL)))
#define bM4_TMR43_OCMRHVH_OPDCH1 (*((volatile unsigned int *)(0x42498594UL)))
#define bM4_TMR43_OCMRHVH_OPPKH0 (*((volatile unsigned int *)(0x42498598UL)))
#define bM4_TMR43_OCMRHVH_OPPKH1 (*((volatile unsigned int *)(0x4249859CUL)))
#define bM4_TMR43_OCMRHVH_OPUCH0 (*((volatile unsigned int *)(0x424985A0UL)))
#define bM4_TMR43_OCMRHVH_OPUCH1 (*((volatile unsigned int *)(0x424985A4UL)))
#define bM4_TMR43_OCMRHVH_OPZRH0 (*((volatile unsigned int *)(0x424985A8UL)))
#define bM4_TMR43_OCMRHVH_OPZRH1 (*((volatile unsigned int *)(0x424985ACUL)))
#define bM4_TMR43_OCMRHVH_OPNPKH0 (*((volatile unsigned int *)(0x424985B0UL)))
#define bM4_TMR43_OCMRHVH_OPNPKH1 (*((volatile unsigned int *)(0x424985B4UL)))
#define bM4_TMR43_OCMRHVH_OPNZRH0 (*((volatile unsigned int *)(0x424985B8UL)))
#define bM4_TMR43_OCMRHVH_OPNZRH1 (*((volatile unsigned int *)(0x424985BCUL)))
#define bM4_TMR43_OCMRLVL_OCFDCL (*((volatile unsigned int *)(0x42498600UL)))
#define bM4_TMR43_OCMRLVL_OCFPKL (*((volatile unsigned int *)(0x42498604UL)))
#define bM4_TMR43_OCMRLVL_OCFUCL (*((volatile unsigned int *)(0x42498608UL)))
#define bM4_TMR43_OCMRLVL_OCFZRL (*((volatile unsigned int *)(0x4249860CUL)))
#define bM4_TMR43_OCMRLVL_OPDCL0 (*((volatile unsigned int *)(0x42498610UL)))
#define bM4_TMR43_OCMRLVL_OPDCL1 (*((volatile unsigned int *)(0x42498614UL)))
#define bM4_TMR43_OCMRLVL_OPPKL0 (*((volatile unsigned int *)(0x42498618UL)))
#define bM4_TMR43_OCMRLVL_OPPKL1 (*((volatile unsigned int *)(0x4249861CUL)))
#define bM4_TMR43_OCMRLVL_OPUCL0 (*((volatile unsigned int *)(0x42498620UL)))
#define bM4_TMR43_OCMRLVL_OPUCL1 (*((volatile unsigned int *)(0x42498624UL)))
#define bM4_TMR43_OCMRLVL_OPZRL0 (*((volatile unsigned int *)(0x42498628UL)))
#define bM4_TMR43_OCMRLVL_OPZRL1 (*((volatile unsigned int *)(0x4249862CUL)))
#define bM4_TMR43_OCMRLVL_OPNPKL0 (*((volatile unsigned int *)(0x42498630UL)))
#define bM4_TMR43_OCMRLVL_OPNPKL1 (*((volatile unsigned int *)(0x42498634UL)))
#define bM4_TMR43_OCMRLVL_OPNZRL0 (*((volatile unsigned int *)(0x42498638UL)))
#define bM4_TMR43_OCMRLVL_OPNZRL1 (*((volatile unsigned int *)(0x4249863CUL)))
#define bM4_TMR43_OCMRLVL_EOPNDCL0 (*((volatile unsigned int *)(0x42498640UL)))
#define bM4_TMR43_OCMRLVL_EOPNDCL1 (*((volatile unsigned int *)(0x42498644UL)))
#define bM4_TMR43_OCMRLVL_EOPNUCL0 (*((volatile unsigned int *)(0x42498648UL)))
#define bM4_TMR43_OCMRLVL_EOPNUCL1 (*((volatile unsigned int *)(0x4249864CUL)))
#define bM4_TMR43_OCMRLVL_EOPDCL0 (*((volatile unsigned int *)(0x42498650UL)))
#define bM4_TMR43_OCMRLVL_EOPDCL1 (*((volatile unsigned int *)(0x42498654UL)))
#define bM4_TMR43_OCMRLVL_EOPPKL0 (*((volatile unsigned int *)(0x42498658UL)))
#define bM4_TMR43_OCMRLVL_EOPPKL1 (*((volatile unsigned int *)(0x4249865CUL)))
#define bM4_TMR43_OCMRLVL_EOPUCL0 (*((volatile unsigned int *)(0x42498660UL)))
#define bM4_TMR43_OCMRLVL_EOPUCL1 (*((volatile unsigned int *)(0x42498664UL)))
#define bM4_TMR43_OCMRLVL_EOPZRL0 (*((volatile unsigned int *)(0x42498668UL)))
#define bM4_TMR43_OCMRLVL_EOPZRL1 (*((volatile unsigned int *)(0x4249866CUL)))
#define bM4_TMR43_OCMRLVL_EOPNPKL0 (*((volatile unsigned int *)(0x42498670UL)))
#define bM4_TMR43_OCMRLVL_EOPNPKL1 (*((volatile unsigned int *)(0x42498674UL)))
#define bM4_TMR43_OCMRLVL_EOPNZRL0 (*((volatile unsigned int *)(0x42498678UL)))
#define bM4_TMR43_OCMRLVL_EOPNZRL1 (*((volatile unsigned int *)(0x4249867CUL)))
#define bM4_TMR43_OCMRHWH_OCFDCH (*((volatile unsigned int *)(0x42498680UL)))
#define bM4_TMR43_OCMRHWH_OCFPKH (*((volatile unsigned int *)(0x42498684UL)))
#define bM4_TMR43_OCMRHWH_OCFUCH (*((volatile unsigned int *)(0x42498688UL)))
#define bM4_TMR43_OCMRHWH_OCFZRH (*((volatile unsigned int *)(0x4249868CUL)))
#define bM4_TMR43_OCMRHWH_OPDCH0 (*((volatile unsigned int *)(0x42498690UL)))
#define bM4_TMR43_OCMRHWH_OPDCH1 (*((volatile unsigned int *)(0x42498694UL)))
#define bM4_TMR43_OCMRHWH_OPPKH0 (*((volatile unsigned int *)(0x42498698UL)))
#define bM4_TMR43_OCMRHWH_OPPKH1 (*((volatile unsigned int *)(0x4249869CUL)))
#define bM4_TMR43_OCMRHWH_OPUCH0 (*((volatile unsigned int *)(0x424986A0UL)))
#define bM4_TMR43_OCMRHWH_OPUCH1 (*((volatile unsigned int *)(0x424986A4UL)))
#define bM4_TMR43_OCMRHWH_OPZRH0 (*((volatile unsigned int *)(0x424986A8UL)))
#define bM4_TMR43_OCMRHWH_OPZRH1 (*((volatile unsigned int *)(0x424986ACUL)))
#define bM4_TMR43_OCMRHWH_OPNPKH0 (*((volatile unsigned int *)(0x424986B0UL)))
#define bM4_TMR43_OCMRHWH_OPNPKH1 (*((volatile unsigned int *)(0x424986B4UL)))
#define bM4_TMR43_OCMRHWH_OPNZRH0 (*((volatile unsigned int *)(0x424986B8UL)))
#define bM4_TMR43_OCMRHWH_OPNZRH1 (*((volatile unsigned int *)(0x424986BCUL)))
#define bM4_TMR43_OCMRLWL_OCFDCL (*((volatile unsigned int *)(0x42498700UL)))
#define bM4_TMR43_OCMRLWL_OCFPKL (*((volatile unsigned int *)(0x42498704UL)))
#define bM4_TMR43_OCMRLWL_OCFUCL (*((volatile unsigned int *)(0x42498708UL)))
#define bM4_TMR43_OCMRLWL_OCFZRL (*((volatile unsigned int *)(0x4249870CUL)))
#define bM4_TMR43_OCMRLWL_OPDCL0 (*((volatile unsigned int *)(0x42498710UL)))
#define bM4_TMR43_OCMRLWL_OPDCL1 (*((volatile unsigned int *)(0x42498714UL)))
#define bM4_TMR43_OCMRLWL_OPPKL0 (*((volatile unsigned int *)(0x42498718UL)))
#define bM4_TMR43_OCMRLWL_OPPKL1 (*((volatile unsigned int *)(0x4249871CUL)))
#define bM4_TMR43_OCMRLWL_OPUCL0 (*((volatile unsigned int *)(0x42498720UL)))
#define bM4_TMR43_OCMRLWL_OPUCL1 (*((volatile unsigned int *)(0x42498724UL)))
#define bM4_TMR43_OCMRLWL_OPZRL0 (*((volatile unsigned int *)(0x42498728UL)))
#define bM4_TMR43_OCMRLWL_OPZRL1 (*((volatile unsigned int *)(0x4249872CUL)))
#define bM4_TMR43_OCMRLWL_OPNPKL0 (*((volatile unsigned int *)(0x42498730UL)))
#define bM4_TMR43_OCMRLWL_OPNPKL1 (*((volatile unsigned int *)(0x42498734UL)))
#define bM4_TMR43_OCMRLWL_OPNZRL0 (*((volatile unsigned int *)(0x42498738UL)))
#define bM4_TMR43_OCMRLWL_OPNZRL1 (*((volatile unsigned int *)(0x4249873CUL)))
#define bM4_TMR43_OCMRLWL_EOPNDCL0 (*((volatile unsigned int *)(0x42498740UL)))
#define bM4_TMR43_OCMRLWL_EOPNDCL1 (*((volatile unsigned int *)(0x42498744UL)))
#define bM4_TMR43_OCMRLWL_EOPNUCL0 (*((volatile unsigned int *)(0x42498748UL)))
#define bM4_TMR43_OCMRLWL_EOPNUCL1 (*((volatile unsigned int *)(0x4249874CUL)))
#define bM4_TMR43_OCMRLWL_EOPDCL0 (*((volatile unsigned int *)(0x42498750UL)))
#define bM4_TMR43_OCMRLWL_EOPDCL1 (*((volatile unsigned int *)(0x42498754UL)))
#define bM4_TMR43_OCMRLWL_EOPPKL0 (*((volatile unsigned int *)(0x42498758UL)))
#define bM4_TMR43_OCMRLWL_EOPPKL1 (*((volatile unsigned int *)(0x4249875CUL)))
#define bM4_TMR43_OCMRLWL_EOPUCL0 (*((volatile unsigned int *)(0x42498760UL)))
#define bM4_TMR43_OCMRLWL_EOPUCL1 (*((volatile unsigned int *)(0x42498764UL)))
#define bM4_TMR43_OCMRLWL_EOPZRL0 (*((volatile unsigned int *)(0x42498768UL)))
#define bM4_TMR43_OCMRLWL_EOPZRL1 (*((volatile unsigned int *)(0x4249876CUL)))
#define bM4_TMR43_OCMRLWL_EOPNPKL0 (*((volatile unsigned int *)(0x42498770UL)))
#define bM4_TMR43_OCMRLWL_EOPNPKL1 (*((volatile unsigned int *)(0x42498774UL)))
#define bM4_TMR43_OCMRLWL_EOPNZRL0 (*((volatile unsigned int *)(0x42498778UL)))
#define bM4_TMR43_OCMRLWL_EOPNZRL1 (*((volatile unsigned int *)(0x4249877CUL)))
#define bM4_TMR43_CCSR_CKDIV0 (*((volatile unsigned int *)(0x42498900UL)))
#define bM4_TMR43_CCSR_CKDIV1 (*((volatile unsigned int *)(0x42498904UL)))
#define bM4_TMR43_CCSR_CKDIV2 (*((volatile unsigned int *)(0x42498908UL)))
#define bM4_TMR43_CCSR_CKDIV3 (*((volatile unsigned int *)(0x4249890CUL)))
#define bM4_TMR43_CCSR_CLEAR (*((volatile unsigned int *)(0x42498910UL)))
#define bM4_TMR43_CCSR_MODE (*((volatile unsigned int *)(0x42498914UL)))
#define bM4_TMR43_CCSR_STOP (*((volatile unsigned int *)(0x42498918UL)))
#define bM4_TMR43_CCSR_BUFEN (*((volatile unsigned int *)(0x4249891CUL)))
#define bM4_TMR43_CCSR_IRQPEN (*((volatile unsigned int *)(0x42498920UL)))
#define bM4_TMR43_CCSR_IRQPF (*((volatile unsigned int *)(0x42498924UL)))
#define bM4_TMR43_CCSR_IRQZEN (*((volatile unsigned int *)(0x42498934UL)))
#define bM4_TMR43_CCSR_IRQZF (*((volatile unsigned int *)(0x42498938UL)))
#define bM4_TMR43_CCSR_ECKEN (*((volatile unsigned int *)(0x4249893CUL)))
#define bM4_TMR43_CVPR_ZIM0 (*((volatile unsigned int *)(0x42498940UL)))
#define bM4_TMR43_CVPR_ZIM1 (*((volatile unsigned int *)(0x42498944UL)))
#define bM4_TMR43_CVPR_ZIM2 (*((volatile unsigned int *)(0x42498948UL)))
#define bM4_TMR43_CVPR_ZIM3 (*((volatile unsigned int *)(0x4249894CUL)))
#define bM4_TMR43_CVPR_PIM0 (*((volatile unsigned int *)(0x42498950UL)))
#define bM4_TMR43_CVPR_PIM1 (*((volatile unsigned int *)(0x42498954UL)))
#define bM4_TMR43_CVPR_PIM2 (*((volatile unsigned int *)(0x42498958UL)))
#define bM4_TMR43_CVPR_PIM3 (*((volatile unsigned int *)(0x4249895CUL)))
#define bM4_TMR43_CVPR_ZIC0 (*((volatile unsigned int *)(0x42498960UL)))
#define bM4_TMR43_CVPR_ZIC1 (*((volatile unsigned int *)(0x42498964UL)))
#define bM4_TMR43_CVPR_ZIC2 (*((volatile unsigned int *)(0x42498968UL)))
#define bM4_TMR43_CVPR_ZIC3 (*((volatile unsigned int *)(0x4249896CUL)))
#define bM4_TMR43_CVPR_PIC0 (*((volatile unsigned int *)(0x42498970UL)))
#define bM4_TMR43_CVPR_PIC1 (*((volatile unsigned int *)(0x42498974UL)))
#define bM4_TMR43_CVPR_PIC2 (*((volatile unsigned int *)(0x42498978UL)))
#define bM4_TMR43_CVPR_PIC3 (*((volatile unsigned int *)(0x4249897CUL)))
#define bM4_TMR43_POCRU_DIVCK0 (*((volatile unsigned int *)(0x42499300UL)))
#define bM4_TMR43_POCRU_DIVCK1 (*((volatile unsigned int *)(0x42499304UL)))
#define bM4_TMR43_POCRU_DIVCK2 (*((volatile unsigned int *)(0x42499308UL)))
#define bM4_TMR43_POCRU_DIVCK3 (*((volatile unsigned int *)(0x4249930CUL)))
#define bM4_TMR43_POCRU_PWMMD0 (*((volatile unsigned int *)(0x42499310UL)))
#define bM4_TMR43_POCRU_PWMMD1 (*((volatile unsigned int *)(0x42499314UL)))
#define bM4_TMR43_POCRU_LVLS0 (*((volatile unsigned int *)(0x42499318UL)))
#define bM4_TMR43_POCRU_LVLS1 (*((volatile unsigned int *)(0x4249931CUL)))
#define bM4_TMR43_POCRV_DIVCK0 (*((volatile unsigned int *)(0x42499380UL)))
#define bM4_TMR43_POCRV_DIVCK1 (*((volatile unsigned int *)(0x42499384UL)))
#define bM4_TMR43_POCRV_DIVCK2 (*((volatile unsigned int *)(0x42499388UL)))
#define bM4_TMR43_POCRV_DIVCK3 (*((volatile unsigned int *)(0x4249938CUL)))
#define bM4_TMR43_POCRV_PWMMD0 (*((volatile unsigned int *)(0x42499390UL)))
#define bM4_TMR43_POCRV_PWMMD1 (*((volatile unsigned int *)(0x42499394UL)))
#define bM4_TMR43_POCRV_LVLS0 (*((volatile unsigned int *)(0x42499398UL)))
#define bM4_TMR43_POCRV_LVLS1 (*((volatile unsigned int *)(0x4249939CUL)))
#define bM4_TMR43_POCRW_DIVCK0 (*((volatile unsigned int *)(0x42499400UL)))
#define bM4_TMR43_POCRW_DIVCK1 (*((volatile unsigned int *)(0x42499404UL)))
#define bM4_TMR43_POCRW_DIVCK2 (*((volatile unsigned int *)(0x42499408UL)))
#define bM4_TMR43_POCRW_DIVCK3 (*((volatile unsigned int *)(0x4249940CUL)))
#define bM4_TMR43_POCRW_PWMMD0 (*((volatile unsigned int *)(0x42499410UL)))
#define bM4_TMR43_POCRW_PWMMD1 (*((volatile unsigned int *)(0x42499414UL)))
#define bM4_TMR43_POCRW_LVLS0 (*((volatile unsigned int *)(0x42499418UL)))
#define bM4_TMR43_POCRW_LVLS1 (*((volatile unsigned int *)(0x4249941CUL)))
#define bM4_TMR43_RCSR_RTIDU (*((volatile unsigned int *)(0x42499480UL)))
#define bM4_TMR43_RCSR_RTIDV (*((volatile unsigned int *)(0x42499484UL)))
#define bM4_TMR43_RCSR_RTIDW (*((volatile unsigned int *)(0x42499488UL)))
#define bM4_TMR43_RCSR_RTIFU (*((volatile unsigned int *)(0x42499490UL)))
#define bM4_TMR43_RCSR_RTICU (*((volatile unsigned int *)(0x42499494UL)))
#define bM4_TMR43_RCSR_RTEU (*((volatile unsigned int *)(0x42499498UL)))
#define bM4_TMR43_RCSR_RTSU (*((volatile unsigned int *)(0x4249949CUL)))
#define bM4_TMR43_RCSR_RTIFV (*((volatile unsigned int *)(0x424994A0UL)))
#define bM4_TMR43_RCSR_RTICV (*((volatile unsigned int *)(0x424994A4UL)))
#define bM4_TMR43_RCSR_RTEV (*((volatile unsigned int *)(0x424994A8UL)))
#define bM4_TMR43_RCSR_RTSV (*((volatile unsigned int *)(0x424994ACUL)))
#define bM4_TMR43_RCSR_RTIFW (*((volatile unsigned int *)(0x424994B0UL)))
#define bM4_TMR43_RCSR_RTICW (*((volatile unsigned int *)(0x424994B4UL)))
#define bM4_TMR43_RCSR_RTEW (*((volatile unsigned int *)(0x424994B8UL)))
#define bM4_TMR43_RCSR_RTSW (*((volatile unsigned int *)(0x424994BCUL)))
#define bM4_TMR43_SCSRUH_BUFEN0 (*((volatile unsigned int *)(0x42499900UL)))
#define bM4_TMR43_SCSRUH_BUFEN1 (*((volatile unsigned int *)(0x42499904UL)))
#define bM4_TMR43_SCSRUH_EVTOS0 (*((volatile unsigned int *)(0x42499908UL)))
#define bM4_TMR43_SCSRUH_EVTOS1 (*((volatile unsigned int *)(0x4249990CUL)))
#define bM4_TMR43_SCSRUH_EVTOS2 (*((volatile unsigned int *)(0x42499910UL)))
#define bM4_TMR43_SCSRUH_LMC (*((volatile unsigned int *)(0x42499914UL)))
#define bM4_TMR43_SCSRUH_EVTMS (*((volatile unsigned int *)(0x42499920UL)))
#define bM4_TMR43_SCSRUH_EVTDS (*((volatile unsigned int *)(0x42499924UL)))
#define bM4_TMR43_SCSRUH_DEN (*((volatile unsigned int *)(0x42499930UL)))
#define bM4_TMR43_SCSRUH_PEN (*((volatile unsigned int *)(0x42499934UL)))
#define bM4_TMR43_SCSRUH_UEN (*((volatile unsigned int *)(0x42499938UL)))
#define bM4_TMR43_SCSRUH_ZEN (*((volatile unsigned int *)(0x4249993CUL)))
#define bM4_TMR43_SCMRUH_AMC0 (*((volatile unsigned int *)(0x42499940UL)))
#define bM4_TMR43_SCMRUH_AMC1 (*((volatile unsigned int *)(0x42499944UL)))
#define bM4_TMR43_SCMRUH_AMC2 (*((volatile unsigned int *)(0x42499948UL)))
#define bM4_TMR43_SCMRUH_AMC3 (*((volatile unsigned int *)(0x4249994CUL)))
#define bM4_TMR43_SCMRUH_MZCE (*((volatile unsigned int *)(0x42499958UL)))
#define bM4_TMR43_SCMRUH_MPCE (*((volatile unsigned int *)(0x4249995CUL)))
#define bM4_TMR43_SCSRUL_BUFEN0 (*((volatile unsigned int *)(0x42499980UL)))
#define bM4_TMR43_SCSRUL_BUFEN1 (*((volatile unsigned int *)(0x42499984UL)))
#define bM4_TMR43_SCSRUL_EVTOS0 (*((volatile unsigned int *)(0x42499988UL)))
#define bM4_TMR43_SCSRUL_EVTOS1 (*((volatile unsigned int *)(0x4249998CUL)))
#define bM4_TMR43_SCSRUL_EVTOS2 (*((volatile unsigned int *)(0x42499990UL)))
#define bM4_TMR43_SCSRUL_LMC (*((volatile unsigned int *)(0x42499994UL)))
#define bM4_TMR43_SCSRUL_EVTMS (*((volatile unsigned int *)(0x424999A0UL)))
#define bM4_TMR43_SCSRUL_EVTDS (*((volatile unsigned int *)(0x424999A4UL)))
#define bM4_TMR43_SCSRUL_DEN (*((volatile unsigned int *)(0x424999B0UL)))
#define bM4_TMR43_SCSRUL_PEN (*((volatile unsigned int *)(0x424999B4UL)))
#define bM4_TMR43_SCSRUL_UEN (*((volatile unsigned int *)(0x424999B8UL)))
#define bM4_TMR43_SCSRUL_ZEN (*((volatile unsigned int *)(0x424999BCUL)))
#define bM4_TMR43_SCMRUL_AMC0 (*((volatile unsigned int *)(0x424999C0UL)))
#define bM4_TMR43_SCMRUL_AMC1 (*((volatile unsigned int *)(0x424999C4UL)))
#define bM4_TMR43_SCMRUL_AMC2 (*((volatile unsigned int *)(0x424999C8UL)))
#define bM4_TMR43_SCMRUL_AMC3 (*((volatile unsigned int *)(0x424999CCUL)))
#define bM4_TMR43_SCMRUL_MZCE (*((volatile unsigned int *)(0x424999D8UL)))
#define bM4_TMR43_SCMRUL_MPCE (*((volatile unsigned int *)(0x424999DCUL)))
#define bM4_TMR43_SCSRVH_BUFEN0 (*((volatile unsigned int *)(0x42499A00UL)))
#define bM4_TMR43_SCSRVH_BUFEN1 (*((volatile unsigned int *)(0x42499A04UL)))
#define bM4_TMR43_SCSRVH_EVTOS0 (*((volatile unsigned int *)(0x42499A08UL)))
#define bM4_TMR43_SCSRVH_EVTOS1 (*((volatile unsigned int *)(0x42499A0CUL)))
#define bM4_TMR43_SCSRVH_EVTOS2 (*((volatile unsigned int *)(0x42499A10UL)))
#define bM4_TMR43_SCSRVH_LMC (*((volatile unsigned int *)(0x42499A14UL)))
#define bM4_TMR43_SCSRVH_EVTMS (*((volatile unsigned int *)(0x42499A20UL)))
#define bM4_TMR43_SCSRVH_EVTDS (*((volatile unsigned int *)(0x42499A24UL)))
#define bM4_TMR43_SCSRVH_DEN (*((volatile unsigned int *)(0x42499A30UL)))
#define bM4_TMR43_SCSRVH_PEN (*((volatile unsigned int *)(0x42499A34UL)))
#define bM4_TMR43_SCSRVH_UEN (*((volatile unsigned int *)(0x42499A38UL)))
#define bM4_TMR43_SCSRVH_ZEN (*((volatile unsigned int *)(0x42499A3CUL)))
#define bM4_TMR43_SCMRVH_AMC0 (*((volatile unsigned int *)(0x42499A40UL)))
#define bM4_TMR43_SCMRVH_AMC1 (*((volatile unsigned int *)(0x42499A44UL)))
#define bM4_TMR43_SCMRVH_AMC2 (*((volatile unsigned int *)(0x42499A48UL)))
#define bM4_TMR43_SCMRVH_AMC3 (*((volatile unsigned int *)(0x42499A4CUL)))
#define bM4_TMR43_SCMRVH_MZCE (*((volatile unsigned int *)(0x42499A58UL)))
#define bM4_TMR43_SCMRVH_MPCE (*((volatile unsigned int *)(0x42499A5CUL)))
#define bM4_TMR43_SCSRVL_BUFEN0 (*((volatile unsigned int *)(0x42499A80UL)))
#define bM4_TMR43_SCSRVL_BUFEN1 (*((volatile unsigned int *)(0x42499A84UL)))
#define bM4_TMR43_SCSRVL_EVTOS0 (*((volatile unsigned int *)(0x42499A88UL)))
#define bM4_TMR43_SCSRVL_EVTOS1 (*((volatile unsigned int *)(0x42499A8CUL)))
#define bM4_TMR43_SCSRVL_EVTOS2 (*((volatile unsigned int *)(0x42499A90UL)))
#define bM4_TMR43_SCSRVL_LMC (*((volatile unsigned int *)(0x42499A94UL)))
#define bM4_TMR43_SCSRVL_EVTMS (*((volatile unsigned int *)(0x42499AA0UL)))
#define bM4_TMR43_SCSRVL_EVTDS (*((volatile unsigned int *)(0x42499AA4UL)))
#define bM4_TMR43_SCSRVL_DEN (*((volatile unsigned int *)(0x42499AB0UL)))
