MarlinFirmware/Marlin/Marlin/lib/h32_core/main/hdsc32core/common/hc32f46x.h
#define bM4_TMR43_SCSRVL_PEN (*((volatile unsigned int *)(0x42499AB4UL)))
#define bM4_TMR43_SCSRVL_UEN (*((volatile unsigned int *)(0x42499AB8UL)))
#define bM4_TMR43_SCSRVL_ZEN (*((volatile unsigned int *)(0x42499ABCUL)))
#define bM4_TMR43_SCMRVL_AMC0 (*((volatile unsigned int *)(0x42499AC0UL)))
#define bM4_TMR43_SCMRVL_AMC1 (*((volatile unsigned int *)(0x42499AC4UL)))
#define bM4_TMR43_SCMRVL_AMC2 (*((volatile unsigned int *)(0x42499AC8UL)))
#define bM4_TMR43_SCMRVL_AMC3 (*((volatile unsigned int *)(0x42499ACCUL)))
#define bM4_TMR43_SCMRVL_MZCE (*((volatile unsigned int *)(0x42499AD8UL)))
#define bM4_TMR43_SCMRVL_MPCE (*((volatile unsigned int *)(0x42499ADCUL)))
#define bM4_TMR43_SCSRWH_BUFEN0 (*((volatile unsigned int *)(0x42499B00UL)))
#define bM4_TMR43_SCSRWH_BUFEN1 (*((volatile unsigned int *)(0x42499B04UL)))
#define bM4_TMR43_SCSRWH_EVTOS0 (*((volatile unsigned int *)(0x42499B08UL)))
#define bM4_TMR43_SCSRWH_EVTOS1 (*((volatile unsigned int *)(0x42499B0CUL)))
#define bM4_TMR43_SCSRWH_EVTOS2 (*((volatile unsigned int *)(0x42499B10UL)))
#define bM4_TMR43_SCSRWH_LMC (*((volatile unsigned int *)(0x42499B14UL)))
#define bM4_TMR43_SCSRWH_EVTMS (*((volatile unsigned int *)(0x42499B20UL)))
#define bM4_TMR43_SCSRWH_EVTDS (*((volatile unsigned int *)(0x42499B24UL)))
#define bM4_TMR43_SCSRWH_DEN (*((volatile unsigned int *)(0x42499B30UL)))
#define bM4_TMR43_SCSRWH_PEN (*((volatile unsigned int *)(0x42499B34UL)))
#define bM4_TMR43_SCSRWH_UEN (*((volatile unsigned int *)(0x42499B38UL)))
#define bM4_TMR43_SCSRWH_ZEN (*((volatile unsigned int *)(0x42499B3CUL)))
#define bM4_TMR43_SCMRWH_AMC0 (*((volatile unsigned int *)(0x42499B40UL)))
#define bM4_TMR43_SCMRWH_AMC1 (*((volatile unsigned int *)(0x42499B44UL)))
#define bM4_TMR43_SCMRWH_AMC2 (*((volatile unsigned int *)(0x42499B48UL)))
#define bM4_TMR43_SCMRWH_AMC3 (*((volatile unsigned int *)(0x42499B4CUL)))
#define bM4_TMR43_SCMRWH_MZCE (*((volatile unsigned int *)(0x42499B58UL)))
#define bM4_TMR43_SCMRWH_MPCE (*((volatile unsigned int *)(0x42499B5CUL)))
#define bM4_TMR43_SCSRWL_BUFEN0 (*((volatile unsigned int *)(0x42499B80UL)))
#define bM4_TMR43_SCSRWL_BUFEN1 (*((volatile unsigned int *)(0x42499B84UL)))
#define bM4_TMR43_SCSRWL_EVTOS0 (*((volatile unsigned int *)(0x42499B88UL)))
#define bM4_TMR43_SCSRWL_EVTOS1 (*((volatile unsigned int *)(0x42499B8CUL)))
#define bM4_TMR43_SCSRWL_EVTOS2 (*((volatile unsigned int *)(0x42499B90UL)))
#define bM4_TMR43_SCSRWL_LMC (*((volatile unsigned int *)(0x42499B94UL)))
#define bM4_TMR43_SCSRWL_EVTMS (*((volatile unsigned int *)(0x42499BA0UL)))
#define bM4_TMR43_SCSRWL_EVTDS (*((volatile unsigned int *)(0x42499BA4UL)))
#define bM4_TMR43_SCSRWL_DEN (*((volatile unsigned int *)(0x42499BB0UL)))
#define bM4_TMR43_SCSRWL_PEN (*((volatile unsigned int *)(0x42499BB4UL)))
#define bM4_TMR43_SCSRWL_UEN (*((volatile unsigned int *)(0x42499BB8UL)))
#define bM4_TMR43_SCSRWL_ZEN (*((volatile unsigned int *)(0x42499BBCUL)))
#define bM4_TMR43_SCMRWL_AMC0 (*((volatile unsigned int *)(0x42499BC0UL)))
#define bM4_TMR43_SCMRWL_AMC1 (*((volatile unsigned int *)(0x42499BC4UL)))
#define bM4_TMR43_SCMRWL_AMC2 (*((volatile unsigned int *)(0x42499BC8UL)))
#define bM4_TMR43_SCMRWL_AMC3 (*((volatile unsigned int *)(0x42499BCCUL)))
#define bM4_TMR43_SCMRWL_MZCE (*((volatile unsigned int *)(0x42499BD8UL)))
#define bM4_TMR43_SCMRWL_MPCE (*((volatile unsigned int *)(0x42499BDCUL)))
#define bM4_TMR43_ECSR_HOLD (*((volatile unsigned int *)(0x42499E1CUL)))
#define bM4_TMR4_CR_ECER1_EMBVAL0 (*((volatile unsigned int *)(0x42AA8100UL)))
#define bM4_TMR4_CR_ECER1_EMBVAL1 (*((volatile unsigned int *)(0x42AA8104UL)))
#define bM4_TMR4_CR_ECER2_EMBVAL0 (*((volatile unsigned int *)(0x42AA8180UL)))
#define bM4_TMR4_CR_ECER2_EMBVAL1 (*((volatile unsigned int *)(0x42AA8184UL)))
#define bM4_TMR4_CR_ECER3_EMBVAL0 (*((volatile unsigned int *)(0x42AA8200UL)))
#define bM4_TMR4_CR_ECER3_EMBVAL1 (*((volatile unsigned int *)(0x42AA8204UL)))
#define bM4_TMR61_CNTER_CNT0 (*((volatile unsigned int *)(0x42300000UL)))
#define bM4_TMR61_CNTER_CNT1 (*((volatile unsigned int *)(0x42300004UL)))
#define bM4_TMR61_CNTER_CNT2 (*((volatile unsigned int *)(0x42300008UL)))
#define bM4_TMR61_CNTER_CNT3 (*((volatile unsigned int *)(0x4230000CUL)))
#define bM4_TMR61_CNTER_CNT4 (*((volatile unsigned int *)(0x42300010UL)))
#define bM4_TMR61_CNTER_CNT5 (*((volatile unsigned int *)(0x42300014UL)))
#define bM4_TMR61_CNTER_CNT6 (*((volatile unsigned int *)(0x42300018UL)))
#define bM4_TMR61_CNTER_CNT7 (*((volatile unsigned int *)(0x4230001CUL)))
#define bM4_TMR61_CNTER_CNT8 (*((volatile unsigned int *)(0x42300020UL)))
#define bM4_TMR61_CNTER_CNT9 (*((volatile unsigned int *)(0x42300024UL)))
#define bM4_TMR61_CNTER_CNT10 (*((volatile unsigned int *)(0x42300028UL)))
#define bM4_TMR61_CNTER_CNT11 (*((volatile unsigned int *)(0x4230002CUL)))
#define bM4_TMR61_CNTER_CNT12 (*((volatile unsigned int *)(0x42300030UL)))
#define bM4_TMR61_CNTER_CNT13 (*((volatile unsigned int *)(0x42300034UL)))
#define bM4_TMR61_CNTER_CNT14 (*((volatile unsigned int *)(0x42300038UL)))
#define bM4_TMR61_CNTER_CNT15 (*((volatile unsigned int *)(0x4230003CUL)))
#define bM4_TMR61_PERAR_PERA0 (*((volatile unsigned int *)(0x42300080UL)))
#define bM4_TMR61_PERAR_PERA1 (*((volatile unsigned int *)(0x42300084UL)))
#define bM4_TMR61_PERAR_PERA2 (*((volatile unsigned int *)(0x42300088UL)))
#define bM4_TMR61_PERAR_PERA3 (*((volatile unsigned int *)(0x4230008CUL)))
#define bM4_TMR61_PERAR_PERA4 (*((volatile unsigned int *)(0x42300090UL)))
#define bM4_TMR61_PERAR_PERA5 (*((volatile unsigned int *)(0x42300094UL)))
#define bM4_TMR61_PERAR_PERA6 (*((volatile unsigned int *)(0x42300098UL)))
#define bM4_TMR61_PERAR_PERA7 (*((volatile unsigned int *)(0x4230009CUL)))
#define bM4_TMR61_PERAR_PERA8 (*((volatile unsigned int *)(0x423000A0UL)))
#define bM4_TMR61_PERAR_PERA9 (*((volatile unsigned int *)(0x423000A4UL)))
#define bM4_TMR61_PERAR_PERA10 (*((volatile unsigned int *)(0x423000A8UL)))
#define bM4_TMR61_PERAR_PERA11 (*((volatile unsigned int *)(0x423000ACUL)))
#define bM4_TMR61_PERAR_PERA12 (*((volatile unsigned int *)(0x423000B0UL)))
#define bM4_TMR61_PERAR_PERA13 (*((volatile unsigned int *)(0x423000B4UL)))
#define bM4_TMR61_PERAR_PERA14 (*((volatile unsigned int *)(0x423000B8UL)))
#define bM4_TMR61_PERAR_PERA15 (*((volatile unsigned int *)(0x423000BCUL)))
#define bM4_TMR61_PERBR_PERB0 (*((volatile unsigned int *)(0x42300100UL)))
#define bM4_TMR61_PERBR_PERB1 (*((volatile unsigned int *)(0x42300104UL)))
#define bM4_TMR61_PERBR_PERB2 (*((volatile unsigned int *)(0x42300108UL)))
#define bM4_TMR61_PERBR_PERB3 (*((volatile unsigned int *)(0x4230010CUL)))
#define bM4_TMR61_PERBR_PERB4 (*((volatile unsigned int *)(0x42300110UL)))
#define bM4_TMR61_PERBR_PERB5 (*((volatile unsigned int *)(0x42300114UL)))
#define bM4_TMR61_PERBR_PERB6 (*((volatile unsigned int *)(0x42300118UL)))
#define bM4_TMR61_PERBR_PERB7 (*((volatile unsigned int *)(0x4230011CUL)))
#define bM4_TMR61_PERBR_PERB8 (*((volatile unsigned int *)(0x42300120UL)))
#define bM4_TMR61_PERBR_PERB9 (*((volatile unsigned int *)(0x42300124UL)))
#define bM4_TMR61_PERBR_PERB10 (*((volatile unsigned int *)(0x42300128UL)))
#define bM4_TMR61_PERBR_PERB11 (*((volatile unsigned int *)(0x4230012CUL)))
#define bM4_TMR61_PERBR_PERB12 (*((volatile unsigned int *)(0x42300130UL)))
#define bM4_TMR61_PERBR_PERB13 (*((volatile unsigned int *)(0x42300134UL)))
#define bM4_TMR61_PERBR_PERB14 (*((volatile unsigned int *)(0x42300138UL)))
#define bM4_TMR61_PERBR_PERB15 (*((volatile unsigned int *)(0x4230013CUL)))
#define bM4_TMR61_PERCR_PERC0 (*((volatile unsigned int *)(0x42300180UL)))
#define bM4_TMR61_PERCR_PERC1 (*((volatile unsigned int *)(0x42300184UL)))
#define bM4_TMR61_PERCR_PERC2 (*((volatile unsigned int *)(0x42300188UL)))
#define bM4_TMR61_PERCR_PERC3 (*((volatile unsigned int *)(0x4230018CUL)))
#define bM4_TMR61_PERCR_PERC4 (*((volatile unsigned int *)(0x42300190UL)))
#define bM4_TMR61_PERCR_PERC5 (*((volatile unsigned int *)(0x42300194UL)))
#define bM4_TMR61_PERCR_PERC6 (*((volatile unsigned int *)(0x42300198UL)))
#define bM4_TMR61_PERCR_PERC7 (*((volatile unsigned int *)(0x4230019CUL)))
#define bM4_TMR61_PERCR_PERC8 (*((volatile unsigned int *)(0x423001A0UL)))
#define bM4_TMR61_PERCR_PERC9 (*((volatile unsigned int *)(0x423001A4UL)))
#define bM4_TMR61_PERCR_PERC10 (*((volatile unsigned int *)(0x423001A8UL)))
#define bM4_TMR61_PERCR_PERC11 (*((volatile unsigned int *)(0x423001ACUL)))
#define bM4_TMR61_PERCR_PERC12 (*((volatile unsigned int *)(0x423001B0UL)))
#define bM4_TMR61_PERCR_PERC13 (*((volatile unsigned int *)(0x423001B4UL)))
#define bM4_TMR61_PERCR_PERC14 (*((volatile unsigned int *)(0x423001B8UL)))
#define bM4_TMR61_PERCR_PERC15 (*((volatile unsigned int *)(0x423001BCUL)))
#define bM4_TMR61_GCMAR_GCMA0 (*((volatile unsigned int *)(0x42300200UL)))
#define bM4_TMR61_GCMAR_GCMA1 (*((volatile unsigned int *)(0x42300204UL)))
#define bM4_TMR61_GCMAR_GCMA2 (*((volatile unsigned int *)(0x42300208UL)))
#define bM4_TMR61_GCMAR_GCMA3 (*((volatile unsigned int *)(0x4230020CUL)))
#define bM4_TMR61_GCMAR_GCMA4 (*((volatile unsigned int *)(0x42300210UL)))
#define bM4_TMR61_GCMAR_GCMA5 (*((volatile unsigned int *)(0x42300214UL)))
#define bM4_TMR61_GCMAR_GCMA6 (*((volatile unsigned int *)(0x42300218UL)))
#define bM4_TMR61_GCMAR_GCMA7 (*((volatile unsigned int *)(0x4230021CUL)))
#define bM4_TMR61_GCMAR_GCMA8 (*((volatile unsigned int *)(0x42300220UL)))
#define bM4_TMR61_GCMAR_GCMA9 (*((volatile unsigned int *)(0x42300224UL)))
#define bM4_TMR61_GCMAR_GCMA10 (*((volatile unsigned int *)(0x42300228UL)))
#define bM4_TMR61_GCMAR_GCMA11 (*((volatile unsigned int *)(0x4230022CUL)))
#define bM4_TMR61_GCMAR_GCMA12 (*((volatile unsigned int *)(0x42300230UL)))
#define bM4_TMR61_GCMAR_GCMA13 (*((volatile unsigned int *)(0x42300234UL)))
#define bM4_TMR61_GCMAR_GCMA14 (*((volatile unsigned int *)(0x42300238UL)))
#define bM4_TMR61_GCMAR_GCMA15 (*((volatile unsigned int *)(0x4230023CUL)))
#define bM4_TMR61_GCMBR_GCMB0 (*((volatile unsigned int *)(0x42300280UL)))
#define bM4_TMR61_GCMBR_GCMB1 (*((volatile unsigned int *)(0x42300284UL)))
#define bM4_TMR61_GCMBR_GCMB2 (*((volatile unsigned int *)(0x42300288UL)))
#define bM4_TMR61_GCMBR_GCMB3 (*((volatile unsigned int *)(0x4230028CUL)))
#define bM4_TMR61_GCMBR_GCMB4 (*((volatile unsigned int *)(0x42300290UL)))
#define bM4_TMR61_GCMBR_GCMB5 (*((volatile unsigned int *)(0x42300294UL)))
#define bM4_TMR61_GCMBR_GCMB6 (*((volatile unsigned int *)(0x42300298UL)))
#define bM4_TMR61_GCMBR_GCMB7 (*((volatile unsigned int *)(0x4230029CUL)))
#define bM4_TMR61_GCMBR_GCMB8 (*((volatile unsigned int *)(0x423002A0UL)))
#define bM4_TMR61_GCMBR_GCMB9 (*((volatile unsigned int *)(0x423002A4UL)))
#define bM4_TMR61_GCMBR_GCMB10 (*((volatile unsigned int *)(0x423002A8UL)))
#define bM4_TMR61_GCMBR_GCMB11 (*((volatile unsigned int *)(0x423002ACUL)))
#define bM4_TMR61_GCMBR_GCMB12 (*((volatile unsigned int *)(0x423002B0UL)))
#define bM4_TMR61_GCMBR_GCMB13 (*((volatile unsigned int *)(0x423002B4UL)))
#define bM4_TMR61_GCMBR_GCMB14 (*((volatile unsigned int *)(0x423002B8UL)))
#define bM4_TMR61_GCMBR_GCMB15 (*((volatile unsigned int *)(0x423002BCUL)))
#define bM4_TMR61_GCMCR_GCMC0 (*((volatile unsigned int *)(0x42300300UL)))
#define bM4_TMR61_GCMCR_GCMC1 (*((volatile unsigned int *)(0x42300304UL)))
#define bM4_TMR61_GCMCR_GCMC2 (*((volatile unsigned int *)(0x42300308UL)))
#define bM4_TMR61_GCMCR_GCMC3 (*((volatile unsigned int *)(0x4230030CUL)))
#define bM4_TMR61_GCMCR_GCMC4 (*((volatile unsigned int *)(0x42300310UL)))
#define bM4_TMR61_GCMCR_GCMC5 (*((volatile unsigned int *)(0x42300314UL)))
#define bM4_TMR61_GCMCR_GCMC6 (*((volatile unsigned int *)(0x42300318UL)))
#define bM4_TMR61_GCMCR_GCMC7 (*((volatile unsigned int *)(0x4230031CUL)))
#define bM4_TMR61_GCMCR_GCMC8 (*((volatile unsigned int *)(0x42300320UL)))
#define bM4_TMR61_GCMCR_GCMC9 (*((volatile unsigned int *)(0x42300324UL)))
#define bM4_TMR61_GCMCR_GCMC10 (*((volatile unsigned int *)(0x42300328UL)))
#define bM4_TMR61_GCMCR_GCMC11 (*((volatile unsigned int *)(0x4230032CUL)))
#define bM4_TMR61_GCMCR_GCMC12 (*((volatile unsigned int *)(0x42300330UL)))
#define bM4_TMR61_GCMCR_GCMC13 (*((volatile unsigned int *)(0x42300334UL)))
#define bM4_TMR61_GCMCR_GCMC14 (*((volatile unsigned int *)(0x42300338UL)))
#define bM4_TMR61_GCMCR_GCMC15 (*((volatile unsigned int *)(0x4230033CUL)))
#define bM4_TMR61_GCMDR_GCMD0 (*((volatile unsigned int *)(0x42300380UL)))
#define bM4_TMR61_GCMDR_GCMD1 (*((volatile unsigned int *)(0x42300384UL)))
#define bM4_TMR61_GCMDR_GCMD2 (*((volatile unsigned int *)(0x42300388UL)))
#define bM4_TMR61_GCMDR_GCMD3 (*((volatile unsigned int *)(0x4230038CUL)))
#define bM4_TMR61_GCMDR_GCMD4 (*((volatile unsigned int *)(0x42300390UL)))
#define bM4_TMR61_GCMDR_GCMD5 (*((volatile unsigned int *)(0x42300394UL)))
#define bM4_TMR61_GCMDR_GCMD6 (*((volatile unsigned int *)(0x42300398UL)))
#define bM4_TMR61_GCMDR_GCMD7 (*((volatile unsigned int *)(0x4230039CUL)))
#define bM4_TMR61_GCMDR_GCMD8 (*((volatile unsigned int *)(0x423003A0UL)))
#define bM4_TMR61_GCMDR_GCMD9 (*((volatile unsigned int *)(0x423003A4UL)))
#define bM4_TMR61_GCMDR_GCMD10 (*((volatile unsigned int *)(0x423003A8UL)))
#define bM4_TMR61_GCMDR_GCMD11 (*((volatile unsigned int *)(0x423003ACUL)))
#define bM4_TMR61_GCMDR_GCMD12 (*((volatile unsigned int *)(0x423003B0UL)))
#define bM4_TMR61_GCMDR_GCMD13 (*((volatile unsigned int *)(0x423003B4UL)))
#define bM4_TMR61_GCMDR_GCMD14 (*((volatile unsigned int *)(0x423003B8UL)))
#define bM4_TMR61_GCMDR_GCMD15 (*((volatile unsigned int *)(0x423003BCUL)))
#define bM4_TMR61_GCMER_GCME0 (*((volatile unsigned int *)(0x42300400UL)))
#define bM4_TMR61_GCMER_GCME1 (*((volatile unsigned int *)(0x42300404UL)))
#define bM4_TMR61_GCMER_GCME2 (*((volatile unsigned int *)(0x42300408UL)))
#define bM4_TMR61_GCMER_GCME3 (*((volatile unsigned int *)(0x4230040CUL)))
#define bM4_TMR61_GCMER_GCME4 (*((volatile unsigned int *)(0x42300410UL)))
#define bM4_TMR61_GCMER_GCME5 (*((volatile unsigned int *)(0x42300414UL)))
#define bM4_TMR61_GCMER_GCME6 (*((volatile unsigned int *)(0x42300418UL)))
#define bM4_TMR61_GCMER_GCME7 (*((volatile unsigned int *)(0x4230041CUL)))
#define bM4_TMR61_GCMER_GCME8 (*((volatile unsigned int *)(0x42300420UL)))
#define bM4_TMR61_GCMER_GCME9 (*((volatile unsigned int *)(0x42300424UL)))
#define bM4_TMR61_GCMER_GCME10 (*((volatile unsigned int *)(0x42300428UL)))
#define bM4_TMR61_GCMER_GCME11 (*((volatile unsigned int *)(0x4230042CUL)))
#define bM4_TMR61_GCMER_GCME12 (*((volatile unsigned int *)(0x42300430UL)))
#define bM4_TMR61_GCMER_GCME13 (*((volatile unsigned int *)(0x42300434UL)))
#define bM4_TMR61_GCMER_GCME14 (*((volatile unsigned int *)(0x42300438UL)))
#define bM4_TMR61_GCMER_GCME15 (*((volatile unsigned int *)(0x4230043CUL)))
#define bM4_TMR61_GCMFR_GCMF0 (*((volatile unsigned int *)(0x42300480UL)))
#define bM4_TMR61_GCMFR_GCMF1 (*((volatile unsigned int *)(0x42300484UL)))
#define bM4_TMR61_GCMFR_GCMF2 (*((volatile unsigned int *)(0x42300488UL)))
#define bM4_TMR61_GCMFR_GCMF3 (*((volatile unsigned int *)(0x4230048CUL)))
#define bM4_TMR61_GCMFR_GCMF4 (*((volatile unsigned int *)(0x42300490UL)))
#define bM4_TMR61_GCMFR_GCMF5 (*((volatile unsigned int *)(0x42300494UL)))
#define bM4_TMR61_GCMFR_GCMF6 (*((volatile unsigned int *)(0x42300498UL)))
#define bM4_TMR61_GCMFR_GCMF7 (*((volatile unsigned int *)(0x4230049CUL)))
#define bM4_TMR61_GCMFR_GCMF8 (*((volatile unsigned int *)(0x423004A0UL)))
#define bM4_TMR61_GCMFR_GCMF9 (*((volatile unsigned int *)(0x423004A4UL)))
#define bM4_TMR61_GCMFR_GCMF10 (*((volatile unsigned int *)(0x423004A8UL)))
#define bM4_TMR61_GCMFR_GCMF11 (*((volatile unsigned int *)(0x423004ACUL)))
#define bM4_TMR61_GCMFR_GCMF12 (*((volatile unsigned int *)(0x423004B0UL)))
#define bM4_TMR61_GCMFR_GCMF13 (*((volatile unsigned int *)(0x423004B4UL)))
#define bM4_TMR61_GCMFR_GCMF14 (*((volatile unsigned int *)(0x423004B8UL)))
#define bM4_TMR61_GCMFR_GCMF15 (*((volatile unsigned int *)(0x423004BCUL)))
#define bM4_TMR61_SCMAR_SCMA0 (*((volatile unsigned int *)(0x42300500UL)))
#define bM4_TMR61_SCMAR_SCMA1 (*((volatile unsigned int *)(0x42300504UL)))
#define bM4_TMR61_SCMAR_SCMA2 (*((volatile unsigned int *)(0x42300508UL)))
#define bM4_TMR61_SCMAR_SCMA3 (*((volatile unsigned int *)(0x4230050CUL)))
#define bM4_TMR61_SCMAR_SCMA4 (*((volatile unsigned int *)(0x42300510UL)))
#define bM4_TMR61_SCMAR_SCMA5 (*((volatile unsigned int *)(0x42300514UL)))
#define bM4_TMR61_SCMAR_SCMA6 (*((volatile unsigned int *)(0x42300518UL)))
#define bM4_TMR61_SCMAR_SCMA7 (*((volatile unsigned int *)(0x4230051CUL)))
#define bM4_TMR61_SCMAR_SCMA8 (*((volatile unsigned int *)(0x42300520UL)))
#define bM4_TMR61_SCMAR_SCMA9 (*((volatile unsigned int *)(0x42300524UL)))
#define bM4_TMR61_SCMAR_SCMA10 (*((volatile unsigned int *)(0x42300528UL)))
#define bM4_TMR61_SCMAR_SCMA11 (*((volatile unsigned int *)(0x4230052CUL)))
#define bM4_TMR61_SCMAR_SCMA12 (*((volatile unsigned int *)(0x42300530UL)))
#define bM4_TMR61_SCMAR_SCMA13 (*((volatile unsigned int *)(0x42300534UL)))
#define bM4_TMR61_SCMAR_SCMA14 (*((volatile unsigned int *)(0x42300538UL)))
#define bM4_TMR61_SCMAR_SCMA15 (*((volatile unsigned int *)(0x4230053CUL)))
#define bM4_TMR61_SCMBR_SCMB0 (*((volatile unsigned int *)(0x42300580UL)))
#define bM4_TMR61_SCMBR_SCMB1 (*((volatile unsigned int *)(0x42300584UL)))
#define bM4_TMR61_SCMBR_SCMB2 (*((volatile unsigned int *)(0x42300588UL)))
#define bM4_TMR61_SCMBR_SCMB3 (*((volatile unsigned int *)(0x4230058CUL)))
#define bM4_TMR61_SCMBR_SCMB4 (*((volatile unsigned int *)(0x42300590UL)))
#define bM4_TMR61_SCMBR_SCMB5 (*((volatile unsigned int *)(0x42300594UL)))
#define bM4_TMR61_SCMBR_SCMB6 (*((volatile unsigned int *)(0x42300598UL)))
#define bM4_TMR61_SCMBR_SCMB7 (*((volatile unsigned int *)(0x4230059CUL)))
#define bM4_TMR61_SCMBR_SCMB8 (*((volatile unsigned int *)(0x423005A0UL)))
#define bM4_TMR61_SCMBR_SCMB9 (*((volatile unsigned int *)(0x423005A4UL)))
#define bM4_TMR61_SCMBR_SCMB10 (*((volatile unsigned int *)(0x423005A8UL)))
#define bM4_TMR61_SCMBR_SCMB11 (*((volatile unsigned int *)(0x423005ACUL)))
#define bM4_TMR61_SCMBR_SCMB12 (*((volatile unsigned int *)(0x423005B0UL)))
#define bM4_TMR61_SCMBR_SCMB13 (*((volatile unsigned int *)(0x423005B4UL)))
#define bM4_TMR61_SCMBR_SCMB14 (*((volatile unsigned int *)(0x423005B8UL)))
#define bM4_TMR61_SCMBR_SCMB15 (*((volatile unsigned int *)(0x423005BCUL)))
#define bM4_TMR61_SCMCR_SCMC0 (*((volatile unsigned int *)(0x42300600UL)))
#define bM4_TMR61_SCMCR_SCMC1 (*((volatile unsigned int *)(0x42300604UL)))
#define bM4_TMR61_SCMCR_SCMC2 (*((volatile unsigned int *)(0x42300608UL)))
#define bM4_TMR61_SCMCR_SCMC3 (*((volatile unsigned int *)(0x4230060CUL)))
#define bM4_TMR61_SCMCR_SCMC4 (*((volatile unsigned int *)(0x42300610UL)))
#define bM4_TMR61_SCMCR_SCMC5 (*((volatile unsigned int *)(0x42300614UL)))
#define bM4_TMR61_SCMCR_SCMC6 (*((volatile unsigned int *)(0x42300618UL)))
#define bM4_TMR61_SCMCR_SCMC7 (*((volatile unsigned int *)(0x4230061CUL)))
#define bM4_TMR61_SCMCR_SCMC8 (*((volatile unsigned int *)(0x42300620UL)))
#define bM4_TMR61_SCMCR_SCMC9 (*((volatile unsigned int *)(0x42300624UL)))
#define bM4_TMR61_SCMCR_SCMC10 (*((volatile unsigned int *)(0x42300628UL)))
#define bM4_TMR61_SCMCR_SCMC11 (*((volatile unsigned int *)(0x4230062CUL)))
#define bM4_TMR61_SCMCR_SCMC12 (*((volatile unsigned int *)(0x42300630UL)))
#define bM4_TMR61_SCMCR_SCMC13 (*((volatile unsigned int *)(0x42300634UL)))
#define bM4_TMR61_SCMCR_SCMC14 (*((volatile unsigned int *)(0x42300638UL)))
#define bM4_TMR61_SCMCR_SCMC15 (*((volatile unsigned int *)(0x4230063CUL)))
#define bM4_TMR61_SCMDR_SCMD0 (*((volatile unsigned int *)(0x42300680UL)))
#define bM4_TMR61_SCMDR_SCMD1 (*((volatile unsigned int *)(0x42300684UL)))
#define bM4_TMR61_SCMDR_SCMD2 (*((volatile unsigned int *)(0x42300688UL)))
#define bM4_TMR61_SCMDR_SCMD3 (*((volatile unsigned int *)(0x4230068CUL)))
#define bM4_TMR61_SCMDR_SCMD4 (*((volatile unsigned int *)(0x42300690UL)))
#define bM4_TMR61_SCMDR_SCMD5 (*((volatile unsigned int *)(0x42300694UL)))
#define bM4_TMR61_SCMDR_SCMD6 (*((volatile unsigned int *)(0x42300698UL)))
#define bM4_TMR61_SCMDR_SCMD7 (*((volatile unsigned int *)(0x4230069CUL)))
#define bM4_TMR61_SCMDR_SCMD8 (*((volatile unsigned int *)(0x423006A0UL)))
#define bM4_TMR61_SCMDR_SCMD9 (*((volatile unsigned int *)(0x423006A4UL)))
#define bM4_TMR61_SCMDR_SCMD10 (*((volatile unsigned int *)(0x423006A8UL)))
#define bM4_TMR61_SCMDR_SCMD11 (*((volatile unsigned int *)(0x423006ACUL)))
#define bM4_TMR61_SCMDR_SCMD12 (*((volatile unsigned int *)(0x423006B0UL)))
#define bM4_TMR61_SCMDR_SCMD13 (*((volatile unsigned int *)(0x423006B4UL)))
#define bM4_TMR61_SCMDR_SCMD14 (*((volatile unsigned int *)(0x423006B8UL)))
#define bM4_TMR61_SCMDR_SCMD15 (*((volatile unsigned int *)(0x423006BCUL)))
#define bM4_TMR61_SCMER_SCME0 (*((volatile unsigned int *)(0x42300700UL)))
#define bM4_TMR61_SCMER_SCME1 (*((volatile unsigned int *)(0x42300704UL)))
#define bM4_TMR61_SCMER_SCME2 (*((volatile unsigned int *)(0x42300708UL)))
#define bM4_TMR61_SCMER_SCME3 (*((volatile unsigned int *)(0x4230070CUL)))
#define bM4_TMR61_SCMER_SCME4 (*((volatile unsigned int *)(0x42300710UL)))
#define bM4_TMR61_SCMER_SCME5 (*((volatile unsigned int *)(0x42300714UL)))
#define bM4_TMR61_SCMER_SCME6 (*((volatile unsigned int *)(0x42300718UL)))
#define bM4_TMR61_SCMER_SCME7 (*((volatile unsigned int *)(0x4230071CUL)))
#define bM4_TMR61_SCMER_SCME8 (*((volatile unsigned int *)(0x42300720UL)))
#define bM4_TMR61_SCMER_SCME9 (*((volatile unsigned int *)(0x42300724UL)))
#define bM4_TMR61_SCMER_SCME10 (*((volatile unsigned int *)(0x42300728UL)))
#define bM4_TMR61_SCMER_SCME11 (*((volatile unsigned int *)(0x4230072CUL)))
#define bM4_TMR61_SCMER_SCME12 (*((volatile unsigned int *)(0x42300730UL)))
#define bM4_TMR61_SCMER_SCME13 (*((volatile unsigned int *)(0x42300734UL)))
#define bM4_TMR61_SCMER_SCME14 (*((volatile unsigned int *)(0x42300738UL)))
#define bM4_TMR61_SCMER_SCME15 (*((volatile unsigned int *)(0x4230073CUL)))
#define bM4_TMR61_SCMFR_SCMF0 (*((volatile unsigned int *)(0x42300780UL)))
#define bM4_TMR61_SCMFR_SCMF1 (*((volatile unsigned int *)(0x42300784UL)))
#define bM4_TMR61_SCMFR_SCMF2 (*((volatile unsigned int *)(0x42300788UL)))
#define bM4_TMR61_SCMFR_SCMF3 (*((volatile unsigned int *)(0x4230078CUL)))
#define bM4_TMR61_SCMFR_SCMF4 (*((volatile unsigned int *)(0x42300790UL)))
#define bM4_TMR61_SCMFR_SCMF5 (*((volatile unsigned int *)(0x42300794UL)))
#define bM4_TMR61_SCMFR_SCMF6 (*((volatile unsigned int *)(0x42300798UL)))
#define bM4_TMR61_SCMFR_SCMF7 (*((volatile unsigned int *)(0x4230079CUL)))
#define bM4_TMR61_SCMFR_SCMF8 (*((volatile unsigned int *)(0x423007A0UL)))
#define bM4_TMR61_SCMFR_SCMF9 (*((volatile unsigned int *)(0x423007A4UL)))
#define bM4_TMR61_SCMFR_SCMF10 (*((volatile unsigned int *)(0x423007A8UL)))
#define bM4_TMR61_SCMFR_SCMF11 (*((volatile unsigned int *)(0x423007ACUL)))
#define bM4_TMR61_SCMFR_SCMF12 (*((volatile unsigned int *)(0x423007B0UL)))
#define bM4_TMR61_SCMFR_SCMF13 (*((volatile unsigned int *)(0x423007B4UL)))
#define bM4_TMR61_SCMFR_SCMF14 (*((volatile unsigned int *)(0x423007B8UL)))
#define bM4_TMR61_SCMFR_SCMF15 (*((volatile unsigned int *)(0x423007BCUL)))
#define bM4_TMR61_DTUAR_DTUA0 (*((volatile unsigned int *)(0x42300800UL)))
#define bM4_TMR61_DTUAR_DTUA1 (*((volatile unsigned int *)(0x42300804UL)))
#define bM4_TMR61_DTUAR_DTUA2 (*((volatile unsigned int *)(0x42300808UL)))
#define bM4_TMR61_DTUAR_DTUA3 (*((volatile unsigned int *)(0x4230080CUL)))
#define bM4_TMR61_DTUAR_DTUA4 (*((volatile unsigned int *)(0x42300810UL)))
#define bM4_TMR61_DTUAR_DTUA5 (*((volatile unsigned int *)(0x42300814UL)))
#define bM4_TMR61_DTUAR_DTUA6 (*((volatile unsigned int *)(0x42300818UL)))
#define bM4_TMR61_DTUAR_DTUA7 (*((volatile unsigned int *)(0x4230081CUL)))
#define bM4_TMR61_DTUAR_DTUA8 (*((volatile unsigned int *)(0x42300820UL)))
#define bM4_TMR61_DTUAR_DTUA9 (*((volatile unsigned int *)(0x42300824UL)))
