MarlinFirmware/Marlin/Marlin/lib/h32_core/main/hdsc32core/common/hc32f46x.h
#define bM4_TMR61_DTUAR_DTUA10 (*((volatile unsigned int *)(0x42300828UL)))
#define bM4_TMR61_DTUAR_DTUA11 (*((volatile unsigned int *)(0x4230082CUL)))
#define bM4_TMR61_DTUAR_DTUA12 (*((volatile unsigned int *)(0x42300830UL)))
#define bM4_TMR61_DTUAR_DTUA13 (*((volatile unsigned int *)(0x42300834UL)))
#define bM4_TMR61_DTUAR_DTUA14 (*((volatile unsigned int *)(0x42300838UL)))
#define bM4_TMR61_DTUAR_DTUA15 (*((volatile unsigned int *)(0x4230083CUL)))
#define bM4_TMR61_DTDAR_DTDA0 (*((volatile unsigned int *)(0x42300880UL)))
#define bM4_TMR61_DTDAR_DTDA1 (*((volatile unsigned int *)(0x42300884UL)))
#define bM4_TMR61_DTDAR_DTDA2 (*((volatile unsigned int *)(0x42300888UL)))
#define bM4_TMR61_DTDAR_DTDA3 (*((volatile unsigned int *)(0x4230088CUL)))
#define bM4_TMR61_DTDAR_DTDA4 (*((volatile unsigned int *)(0x42300890UL)))
#define bM4_TMR61_DTDAR_DTDA5 (*((volatile unsigned int *)(0x42300894UL)))
#define bM4_TMR61_DTDAR_DTDA6 (*((volatile unsigned int *)(0x42300898UL)))
#define bM4_TMR61_DTDAR_DTDA7 (*((volatile unsigned int *)(0x4230089CUL)))
#define bM4_TMR61_DTDAR_DTDA8 (*((volatile unsigned int *)(0x423008A0UL)))
#define bM4_TMR61_DTDAR_DTDA9 (*((volatile unsigned int *)(0x423008A4UL)))
#define bM4_TMR61_DTDAR_DTDA10 (*((volatile unsigned int *)(0x423008A8UL)))
#define bM4_TMR61_DTDAR_DTDA11 (*((volatile unsigned int *)(0x423008ACUL)))
#define bM4_TMR61_DTDAR_DTDA12 (*((volatile unsigned int *)(0x423008B0UL)))
#define bM4_TMR61_DTDAR_DTDA13 (*((volatile unsigned int *)(0x423008B4UL)))
#define bM4_TMR61_DTDAR_DTDA14 (*((volatile unsigned int *)(0x423008B8UL)))
#define bM4_TMR61_DTDAR_DTDA15 (*((volatile unsigned int *)(0x423008BCUL)))
#define bM4_TMR61_DTUBR_DTUB0 (*((volatile unsigned int *)(0x42300900UL)))
#define bM4_TMR61_DTUBR_DTUB1 (*((volatile unsigned int *)(0x42300904UL)))
#define bM4_TMR61_DTUBR_DTUB2 (*((volatile unsigned int *)(0x42300908UL)))
#define bM4_TMR61_DTUBR_DTUB3 (*((volatile unsigned int *)(0x4230090CUL)))
#define bM4_TMR61_DTUBR_DTUB4 (*((volatile unsigned int *)(0x42300910UL)))
#define bM4_TMR61_DTUBR_DTUB5 (*((volatile unsigned int *)(0x42300914UL)))
#define bM4_TMR61_DTUBR_DTUB6 (*((volatile unsigned int *)(0x42300918UL)))
#define bM4_TMR61_DTUBR_DTUB7 (*((volatile unsigned int *)(0x4230091CUL)))
#define bM4_TMR61_DTUBR_DTUB8 (*((volatile unsigned int *)(0x42300920UL)))
#define bM4_TMR61_DTUBR_DTUB9 (*((volatile unsigned int *)(0x42300924UL)))
#define bM4_TMR61_DTUBR_DTUB10 (*((volatile unsigned int *)(0x42300928UL)))
#define bM4_TMR61_DTUBR_DTUB11 (*((volatile unsigned int *)(0x4230092CUL)))
#define bM4_TMR61_DTUBR_DTUB12 (*((volatile unsigned int *)(0x42300930UL)))
#define bM4_TMR61_DTUBR_DTUB13 (*((volatile unsigned int *)(0x42300934UL)))
#define bM4_TMR61_DTUBR_DTUB14 (*((volatile unsigned int *)(0x42300938UL)))
#define bM4_TMR61_DTUBR_DTUB15 (*((volatile unsigned int *)(0x4230093CUL)))
#define bM4_TMR61_DTDBR_DTDB0 (*((volatile unsigned int *)(0x42300980UL)))
#define bM4_TMR61_DTDBR_DTDB1 (*((volatile unsigned int *)(0x42300984UL)))
#define bM4_TMR61_DTDBR_DTDB2 (*((volatile unsigned int *)(0x42300988UL)))
#define bM4_TMR61_DTDBR_DTDB3 (*((volatile unsigned int *)(0x4230098CUL)))
#define bM4_TMR61_DTDBR_DTDB4 (*((volatile unsigned int *)(0x42300990UL)))
#define bM4_TMR61_DTDBR_DTDB5 (*((volatile unsigned int *)(0x42300994UL)))
#define bM4_TMR61_DTDBR_DTDB6 (*((volatile unsigned int *)(0x42300998UL)))
#define bM4_TMR61_DTDBR_DTDB7 (*((volatile unsigned int *)(0x4230099CUL)))
#define bM4_TMR61_DTDBR_DTDB8 (*((volatile unsigned int *)(0x423009A0UL)))
#define bM4_TMR61_DTDBR_DTDB9 (*((volatile unsigned int *)(0x423009A4UL)))
#define bM4_TMR61_DTDBR_DTDB10 (*((volatile unsigned int *)(0x423009A8UL)))
#define bM4_TMR61_DTDBR_DTDB11 (*((volatile unsigned int *)(0x423009ACUL)))
#define bM4_TMR61_DTDBR_DTDB12 (*((volatile unsigned int *)(0x423009B0UL)))
#define bM4_TMR61_DTDBR_DTDB13 (*((volatile unsigned int *)(0x423009B4UL)))
#define bM4_TMR61_DTDBR_DTDB14 (*((volatile unsigned int *)(0x423009B8UL)))
#define bM4_TMR61_DTDBR_DTDB15 (*((volatile unsigned int *)(0x423009BCUL)))
#define bM4_TMR61_GCONR_START (*((volatile unsigned int *)(0x42300A00UL)))
#define bM4_TMR61_GCONR_MODE0 (*((volatile unsigned int *)(0x42300A04UL)))
#define bM4_TMR61_GCONR_MODE1 (*((volatile unsigned int *)(0x42300A08UL)))
#define bM4_TMR61_GCONR_MODE2 (*((volatile unsigned int *)(0x42300A0CUL)))
#define bM4_TMR61_GCONR_CKDIV0 (*((volatile unsigned int *)(0x42300A10UL)))
#define bM4_TMR61_GCONR_CKDIV1 (*((volatile unsigned int *)(0x42300A14UL)))
#define bM4_TMR61_GCONR_CKDIV2 (*((volatile unsigned int *)(0x42300A18UL)))
#define bM4_TMR61_GCONR_DIR (*((volatile unsigned int *)(0x42300A20UL)))
#define bM4_TMR61_GCONR_ZMSKREV (*((volatile unsigned int *)(0x42300A40UL)))
#define bM4_TMR61_GCONR_ZMSKPOS (*((volatile unsigned int *)(0x42300A44UL)))
#define bM4_TMR61_GCONR_ZMSKVAL0 (*((volatile unsigned int *)(0x42300A48UL)))
#define bM4_TMR61_GCONR_ZMSKVAL1 (*((volatile unsigned int *)(0x42300A4CUL)))
#define bM4_TMR61_ICONR_INTENA (*((volatile unsigned int *)(0x42300A80UL)))
#define bM4_TMR61_ICONR_INTENB (*((volatile unsigned int *)(0x42300A84UL)))
#define bM4_TMR61_ICONR_INTENC (*((volatile unsigned int *)(0x42300A88UL)))
#define bM4_TMR61_ICONR_INTEND (*((volatile unsigned int *)(0x42300A8CUL)))
#define bM4_TMR61_ICONR_INTENE (*((volatile unsigned int *)(0x42300A90UL)))
#define bM4_TMR61_ICONR_INTENF (*((volatile unsigned int *)(0x42300A94UL)))
#define bM4_TMR61_ICONR_INTENOVF (*((volatile unsigned int *)(0x42300A98UL)))
#define bM4_TMR61_ICONR_INTENUDF (*((volatile unsigned int *)(0x42300A9CUL)))
#define bM4_TMR61_ICONR_INTENDTE (*((volatile unsigned int *)(0x42300AA0UL)))
#define bM4_TMR61_ICONR_INTENSAU (*((volatile unsigned int *)(0x42300AC0UL)))
#define bM4_TMR61_ICONR_INTENSAD (*((volatile unsigned int *)(0x42300AC4UL)))
#define bM4_TMR61_ICONR_INTENSBU (*((volatile unsigned int *)(0x42300AC8UL)))
#define bM4_TMR61_ICONR_INTENSBD (*((volatile unsigned int *)(0x42300ACCUL)))
#define bM4_TMR61_PCONR_CAPMDA (*((volatile unsigned int *)(0x42300B00UL)))
#define bM4_TMR61_PCONR_STACA (*((volatile unsigned int *)(0x42300B04UL)))
#define bM4_TMR61_PCONR_STPCA (*((volatile unsigned int *)(0x42300B08UL)))
#define bM4_TMR61_PCONR_STASTPSA (*((volatile unsigned int *)(0x42300B0CUL)))
#define bM4_TMR61_PCONR_CMPCA0 (*((volatile unsigned int *)(0x42300B10UL)))
#define bM4_TMR61_PCONR_CMPCA1 (*((volatile unsigned int *)(0x42300B14UL)))
#define bM4_TMR61_PCONR_PERCA0 (*((volatile unsigned int *)(0x42300B18UL)))
#define bM4_TMR61_PCONR_PERCA1 (*((volatile unsigned int *)(0x42300B1CUL)))
#define bM4_TMR61_PCONR_OUTENA (*((volatile unsigned int *)(0x42300B20UL)))
#define bM4_TMR61_PCONR_EMBSELA0 (*((volatile unsigned int *)(0x42300B24UL)))
#define bM4_TMR61_PCONR_EMBSELA1 (*((volatile unsigned int *)(0x42300B28UL)))
#define bM4_TMR61_PCONR_EMBVALA0 (*((volatile unsigned int *)(0x42300B2CUL)))
#define bM4_TMR61_PCONR_EMBVALA1 (*((volatile unsigned int *)(0x42300B30UL)))
#define bM4_TMR61_PCONR_CAPMDB (*((volatile unsigned int *)(0x42300B40UL)))
#define bM4_TMR61_PCONR_STACB (*((volatile unsigned int *)(0x42300B44UL)))
#define bM4_TMR61_PCONR_STPCB (*((volatile unsigned int *)(0x42300B48UL)))
#define bM4_TMR61_PCONR_STASTPSB (*((volatile unsigned int *)(0x42300B4CUL)))
#define bM4_TMR61_PCONR_CMPCB0 (*((volatile unsigned int *)(0x42300B50UL)))
#define bM4_TMR61_PCONR_CMPCB1 (*((volatile unsigned int *)(0x42300B54UL)))
#define bM4_TMR61_PCONR_PERCB0 (*((volatile unsigned int *)(0x42300B58UL)))
#define bM4_TMR61_PCONR_PERCB1 (*((volatile unsigned int *)(0x42300B5CUL)))
#define bM4_TMR61_PCONR_OUTENB (*((volatile unsigned int *)(0x42300B60UL)))
#define bM4_TMR61_PCONR_EMBSELB0 (*((volatile unsigned int *)(0x42300B64UL)))
#define bM4_TMR61_PCONR_EMBSELB1 (*((volatile unsigned int *)(0x42300B68UL)))
#define bM4_TMR61_PCONR_EMBVALB0 (*((volatile unsigned int *)(0x42300B6CUL)))
#define bM4_TMR61_PCONR_EMBVALB1 (*((volatile unsigned int *)(0x42300B70UL)))
#define bM4_TMR61_BCONR_BENA (*((volatile unsigned int *)(0x42300B80UL)))
#define bM4_TMR61_BCONR_BSEA (*((volatile unsigned int *)(0x42300B84UL)))
#define bM4_TMR61_BCONR_BENB (*((volatile unsigned int *)(0x42300B88UL)))
#define bM4_TMR61_BCONR_BSEB (*((volatile unsigned int *)(0x42300B8CUL)))
#define bM4_TMR61_BCONR_BENP (*((volatile unsigned int *)(0x42300BA0UL)))
#define bM4_TMR61_BCONR_BSEP (*((volatile unsigned int *)(0x42300BA4UL)))
#define bM4_TMR61_BCONR_BENSPA (*((volatile unsigned int *)(0x42300BC0UL)))
#define bM4_TMR61_BCONR_BSESPA (*((volatile unsigned int *)(0x42300BC4UL)))
#define bM4_TMR61_BCONR_BTRSPA0 (*((volatile unsigned int *)(0x42300BD0UL)))
#define bM4_TMR61_BCONR_BTRSPA1 (*((volatile unsigned int *)(0x42300BD4UL)))
#define bM4_TMR61_BCONR_BENSPB (*((volatile unsigned int *)(0x42300BE0UL)))
#define bM4_TMR61_BCONR_BSESPB (*((volatile unsigned int *)(0x42300BE4UL)))
#define bM4_TMR61_BCONR_BTRSPB0 (*((volatile unsigned int *)(0x42300BF0UL)))
#define bM4_TMR61_BCONR_BTRSPB1 (*((volatile unsigned int *)(0x42300BF4UL)))
#define bM4_TMR61_DCONR_DTCEN (*((volatile unsigned int *)(0x42300C00UL)))
#define bM4_TMR61_DCONR_DTBENU (*((volatile unsigned int *)(0x42300C10UL)))
#define bM4_TMR61_DCONR_DTBEND (*((volatile unsigned int *)(0x42300C14UL)))
#define bM4_TMR61_DCONR_SEPA (*((volatile unsigned int *)(0x42300C20UL)))
#define bM4_TMR61_FCONR_NOFIENGA (*((volatile unsigned int *)(0x42300D00UL)))
#define bM4_TMR61_FCONR_NOFICKGA0 (*((volatile unsigned int *)(0x42300D04UL)))
#define bM4_TMR61_FCONR_NOFICKGA1 (*((volatile unsigned int *)(0x42300D08UL)))
#define bM4_TMR61_FCONR_NOFIENGB (*((volatile unsigned int *)(0x42300D10UL)))
#define bM4_TMR61_FCONR_NOFICKGB0 (*((volatile unsigned int *)(0x42300D14UL)))
#define bM4_TMR61_FCONR_NOFICKGB1 (*((volatile unsigned int *)(0x42300D18UL)))
#define bM4_TMR61_FCONR_NOFIENTA (*((volatile unsigned int *)(0x42300D40UL)))
#define bM4_TMR61_FCONR_NOFICKTA0 (*((volatile unsigned int *)(0x42300D44UL)))
#define bM4_TMR61_FCONR_NOFICKTA1 (*((volatile unsigned int *)(0x42300D48UL)))
#define bM4_TMR61_FCONR_NOFIENTB (*((volatile unsigned int *)(0x42300D50UL)))
#define bM4_TMR61_FCONR_NOFICKTB0 (*((volatile unsigned int *)(0x42300D54UL)))
#define bM4_TMR61_FCONR_NOFICKTB1 (*((volatile unsigned int *)(0x42300D58UL)))
#define bM4_TMR61_VPERR_SPPERIA (*((volatile unsigned int *)(0x42300DA0UL)))
#define bM4_TMR61_VPERR_SPPERIB (*((volatile unsigned int *)(0x42300DA4UL)))
#define bM4_TMR61_VPERR_PCNTE0 (*((volatile unsigned int *)(0x42300DC0UL)))
#define bM4_TMR61_VPERR_PCNTE1 (*((volatile unsigned int *)(0x42300DC4UL)))
#define bM4_TMR61_VPERR_PCNTS0 (*((volatile unsigned int *)(0x42300DC8UL)))
#define bM4_TMR61_VPERR_PCNTS1 (*((volatile unsigned int *)(0x42300DCCUL)))
#define bM4_TMR61_VPERR_PCNTS2 (*((volatile unsigned int *)(0x42300DD0UL)))
#define bM4_TMR61_STFLR_CMAF (*((volatile unsigned int *)(0x42300E00UL)))
#define bM4_TMR61_STFLR_CMBF (*((volatile unsigned int *)(0x42300E04UL)))
#define bM4_TMR61_STFLR_CMCF (*((volatile unsigned int *)(0x42300E08UL)))
#define bM4_TMR61_STFLR_CMDF (*((volatile unsigned int *)(0x42300E0CUL)))
#define bM4_TMR61_STFLR_CMEF (*((volatile unsigned int *)(0x42300E10UL)))
#define bM4_TMR61_STFLR_CMFF (*((volatile unsigned int *)(0x42300E14UL)))
#define bM4_TMR61_STFLR_OVFF (*((volatile unsigned int *)(0x42300E18UL)))
#define bM4_TMR61_STFLR_UDFF (*((volatile unsigned int *)(0x42300E1CUL)))
#define bM4_TMR61_STFLR_DTEF (*((volatile unsigned int *)(0x42300E20UL)))
#define bM4_TMR61_STFLR_CMSAUF (*((volatile unsigned int *)(0x42300E24UL)))
#define bM4_TMR61_STFLR_CMSADF (*((volatile unsigned int *)(0x42300E28UL)))
#define bM4_TMR61_STFLR_CMSBUF (*((volatile unsigned int *)(0x42300E2CUL)))
#define bM4_TMR61_STFLR_CMSBDF (*((volatile unsigned int *)(0x42300E30UL)))
#define bM4_TMR61_STFLR_VPERNUM0 (*((volatile unsigned int *)(0x42300E54UL)))
#define bM4_TMR61_STFLR_VPERNUM1 (*((volatile unsigned int *)(0x42300E58UL)))
#define bM4_TMR61_STFLR_VPERNUM2 (*((volatile unsigned int *)(0x42300E5CUL)))
#define bM4_TMR61_STFLR_DIRF (*((volatile unsigned int *)(0x42300E7CUL)))
#define bM4_TMR61_HSTAR_HSTA0 (*((volatile unsigned int *)(0x42300E80UL)))
#define bM4_TMR61_HSTAR_HSTA1 (*((volatile unsigned int *)(0x42300E84UL)))
#define bM4_TMR61_HSTAR_HSTA4 (*((volatile unsigned int *)(0x42300E90UL)))
#define bM4_TMR61_HSTAR_HSTA5 (*((volatile unsigned int *)(0x42300E94UL)))
#define bM4_TMR61_HSTAR_HSTA6 (*((volatile unsigned int *)(0x42300E98UL)))
#define bM4_TMR61_HSTAR_HSTA7 (*((volatile unsigned int *)(0x42300E9CUL)))
#define bM4_TMR61_HSTAR_HSTA8 (*((volatile unsigned int *)(0x42300EA0UL)))
#define bM4_TMR61_HSTAR_HSTA9 (*((volatile unsigned int *)(0x42300EA4UL)))
#define bM4_TMR61_HSTAR_HSTA10 (*((volatile unsigned int *)(0x42300EA8UL)))
#define bM4_TMR61_HSTAR_HSTA11 (*((volatile unsigned int *)(0x42300EACUL)))
#define bM4_TMR61_HSTAR_STARTS (*((volatile unsigned int *)(0x42300EFCUL)))
#define bM4_TMR61_HSTPR_HSTP0 (*((volatile unsigned int *)(0x42300F00UL)))
#define bM4_TMR61_HSTPR_HSTP1 (*((volatile unsigned int *)(0x42300F04UL)))
#define bM4_TMR61_HSTPR_HSTP4 (*((volatile unsigned int *)(0x42300F10UL)))
#define bM4_TMR61_HSTPR_HSTP5 (*((volatile unsigned int *)(0x42300F14UL)))
#define bM4_TMR61_HSTPR_HSTP6 (*((volatile unsigned int *)(0x42300F18UL)))
#define bM4_TMR61_HSTPR_HSTP7 (*((volatile unsigned int *)(0x42300F1CUL)))
#define bM4_TMR61_HSTPR_HSTP8 (*((volatile unsigned int *)(0x42300F20UL)))
#define bM4_TMR61_HSTPR_HSTP9 (*((volatile unsigned int *)(0x42300F24UL)))
#define bM4_TMR61_HSTPR_HSTP10 (*((volatile unsigned int *)(0x42300F28UL)))
#define bM4_TMR61_HSTPR_HSTP11 (*((volatile unsigned int *)(0x42300F2CUL)))
#define bM4_TMR61_HSTPR_STOPS (*((volatile unsigned int *)(0x42300F7CUL)))
#define bM4_TMR61_HCLRR_HCLE0 (*((volatile unsigned int *)(0x42300F80UL)))
#define bM4_TMR61_HCLRR_HCLE1 (*((volatile unsigned int *)(0x42300F84UL)))
#define bM4_TMR61_HCLRR_HCLE4 (*((volatile unsigned int *)(0x42300F90UL)))
#define bM4_TMR61_HCLRR_HCLE5 (*((volatile unsigned int *)(0x42300F94UL)))
#define bM4_TMR61_HCLRR_HCLE6 (*((volatile unsigned int *)(0x42300F98UL)))
#define bM4_TMR61_HCLRR_HCLE7 (*((volatile unsigned int *)(0x42300F9CUL)))
#define bM4_TMR61_HCLRR_HCLE8 (*((volatile unsigned int *)(0x42300FA0UL)))
#define bM4_TMR61_HCLRR_HCLE9 (*((volatile unsigned int *)(0x42300FA4UL)))
#define bM4_TMR61_HCLRR_HCLE10 (*((volatile unsigned int *)(0x42300FA8UL)))
#define bM4_TMR61_HCLRR_HCLE11 (*((volatile unsigned int *)(0x42300FACUL)))
#define bM4_TMR61_HCLRR_CLEARS (*((volatile unsigned int *)(0x42300FFCUL)))
#define bM4_TMR61_HCPAR_HCPA0 (*((volatile unsigned int *)(0x42301000UL)))
#define bM4_TMR61_HCPAR_HCPA1 (*((volatile unsigned int *)(0x42301004UL)))
#define bM4_TMR61_HCPAR_HCPA4 (*((volatile unsigned int *)(0x42301010UL)))
#define bM4_TMR61_HCPAR_HCPA5 (*((volatile unsigned int *)(0x42301014UL)))
#define bM4_TMR61_HCPAR_HCPA6 (*((volatile unsigned int *)(0x42301018UL)))
#define bM4_TMR61_HCPAR_HCPA7 (*((volatile unsigned int *)(0x4230101CUL)))
#define bM4_TMR61_HCPAR_HCPA8 (*((volatile unsigned int *)(0x42301020UL)))
#define bM4_TMR61_HCPAR_HCPA9 (*((volatile unsigned int *)(0x42301024UL)))
#define bM4_TMR61_HCPAR_HCPA10 (*((volatile unsigned int *)(0x42301028UL)))
#define bM4_TMR61_HCPAR_HCPA11 (*((volatile unsigned int *)(0x4230102CUL)))
#define bM4_TMR61_HCPBR_HCPB0 (*((volatile unsigned int *)(0x42301080UL)))
#define bM4_TMR61_HCPBR_HCPB1 (*((volatile unsigned int *)(0x42301084UL)))
#define bM4_TMR61_HCPBR_HCPB4 (*((volatile unsigned int *)(0x42301090UL)))
#define bM4_TMR61_HCPBR_HCPB5 (*((volatile unsigned int *)(0x42301094UL)))
#define bM4_TMR61_HCPBR_HCPB6 (*((volatile unsigned int *)(0x42301098UL)))
#define bM4_TMR61_HCPBR_HCPB7 (*((volatile unsigned int *)(0x4230109CUL)))
#define bM4_TMR61_HCPBR_HCPB8 (*((volatile unsigned int *)(0x423010A0UL)))
#define bM4_TMR61_HCPBR_HCPB9 (*((volatile unsigned int *)(0x423010A4UL)))
#define bM4_TMR61_HCPBR_HCPB10 (*((volatile unsigned int *)(0x423010A8UL)))
#define bM4_TMR61_HCPBR_HCPB11 (*((volatile unsigned int *)(0x423010ACUL)))
#define bM4_TMR61_HCUPR_HCUP0 (*((volatile unsigned int *)(0x42301100UL)))
#define bM4_TMR61_HCUPR_HCUP1 (*((volatile unsigned int *)(0x42301104UL)))
#define bM4_TMR61_HCUPR_HCUP2 (*((volatile unsigned int *)(0x42301108UL)))
#define bM4_TMR61_HCUPR_HCUP3 (*((volatile unsigned int *)(0x4230110CUL)))
#define bM4_TMR61_HCUPR_HCUP4 (*((volatile unsigned int *)(0x42301110UL)))
#define bM4_TMR61_HCUPR_HCUP5 (*((volatile unsigned int *)(0x42301114UL)))
#define bM4_TMR61_HCUPR_HCUP6 (*((volatile unsigned int *)(0x42301118UL)))
#define bM4_TMR61_HCUPR_HCUP7 (*((volatile unsigned int *)(0x4230111CUL)))
#define bM4_TMR61_HCUPR_HCUP8 (*((volatile unsigned int *)(0x42301120UL)))
#define bM4_TMR61_HCUPR_HCUP9 (*((volatile unsigned int *)(0x42301124UL)))
#define bM4_TMR61_HCUPR_HCUP10 (*((volatile unsigned int *)(0x42301128UL)))
#define bM4_TMR61_HCUPR_HCUP11 (*((volatile unsigned int *)(0x4230112CUL)))
#define bM4_TMR61_HCUPR_HCUP16 (*((volatile unsigned int *)(0x42301140UL)))
#define bM4_TMR61_HCUPR_HCUP17 (*((volatile unsigned int *)(0x42301144UL)))
#define bM4_TMR61_HCDOR_HCDO0 (*((volatile unsigned int *)(0x42301180UL)))
#define bM4_TMR61_HCDOR_HCDO1 (*((volatile unsigned int *)(0x42301184UL)))
#define bM4_TMR61_HCDOR_HCDO2 (*((volatile unsigned int *)(0x42301188UL)))
#define bM4_TMR61_HCDOR_HCDO3 (*((volatile unsigned int *)(0x4230118CUL)))
#define bM4_TMR61_HCDOR_HCDO4 (*((volatile unsigned int *)(0x42301190UL)))
#define bM4_TMR61_HCDOR_HCDO5 (*((volatile unsigned int *)(0x42301194UL)))
#define bM4_TMR61_HCDOR_HCDO6 (*((volatile unsigned int *)(0x42301198UL)))
#define bM4_TMR61_HCDOR_HCDO7 (*((volatile unsigned int *)(0x4230119CUL)))
#define bM4_TMR61_HCDOR_HCDO8 (*((volatile unsigned int *)(0x423011A0UL)))
#define bM4_TMR61_HCDOR_HCDO9 (*((volatile unsigned int *)(0x423011A4UL)))
#define bM4_TMR61_HCDOR_HCDO10 (*((volatile unsigned int *)(0x423011A8UL)))
#define bM4_TMR61_HCDOR_HCDO11 (*((volatile unsigned int *)(0x423011ACUL)))
#define bM4_TMR61_HCDOR_HCDO16 (*((volatile unsigned int *)(0x423011C0UL)))
#define bM4_TMR61_HCDOR_HCDO17 (*((volatile unsigned int *)(0x423011C4UL)))
#define bM4_TMR62_CNTER_CNT0 (*((volatile unsigned int *)(0x42308000UL)))
#define bM4_TMR62_CNTER_CNT1 (*((volatile unsigned int *)(0x42308004UL)))
#define bM4_TMR62_CNTER_CNT2 (*((volatile unsigned int *)(0x42308008UL)))
#define bM4_TMR62_CNTER_CNT3 (*((volatile unsigned int *)(0x4230800CUL)))
#define bM4_TMR62_CNTER_CNT4 (*((volatile unsigned int *)(0x42308010UL)))
#define bM4_TMR62_CNTER_CNT5 (*((volatile unsigned int *)(0x42308014UL)))
#define bM4_TMR62_CNTER_CNT6 (*((volatile unsigned int *)(0x42308018UL)))
#define bM4_TMR62_CNTER_CNT7 (*((volatile unsigned int *)(0x4230801CUL)))
#define bM4_TMR62_CNTER_CNT8 (*((volatile unsigned int *)(0x42308020UL)))
#define bM4_TMR62_CNTER_CNT9 (*((volatile unsigned int *)(0x42308024UL)))
#define bM4_TMR62_CNTER_CNT10 (*((volatile unsigned int *)(0x42308028UL)))
#define bM4_TMR62_CNTER_CNT11 (*((volatile unsigned int *)(0x4230802CUL)))
#define bM4_TMR62_CNTER_CNT12 (*((volatile unsigned int *)(0x42308030UL)))
#define bM4_TMR62_CNTER_CNT13 (*((volatile unsigned int *)(0x42308034UL)))
#define bM4_TMR62_CNTER_CNT14 (*((volatile unsigned int *)(0x42308038UL)))
#define bM4_TMR62_CNTER_CNT15 (*((volatile unsigned int *)(0x4230803CUL)))
#define bM4_TMR62_PERAR_PERA0 (*((volatile unsigned int *)(0x42308080UL)))
#define bM4_TMR62_PERAR_PERA1 (*((volatile unsigned int *)(0x42308084UL)))
#define bM4_TMR62_PERAR_PERA2 (*((volatile unsigned int *)(0x42308088UL)))
#define bM4_TMR62_PERAR_PERA3 (*((volatile unsigned int *)(0x4230808CUL)))
#define bM4_TMR62_PERAR_PERA4 (*((volatile unsigned int *)(0x42308090UL)))
#define bM4_TMR62_PERAR_PERA5 (*((volatile unsigned int *)(0x42308094UL)))
#define bM4_TMR62_PERAR_PERA6 (*((volatile unsigned int *)(0x42308098UL)))
#define bM4_TMR62_PERAR_PERA7 (*((volatile unsigned int *)(0x4230809CUL)))
#define bM4_TMR62_PERAR_PERA8 (*((volatile unsigned int *)(0x423080A0UL)))
#define bM4_TMR62_PERAR_PERA9 (*((volatile unsigned int *)(0x423080A4UL)))
#define bM4_TMR62_PERAR_PERA10 (*((volatile unsigned int *)(0x423080A8UL)))
#define bM4_TMR62_PERAR_PERA11 (*((volatile unsigned int *)(0x423080ACUL)))
#define bM4_TMR62_PERAR_PERA12 (*((volatile unsigned int *)(0x423080B0UL)))
#define bM4_TMR62_PERAR_PERA13 (*((volatile unsigned int *)(0x423080B4UL)))
#define bM4_TMR62_PERAR_PERA14 (*((volatile unsigned int *)(0x423080B8UL)))
#define bM4_TMR62_PERAR_PERA15 (*((volatile unsigned int *)(0x423080BCUL)))
#define bM4_TMR62_PERBR_PERB0 (*((volatile unsigned int *)(0x42308100UL)))
#define bM4_TMR62_PERBR_PERB1 (*((volatile unsigned int *)(0x42308104UL)))
#define bM4_TMR62_PERBR_PERB2 (*((volatile unsigned int *)(0x42308108UL)))
#define bM4_TMR62_PERBR_PERB3 (*((volatile unsigned int *)(0x4230810CUL)))
#define bM4_TMR62_PERBR_PERB4 (*((volatile unsigned int *)(0x42308110UL)))
#define bM4_TMR62_PERBR_PERB5 (*((volatile unsigned int *)(0x42308114UL)))
#define bM4_TMR62_PERBR_PERB6 (*((volatile unsigned int *)(0x42308118UL)))
#define bM4_TMR62_PERBR_PERB7 (*((volatile unsigned int *)(0x4230811CUL)))
#define bM4_TMR62_PERBR_PERB8 (*((volatile unsigned int *)(0x42308120UL)))
#define bM4_TMR62_PERBR_PERB9 (*((volatile unsigned int *)(0x42308124UL)))
#define bM4_TMR62_PERBR_PERB10 (*((volatile unsigned int *)(0x42308128UL)))
#define bM4_TMR62_PERBR_PERB11 (*((volatile unsigned int *)(0x4230812CUL)))
#define bM4_TMR62_PERBR_PERB12 (*((volatile unsigned int *)(0x42308130UL)))
#define bM4_TMR62_PERBR_PERB13 (*((volatile unsigned int *)(0x42308134UL)))
#define bM4_TMR62_PERBR_PERB14 (*((volatile unsigned int *)(0x42308138UL)))
#define bM4_TMR62_PERBR_PERB15 (*((volatile unsigned int *)(0x4230813CUL)))
#define bM4_TMR62_PERCR_PERC0 (*((volatile unsigned int *)(0x42308180UL)))
#define bM4_TMR62_PERCR_PERC1 (*((volatile unsigned int *)(0x42308184UL)))
#define bM4_TMR62_PERCR_PERC2 (*((volatile unsigned int *)(0x42308188UL)))
#define bM4_TMR62_PERCR_PERC3 (*((volatile unsigned int *)(0x4230818CUL)))
#define bM4_TMR62_PERCR_PERC4 (*((volatile unsigned int *)(0x42308190UL)))
#define bM4_TMR62_PERCR_PERC5 (*((volatile unsigned int *)(0x42308194UL)))
#define bM4_TMR62_PERCR_PERC6 (*((volatile unsigned int *)(0x42308198UL)))
#define bM4_TMR62_PERCR_PERC7 (*((volatile unsigned int *)(0x4230819CUL)))
#define bM4_TMR62_PERCR_PERC8 (*((volatile unsigned int *)(0x423081A0UL)))
#define bM4_TMR62_PERCR_PERC9 (*((volatile unsigned int *)(0x423081A4UL)))
#define bM4_TMR62_PERCR_PERC10 (*((volatile unsigned int *)(0x423081A8UL)))
#define bM4_TMR62_PERCR_PERC11 (*((volatile unsigned int *)(0x423081ACUL)))
#define bM4_TMR62_PERCR_PERC12 (*((volatile unsigned int *)(0x423081B0UL)))
#define bM4_TMR62_PERCR_PERC13 (*((volatile unsigned int *)(0x423081B4UL)))
#define bM4_TMR62_PERCR_PERC14 (*((volatile unsigned int *)(0x423081B8UL)))
#define bM4_TMR62_PERCR_PERC15 (*((volatile unsigned int *)(0x423081BCUL)))
#define bM4_TMR62_GCMAR_GCMA0 (*((volatile unsigned int *)(0x42308200UL)))
#define bM4_TMR62_GCMAR_GCMA1 (*((volatile unsigned int *)(0x42308204UL)))
#define bM4_TMR62_GCMAR_GCMA2 (*((volatile unsigned int *)(0x42308208UL)))
#define bM4_TMR62_GCMAR_GCMA3 (*((volatile unsigned int *)(0x4230820CUL)))
#define bM4_TMR62_GCMAR_GCMA4 (*((volatile unsigned int *)(0x42308210UL)))
#define bM4_TMR62_GCMAR_GCMA5 (*((volatile unsigned int *)(0x42308214UL)))
#define bM4_TMR62_GCMAR_GCMA6 (*((volatile unsigned int *)(0x42308218UL)))
#define bM4_TMR62_GCMAR_GCMA7 (*((volatile unsigned int *)(0x4230821CUL)))
#define bM4_TMR62_GCMAR_GCMA8 (*((volatile unsigned int *)(0x42308220UL)))
#define bM4_TMR62_GCMAR_GCMA9 (*((volatile unsigned int *)(0x42308224UL)))
#define bM4_TMR62_GCMAR_GCMA10 (*((volatile unsigned int *)(0x42308228UL)))
#define bM4_TMR62_GCMAR_GCMA11 (*((volatile unsigned int *)(0x4230822CUL)))
#define bM4_TMR62_GCMAR_GCMA12 (*((volatile unsigned int *)(0x42308230UL)))
