MarlinFirmware/Marlin/Marlin/lib/h32_core/main/hdsc32core/common/hc32f46x.h
#define bM4_TMR62_FCONR_NOFICKGB1 (*((volatile unsigned int *)(0x42308D18UL)))
#define bM4_TMR62_FCONR_NOFIENTA (*((volatile unsigned int *)(0x42308D40UL)))
#define bM4_TMR62_FCONR_NOFICKTA0 (*((volatile unsigned int *)(0x42308D44UL)))
#define bM4_TMR62_FCONR_NOFICKTA1 (*((volatile unsigned int *)(0x42308D48UL)))
#define bM4_TMR62_FCONR_NOFIENTB (*((volatile unsigned int *)(0x42308D50UL)))
#define bM4_TMR62_FCONR_NOFICKTB0 (*((volatile unsigned int *)(0x42308D54UL)))
#define bM4_TMR62_FCONR_NOFICKTB1 (*((volatile unsigned int *)(0x42308D58UL)))
#define bM4_TMR62_VPERR_SPPERIA (*((volatile unsigned int *)(0x42308DA0UL)))
#define bM4_TMR62_VPERR_SPPERIB (*((volatile unsigned int *)(0x42308DA4UL)))
#define bM4_TMR62_VPERR_PCNTE0 (*((volatile unsigned int *)(0x42308DC0UL)))
#define bM4_TMR62_VPERR_PCNTE1 (*((volatile unsigned int *)(0x42308DC4UL)))
#define bM4_TMR62_VPERR_PCNTS0 (*((volatile unsigned int *)(0x42308DC8UL)))
#define bM4_TMR62_VPERR_PCNTS1 (*((volatile unsigned int *)(0x42308DCCUL)))
#define bM4_TMR62_VPERR_PCNTS2 (*((volatile unsigned int *)(0x42308DD0UL)))
#define bM4_TMR62_STFLR_CMAF (*((volatile unsigned int *)(0x42308E00UL)))
#define bM4_TMR62_STFLR_CMBF (*((volatile unsigned int *)(0x42308E04UL)))
#define bM4_TMR62_STFLR_CMCF (*((volatile unsigned int *)(0x42308E08UL)))
#define bM4_TMR62_STFLR_CMDF (*((volatile unsigned int *)(0x42308E0CUL)))
#define bM4_TMR62_STFLR_CMEF (*((volatile unsigned int *)(0x42308E10UL)))
#define bM4_TMR62_STFLR_CMFF (*((volatile unsigned int *)(0x42308E14UL)))
#define bM4_TMR62_STFLR_OVFF (*((volatile unsigned int *)(0x42308E18UL)))
#define bM4_TMR62_STFLR_UDFF (*((volatile unsigned int *)(0x42308E1CUL)))
#define bM4_TMR62_STFLR_DTEF (*((volatile unsigned int *)(0x42308E20UL)))
#define bM4_TMR62_STFLR_CMSAUF (*((volatile unsigned int *)(0x42308E24UL)))
#define bM4_TMR62_STFLR_CMSADF (*((volatile unsigned int *)(0x42308E28UL)))
#define bM4_TMR62_STFLR_CMSBUF (*((volatile unsigned int *)(0x42308E2CUL)))
#define bM4_TMR62_STFLR_CMSBDF (*((volatile unsigned int *)(0x42308E30UL)))
#define bM4_TMR62_STFLR_VPERNUM0 (*((volatile unsigned int *)(0x42308E54UL)))
#define bM4_TMR62_STFLR_VPERNUM1 (*((volatile unsigned int *)(0x42308E58UL)))
#define bM4_TMR62_STFLR_VPERNUM2 (*((volatile unsigned int *)(0x42308E5CUL)))
#define bM4_TMR62_STFLR_DIRF (*((volatile unsigned int *)(0x42308E7CUL)))
#define bM4_TMR62_HSTAR_HSTA0 (*((volatile unsigned int *)(0x42308E80UL)))
#define bM4_TMR62_HSTAR_HSTA1 (*((volatile unsigned int *)(0x42308E84UL)))
#define bM4_TMR62_HSTAR_HSTA4 (*((volatile unsigned int *)(0x42308E90UL)))
#define bM4_TMR62_HSTAR_HSTA5 (*((volatile unsigned int *)(0x42308E94UL)))
#define bM4_TMR62_HSTAR_HSTA6 (*((volatile unsigned int *)(0x42308E98UL)))
#define bM4_TMR62_HSTAR_HSTA7 (*((volatile unsigned int *)(0x42308E9CUL)))
#define bM4_TMR62_HSTAR_HSTA8 (*((volatile unsigned int *)(0x42308EA0UL)))
#define bM4_TMR62_HSTAR_HSTA9 (*((volatile unsigned int *)(0x42308EA4UL)))
#define bM4_TMR62_HSTAR_HSTA10 (*((volatile unsigned int *)(0x42308EA8UL)))
#define bM4_TMR62_HSTAR_HSTA11 (*((volatile unsigned int *)(0x42308EACUL)))
#define bM4_TMR62_HSTAR_STARTS (*((volatile unsigned int *)(0x42308EFCUL)))
#define bM4_TMR62_HSTPR_HSTP0 (*((volatile unsigned int *)(0x42308F00UL)))
#define bM4_TMR62_HSTPR_HSTP1 (*((volatile unsigned int *)(0x42308F04UL)))
#define bM4_TMR62_HSTPR_HSTP4 (*((volatile unsigned int *)(0x42308F10UL)))
#define bM4_TMR62_HSTPR_HSTP5 (*((volatile unsigned int *)(0x42308F14UL)))
#define bM4_TMR62_HSTPR_HSTP6 (*((volatile unsigned int *)(0x42308F18UL)))
#define bM4_TMR62_HSTPR_HSTP7 (*((volatile unsigned int *)(0x42308F1CUL)))
#define bM4_TMR62_HSTPR_HSTP8 (*((volatile unsigned int *)(0x42308F20UL)))
#define bM4_TMR62_HSTPR_HSTP9 (*((volatile unsigned int *)(0x42308F24UL)))
#define bM4_TMR62_HSTPR_HSTP10 (*((volatile unsigned int *)(0x42308F28UL)))
#define bM4_TMR62_HSTPR_HSTP11 (*((volatile unsigned int *)(0x42308F2CUL)))
#define bM4_TMR62_HSTPR_STOPS (*((volatile unsigned int *)(0x42308F7CUL)))
#define bM4_TMR62_HCLRR_HCLE0 (*((volatile unsigned int *)(0x42308F80UL)))
#define bM4_TMR62_HCLRR_HCLE1 (*((volatile unsigned int *)(0x42308F84UL)))
#define bM4_TMR62_HCLRR_HCLE4 (*((volatile unsigned int *)(0x42308F90UL)))
#define bM4_TMR62_HCLRR_HCLE5 (*((volatile unsigned int *)(0x42308F94UL)))
#define bM4_TMR62_HCLRR_HCLE6 (*((volatile unsigned int *)(0x42308F98UL)))
#define bM4_TMR62_HCLRR_HCLE7 (*((volatile unsigned int *)(0x42308F9CUL)))
#define bM4_TMR62_HCLRR_HCLE8 (*((volatile unsigned int *)(0x42308FA0UL)))
#define bM4_TMR62_HCLRR_HCLE9 (*((volatile unsigned int *)(0x42308FA4UL)))
#define bM4_TMR62_HCLRR_HCLE10 (*((volatile unsigned int *)(0x42308FA8UL)))
#define bM4_TMR62_HCLRR_HCLE11 (*((volatile unsigned int *)(0x42308FACUL)))
#define bM4_TMR62_HCLRR_CLEARS (*((volatile unsigned int *)(0x42308FFCUL)))
#define bM4_TMR62_HCPAR_HCPA0 (*((volatile unsigned int *)(0x42309000UL)))
#define bM4_TMR62_HCPAR_HCPA1 (*((volatile unsigned int *)(0x42309004UL)))
#define bM4_TMR62_HCPAR_HCPA4 (*((volatile unsigned int *)(0x42309010UL)))
#define bM4_TMR62_HCPAR_HCPA5 (*((volatile unsigned int *)(0x42309014UL)))
#define bM4_TMR62_HCPAR_HCPA6 (*((volatile unsigned int *)(0x42309018UL)))
#define bM4_TMR62_HCPAR_HCPA7 (*((volatile unsigned int *)(0x4230901CUL)))
#define bM4_TMR62_HCPAR_HCPA8 (*((volatile unsigned int *)(0x42309020UL)))
#define bM4_TMR62_HCPAR_HCPA9 (*((volatile unsigned int *)(0x42309024UL)))
#define bM4_TMR62_HCPAR_HCPA10 (*((volatile unsigned int *)(0x42309028UL)))
#define bM4_TMR62_HCPAR_HCPA11 (*((volatile unsigned int *)(0x4230902CUL)))
#define bM4_TMR62_HCPBR_HCPB0 (*((volatile unsigned int *)(0x42309080UL)))
#define bM4_TMR62_HCPBR_HCPB1 (*((volatile unsigned int *)(0x42309084UL)))
#define bM4_TMR62_HCPBR_HCPB4 (*((volatile unsigned int *)(0x42309090UL)))
#define bM4_TMR62_HCPBR_HCPB5 (*((volatile unsigned int *)(0x42309094UL)))
#define bM4_TMR62_HCPBR_HCPB6 (*((volatile unsigned int *)(0x42309098UL)))
#define bM4_TMR62_HCPBR_HCPB7 (*((volatile unsigned int *)(0x4230909CUL)))
#define bM4_TMR62_HCPBR_HCPB8 (*((volatile unsigned int *)(0x423090A0UL)))
#define bM4_TMR62_HCPBR_HCPB9 (*((volatile unsigned int *)(0x423090A4UL)))
#define bM4_TMR62_HCPBR_HCPB10 (*((volatile unsigned int *)(0x423090A8UL)))
#define bM4_TMR62_HCPBR_HCPB11 (*((volatile unsigned int *)(0x423090ACUL)))
#define bM4_TMR62_HCUPR_HCUP0 (*((volatile unsigned int *)(0x42309100UL)))
#define bM4_TMR62_HCUPR_HCUP1 (*((volatile unsigned int *)(0x42309104UL)))
#define bM4_TMR62_HCUPR_HCUP2 (*((volatile unsigned int *)(0x42309108UL)))
#define bM4_TMR62_HCUPR_HCUP3 (*((volatile unsigned int *)(0x4230910CUL)))
#define bM4_TMR62_HCUPR_HCUP4 (*((volatile unsigned int *)(0x42309110UL)))
#define bM4_TMR62_HCUPR_HCUP5 (*((volatile unsigned int *)(0x42309114UL)))
#define bM4_TMR62_HCUPR_HCUP6 (*((volatile unsigned int *)(0x42309118UL)))
#define bM4_TMR62_HCUPR_HCUP7 (*((volatile unsigned int *)(0x4230911CUL)))
#define bM4_TMR62_HCUPR_HCUP8 (*((volatile unsigned int *)(0x42309120UL)))
#define bM4_TMR62_HCUPR_HCUP9 (*((volatile unsigned int *)(0x42309124UL)))
#define bM4_TMR62_HCUPR_HCUP10 (*((volatile unsigned int *)(0x42309128UL)))
#define bM4_TMR62_HCUPR_HCUP11 (*((volatile unsigned int *)(0x4230912CUL)))
#define bM4_TMR62_HCUPR_HCUP16 (*((volatile unsigned int *)(0x42309140UL)))
#define bM4_TMR62_HCUPR_HCUP17 (*((volatile unsigned int *)(0x42309144UL)))
#define bM4_TMR62_HCDOR_HCDO0 (*((volatile unsigned int *)(0x42309180UL)))
#define bM4_TMR62_HCDOR_HCDO1 (*((volatile unsigned int *)(0x42309184UL)))
#define bM4_TMR62_HCDOR_HCDO2 (*((volatile unsigned int *)(0x42309188UL)))
#define bM4_TMR62_HCDOR_HCDO3 (*((volatile unsigned int *)(0x4230918CUL)))
#define bM4_TMR62_HCDOR_HCDO4 (*((volatile unsigned int *)(0x42309190UL)))
#define bM4_TMR62_HCDOR_HCDO5 (*((volatile unsigned int *)(0x42309194UL)))
#define bM4_TMR62_HCDOR_HCDO6 (*((volatile unsigned int *)(0x42309198UL)))
#define bM4_TMR62_HCDOR_HCDO7 (*((volatile unsigned int *)(0x4230919CUL)))
#define bM4_TMR62_HCDOR_HCDO8 (*((volatile unsigned int *)(0x423091A0UL)))
#define bM4_TMR62_HCDOR_HCDO9 (*((volatile unsigned int *)(0x423091A4UL)))
#define bM4_TMR62_HCDOR_HCDO10 (*((volatile unsigned int *)(0x423091A8UL)))
#define bM4_TMR62_HCDOR_HCDO11 (*((volatile unsigned int *)(0x423091ACUL)))
#define bM4_TMR62_HCDOR_HCDO16 (*((volatile unsigned int *)(0x423091C0UL)))
#define bM4_TMR62_HCDOR_HCDO17 (*((volatile unsigned int *)(0x423091C4UL)))
#define bM4_TMR63_CNTER_CNT0 (*((volatile unsigned int *)(0x42310000UL)))
#define bM4_TMR63_CNTER_CNT1 (*((volatile unsigned int *)(0x42310004UL)))
#define bM4_TMR63_CNTER_CNT2 (*((volatile unsigned int *)(0x42310008UL)))
#define bM4_TMR63_CNTER_CNT3 (*((volatile unsigned int *)(0x4231000CUL)))
#define bM4_TMR63_CNTER_CNT4 (*((volatile unsigned int *)(0x42310010UL)))
#define bM4_TMR63_CNTER_CNT5 (*((volatile unsigned int *)(0x42310014UL)))
#define bM4_TMR63_CNTER_CNT6 (*((volatile unsigned int *)(0x42310018UL)))
#define bM4_TMR63_CNTER_CNT7 (*((volatile unsigned int *)(0x4231001CUL)))
#define bM4_TMR63_CNTER_CNT8 (*((volatile unsigned int *)(0x42310020UL)))
#define bM4_TMR63_CNTER_CNT9 (*((volatile unsigned int *)(0x42310024UL)))
#define bM4_TMR63_CNTER_CNT10 (*((volatile unsigned int *)(0x42310028UL)))
#define bM4_TMR63_CNTER_CNT11 (*((volatile unsigned int *)(0x4231002CUL)))
#define bM4_TMR63_CNTER_CNT12 (*((volatile unsigned int *)(0x42310030UL)))
#define bM4_TMR63_CNTER_CNT13 (*((volatile unsigned int *)(0x42310034UL)))
#define bM4_TMR63_CNTER_CNT14 (*((volatile unsigned int *)(0x42310038UL)))
#define bM4_TMR63_CNTER_CNT15 (*((volatile unsigned int *)(0x4231003CUL)))
#define bM4_TMR63_PERAR_PERA0 (*((volatile unsigned int *)(0x42310080UL)))
#define bM4_TMR63_PERAR_PERA1 (*((volatile unsigned int *)(0x42310084UL)))
#define bM4_TMR63_PERAR_PERA2 (*((volatile unsigned int *)(0x42310088UL)))
#define bM4_TMR63_PERAR_PERA3 (*((volatile unsigned int *)(0x4231008CUL)))
#define bM4_TMR63_PERAR_PERA4 (*((volatile unsigned int *)(0x42310090UL)))
#define bM4_TMR63_PERAR_PERA5 (*((volatile unsigned int *)(0x42310094UL)))
#define bM4_TMR63_PERAR_PERA6 (*((volatile unsigned int *)(0x42310098UL)))
#define bM4_TMR63_PERAR_PERA7 (*((volatile unsigned int *)(0x4231009CUL)))
#define bM4_TMR63_PERAR_PERA8 (*((volatile unsigned int *)(0x423100A0UL)))
#define bM4_TMR63_PERAR_PERA9 (*((volatile unsigned int *)(0x423100A4UL)))
#define bM4_TMR63_PERAR_PERA10 (*((volatile unsigned int *)(0x423100A8UL)))
#define bM4_TMR63_PERAR_PERA11 (*((volatile unsigned int *)(0x423100ACUL)))
#define bM4_TMR63_PERAR_PERA12 (*((volatile unsigned int *)(0x423100B0UL)))
#define bM4_TMR63_PERAR_PERA13 (*((volatile unsigned int *)(0x423100B4UL)))
#define bM4_TMR63_PERAR_PERA14 (*((volatile unsigned int *)(0x423100B8UL)))
#define bM4_TMR63_PERAR_PERA15 (*((volatile unsigned int *)(0x423100BCUL)))
#define bM4_TMR63_PERBR_PERB0 (*((volatile unsigned int *)(0x42310100UL)))
#define bM4_TMR63_PERBR_PERB1 (*((volatile unsigned int *)(0x42310104UL)))
#define bM4_TMR63_PERBR_PERB2 (*((volatile unsigned int *)(0x42310108UL)))
#define bM4_TMR63_PERBR_PERB3 (*((volatile unsigned int *)(0x4231010CUL)))
#define bM4_TMR63_PERBR_PERB4 (*((volatile unsigned int *)(0x42310110UL)))
#define bM4_TMR63_PERBR_PERB5 (*((volatile unsigned int *)(0x42310114UL)))
#define bM4_TMR63_PERBR_PERB6 (*((volatile unsigned int *)(0x42310118UL)))
#define bM4_TMR63_PERBR_PERB7 (*((volatile unsigned int *)(0x4231011CUL)))
#define bM4_TMR63_PERBR_PERB8 (*((volatile unsigned int *)(0x42310120UL)))
#define bM4_TMR63_PERBR_PERB9 (*((volatile unsigned int *)(0x42310124UL)))
#define bM4_TMR63_PERBR_PERB10 (*((volatile unsigned int *)(0x42310128UL)))
#define bM4_TMR63_PERBR_PERB11 (*((volatile unsigned int *)(0x4231012CUL)))
#define bM4_TMR63_PERBR_PERB12 (*((volatile unsigned int *)(0x42310130UL)))
#define bM4_TMR63_PERBR_PERB13 (*((volatile unsigned int *)(0x42310134UL)))
#define bM4_TMR63_PERBR_PERB14 (*((volatile unsigned int *)(0x42310138UL)))
#define bM4_TMR63_PERBR_PERB15 (*((volatile unsigned int *)(0x4231013CUL)))
#define bM4_TMR63_PERCR_PERC0 (*((volatile unsigned int *)(0x42310180UL)))
#define bM4_TMR63_PERCR_PERC1 (*((volatile unsigned int *)(0x42310184UL)))
#define bM4_TMR63_PERCR_PERC2 (*((volatile unsigned int *)(0x42310188UL)))
#define bM4_TMR63_PERCR_PERC3 (*((volatile unsigned int *)(0x4231018CUL)))
#define bM4_TMR63_PERCR_PERC4 (*((volatile unsigned int *)(0x42310190UL)))
#define bM4_TMR63_PERCR_PERC5 (*((volatile unsigned int *)(0x42310194UL)))
#define bM4_TMR63_PERCR_PERC6 (*((volatile unsigned int *)(0x42310198UL)))
#define bM4_TMR63_PERCR_PERC7 (*((volatile unsigned int *)(0x4231019CUL)))
#define bM4_TMR63_PERCR_PERC8 (*((volatile unsigned int *)(0x423101A0UL)))
#define bM4_TMR63_PERCR_PERC9 (*((volatile unsigned int *)(0x423101A4UL)))
#define bM4_TMR63_PERCR_PERC10 (*((volatile unsigned int *)(0x423101A8UL)))
#define bM4_TMR63_PERCR_PERC11 (*((volatile unsigned int *)(0x423101ACUL)))
#define bM4_TMR63_PERCR_PERC12 (*((volatile unsigned int *)(0x423101B0UL)))
#define bM4_TMR63_PERCR_PERC13 (*((volatile unsigned int *)(0x423101B4UL)))
#define bM4_TMR63_PERCR_PERC14 (*((volatile unsigned int *)(0x423101B8UL)))
#define bM4_TMR63_PERCR_PERC15 (*((volatile unsigned int *)(0x423101BCUL)))
#define bM4_TMR63_GCMAR_GCMA0 (*((volatile unsigned int *)(0x42310200UL)))
#define bM4_TMR63_GCMAR_GCMA1 (*((volatile unsigned int *)(0x42310204UL)))
#define bM4_TMR63_GCMAR_GCMA2 (*((volatile unsigned int *)(0x42310208UL)))
#define bM4_TMR63_GCMAR_GCMA3 (*((volatile unsigned int *)(0x4231020CUL)))
#define bM4_TMR63_GCMAR_GCMA4 (*((volatile unsigned int *)(0x42310210UL)))
#define bM4_TMR63_GCMAR_GCMA5 (*((volatile unsigned int *)(0x42310214UL)))
#define bM4_TMR63_GCMAR_GCMA6 (*((volatile unsigned int *)(0x42310218UL)))
#define bM4_TMR63_GCMAR_GCMA7 (*((volatile unsigned int *)(0x4231021CUL)))
#define bM4_TMR63_GCMAR_GCMA8 (*((volatile unsigned int *)(0x42310220UL)))
#define bM4_TMR63_GCMAR_GCMA9 (*((volatile unsigned int *)(0x42310224UL)))
#define bM4_TMR63_GCMAR_GCMA10 (*((volatile unsigned int *)(0x42310228UL)))
#define bM4_TMR63_GCMAR_GCMA11 (*((volatile unsigned int *)(0x4231022CUL)))
#define bM4_TMR63_GCMAR_GCMA12 (*((volatile unsigned int *)(0x42310230UL)))
#define bM4_TMR63_GCMAR_GCMA13 (*((volatile unsigned int *)(0x42310234UL)))
#define bM4_TMR63_GCMAR_GCMA14 (*((volatile unsigned int *)(0x42310238UL)))
#define bM4_TMR63_GCMAR_GCMA15 (*((volatile unsigned int *)(0x4231023CUL)))
#define bM4_TMR63_GCMBR_GCMB0 (*((volatile unsigned int *)(0x42310280UL)))
#define bM4_TMR63_GCMBR_GCMB1 (*((volatile unsigned int *)(0x42310284UL)))
#define bM4_TMR63_GCMBR_GCMB2 (*((volatile unsigned int *)(0x42310288UL)))
#define bM4_TMR63_GCMBR_GCMB3 (*((volatile unsigned int *)(0x4231028CUL)))
#define bM4_TMR63_GCMBR_GCMB4 (*((volatile unsigned int *)(0x42310290UL)))
#define bM4_TMR63_GCMBR_GCMB5 (*((volatile unsigned int *)(0x42310294UL)))
#define bM4_TMR63_GCMBR_GCMB6 (*((volatile unsigned int *)(0x42310298UL)))
#define bM4_TMR63_GCMBR_GCMB7 (*((volatile unsigned int *)(0x4231029CUL)))
#define bM4_TMR63_GCMBR_GCMB8 (*((volatile unsigned int *)(0x423102A0UL)))
#define bM4_TMR63_GCMBR_GCMB9 (*((volatile unsigned int *)(0x423102A4UL)))
#define bM4_TMR63_GCMBR_GCMB10 (*((volatile unsigned int *)(0x423102A8UL)))
#define bM4_TMR63_GCMBR_GCMB11 (*((volatile unsigned int *)(0x423102ACUL)))
#define bM4_TMR63_GCMBR_GCMB12 (*((volatile unsigned int *)(0x423102B0UL)))
#define bM4_TMR63_GCMBR_GCMB13 (*((volatile unsigned int *)(0x423102B4UL)))
#define bM4_TMR63_GCMBR_GCMB14 (*((volatile unsigned int *)(0x423102B8UL)))
#define bM4_TMR63_GCMBR_GCMB15 (*((volatile unsigned int *)(0x423102BCUL)))
#define bM4_TMR63_GCMCR_GCMC0 (*((volatile unsigned int *)(0x42310300UL)))
#define bM4_TMR63_GCMCR_GCMC1 (*((volatile unsigned int *)(0x42310304UL)))
#define bM4_TMR63_GCMCR_GCMC2 (*((volatile unsigned int *)(0x42310308UL)))
#define bM4_TMR63_GCMCR_GCMC3 (*((volatile unsigned int *)(0x4231030CUL)))
#define bM4_TMR63_GCMCR_GCMC4 (*((volatile unsigned int *)(0x42310310UL)))
#define bM4_TMR63_GCMCR_GCMC5 (*((volatile unsigned int *)(0x42310314UL)))
#define bM4_TMR63_GCMCR_GCMC6 (*((volatile unsigned int *)(0x42310318UL)))
#define bM4_TMR63_GCMCR_GCMC7 (*((volatile unsigned int *)(0x4231031CUL)))
#define bM4_TMR63_GCMCR_GCMC8 (*((volatile unsigned int *)(0x42310320UL)))
#define bM4_TMR63_GCMCR_GCMC9 (*((volatile unsigned int *)(0x42310324UL)))
#define bM4_TMR63_GCMCR_GCMC10 (*((volatile unsigned int *)(0x42310328UL)))
#define bM4_TMR63_GCMCR_GCMC11 (*((volatile unsigned int *)(0x4231032CUL)))
#define bM4_TMR63_GCMCR_GCMC12 (*((volatile unsigned int *)(0x42310330UL)))
#define bM4_TMR63_GCMCR_GCMC13 (*((volatile unsigned int *)(0x42310334UL)))
#define bM4_TMR63_GCMCR_GCMC14 (*((volatile unsigned int *)(0x42310338UL)))
#define bM4_TMR63_GCMCR_GCMC15 (*((volatile unsigned int *)(0x4231033CUL)))
#define bM4_TMR63_GCMDR_GCMD0 (*((volatile unsigned int *)(0x42310380UL)))
#define bM4_TMR63_GCMDR_GCMD1 (*((volatile unsigned int *)(0x42310384UL)))
#define bM4_TMR63_GCMDR_GCMD2 (*((volatile unsigned int *)(0x42310388UL)))
#define bM4_TMR63_GCMDR_GCMD3 (*((volatile unsigned int *)(0x4231038CUL)))
#define bM4_TMR63_GCMDR_GCMD4 (*((volatile unsigned int *)(0x42310390UL)))
#define bM4_TMR63_GCMDR_GCMD5 (*((volatile unsigned int *)(0x42310394UL)))
#define bM4_TMR63_GCMDR_GCMD6 (*((volatile unsigned int *)(0x42310398UL)))
#define bM4_TMR63_GCMDR_GCMD7 (*((volatile unsigned int *)(0x4231039CUL)))
#define bM4_TMR63_GCMDR_GCMD8 (*((volatile unsigned int *)(0x423103A0UL)))
#define bM4_TMR63_GCMDR_GCMD9 (*((volatile unsigned int *)(0x423103A4UL)))
#define bM4_TMR63_GCMDR_GCMD10 (*((volatile unsigned int *)(0x423103A8UL)))
#define bM4_TMR63_GCMDR_GCMD11 (*((volatile unsigned int *)(0x423103ACUL)))
#define bM4_TMR63_GCMDR_GCMD12 (*((volatile unsigned int *)(0x423103B0UL)))
#define bM4_TMR63_GCMDR_GCMD13 (*((volatile unsigned int *)(0x423103B4UL)))
#define bM4_TMR63_GCMDR_GCMD14 (*((volatile unsigned int *)(0x423103B8UL)))
#define bM4_TMR63_GCMDR_GCMD15 (*((volatile unsigned int *)(0x423103BCUL)))
#define bM4_TMR63_GCMER_GCME0 (*((volatile unsigned int *)(0x42310400UL)))
#define bM4_TMR63_GCMER_GCME1 (*((volatile unsigned int *)(0x42310404UL)))
#define bM4_TMR63_GCMER_GCME2 (*((volatile unsigned int *)(0x42310408UL)))
#define bM4_TMR63_GCMER_GCME3 (*((volatile unsigned int *)(0x4231040CUL)))
#define bM4_TMR63_GCMER_GCME4 (*((volatile unsigned int *)(0x42310410UL)))
#define bM4_TMR63_GCMER_GCME5 (*((volatile unsigned int *)(0x42310414UL)))
#define bM4_TMR63_GCMER_GCME6 (*((volatile unsigned int *)(0x42310418UL)))
#define bM4_TMR63_GCMER_GCME7 (*((volatile unsigned int *)(0x4231041CUL)))
#define bM4_TMR63_GCMER_GCME8 (*((volatile unsigned int *)(0x42310420UL)))
#define bM4_TMR63_GCMER_GCME9 (*((volatile unsigned int *)(0x42310424UL)))
#define bM4_TMR63_GCMER_GCME10 (*((volatile unsigned int *)(0x42310428UL)))
#define bM4_TMR63_GCMER_GCME11 (*((volatile unsigned int *)(0x4231042CUL)))
#define bM4_TMR63_GCMER_GCME12 (*((volatile unsigned int *)(0x42310430UL)))
#define bM4_TMR63_GCMER_GCME13 (*((volatile unsigned int *)(0x42310434UL)))
#define bM4_TMR63_GCMER_GCME14 (*((volatile unsigned int *)(0x42310438UL)))
#define bM4_TMR63_GCMER_GCME15 (*((volatile unsigned int *)(0x4231043CUL)))
#define bM4_TMR63_GCMFR_GCMF0 (*((volatile unsigned int *)(0x42310480UL)))
#define bM4_TMR63_GCMFR_GCMF1 (*((volatile unsigned int *)(0x42310484UL)))
#define bM4_TMR63_GCMFR_GCMF2 (*((volatile unsigned int *)(0x42310488UL)))
#define bM4_TMR63_GCMFR_GCMF3 (*((volatile unsigned int *)(0x4231048CUL)))
#define bM4_TMR63_GCMFR_GCMF4 (*((volatile unsigned int *)(0x42310490UL)))
#define bM4_TMR63_GCMFR_GCMF5 (*((volatile unsigned int *)(0x42310494UL)))
#define bM4_TMR63_GCMFR_GCMF6 (*((volatile unsigned int *)(0x42310498UL)))
#define bM4_TMR63_GCMFR_GCMF7 (*((volatile unsigned int *)(0x4231049CUL)))
#define bM4_TMR63_GCMFR_GCMF8 (*((volatile unsigned int *)(0x423104A0UL)))
#define bM4_TMR63_GCMFR_GCMF9 (*((volatile unsigned int *)(0x423104A4UL)))
#define bM4_TMR63_GCMFR_GCMF10 (*((volatile unsigned int *)(0x423104A8UL)))
#define bM4_TMR63_GCMFR_GCMF11 (*((volatile unsigned int *)(0x423104ACUL)))
#define bM4_TMR63_GCMFR_GCMF12 (*((volatile unsigned int *)(0x423104B0UL)))
#define bM4_TMR63_GCMFR_GCMF13 (*((volatile unsigned int *)(0x423104B4UL)))
#define bM4_TMR63_GCMFR_GCMF14 (*((volatile unsigned int *)(0x423104B8UL)))
#define bM4_TMR63_GCMFR_GCMF15 (*((volatile unsigned int *)(0x423104BCUL)))
#define bM4_TMR63_SCMAR_SCMA0 (*((volatile unsigned int *)(0x42310500UL)))
#define bM4_TMR63_SCMAR_SCMA1 (*((volatile unsigned int *)(0x42310504UL)))
#define bM4_TMR63_SCMAR_SCMA2 (*((volatile unsigned int *)(0x42310508UL)))
#define bM4_TMR63_SCMAR_SCMA3 (*((volatile unsigned int *)(0x4231050CUL)))
#define bM4_TMR63_SCMAR_SCMA4 (*((volatile unsigned int *)(0x42310510UL)))
#define bM4_TMR63_SCMAR_SCMA5 (*((volatile unsigned int *)(0x42310514UL)))
#define bM4_TMR63_SCMAR_SCMA6 (*((volatile unsigned int *)(0x42310518UL)))
#define bM4_TMR63_SCMAR_SCMA7 (*((volatile unsigned int *)(0x4231051CUL)))
#define bM4_TMR63_SCMAR_SCMA8 (*((volatile unsigned int *)(0x42310520UL)))
#define bM4_TMR63_SCMAR_SCMA9 (*((volatile unsigned int *)(0x42310524UL)))
#define bM4_TMR63_SCMAR_SCMA10 (*((volatile unsigned int *)(0x42310528UL)))
#define bM4_TMR63_SCMAR_SCMA11 (*((volatile unsigned int *)(0x4231052CUL)))
#define bM4_TMR63_SCMAR_SCMA12 (*((volatile unsigned int *)(0x42310530UL)))
#define bM4_TMR63_SCMAR_SCMA13 (*((volatile unsigned int *)(0x42310534UL)))
#define bM4_TMR63_SCMAR_SCMA14 (*((volatile unsigned int *)(0x42310538UL)))
#define bM4_TMR63_SCMAR_SCMA15 (*((volatile unsigned int *)(0x4231053CUL)))
#define bM4_TMR63_SCMBR_SCMB0 (*((volatile unsigned int *)(0x42310580UL)))
#define bM4_TMR63_SCMBR_SCMB1 (*((volatile unsigned int *)(0x42310584UL)))
#define bM4_TMR63_SCMBR_SCMB2 (*((volatile unsigned int *)(0x42310588UL)))
#define bM4_TMR63_SCMBR_SCMB3 (*((volatile unsigned int *)(0x4231058CUL)))
#define bM4_TMR63_SCMBR_SCMB4 (*((volatile unsigned int *)(0x42310590UL)))
#define bM4_TMR63_SCMBR_SCMB5 (*((volatile unsigned int *)(0x42310594UL)))
#define bM4_TMR63_SCMBR_SCMB6 (*((volatile unsigned int *)(0x42310598UL)))
#define bM4_TMR63_SCMBR_SCMB7 (*((volatile unsigned int *)(0x4231059CUL)))
#define bM4_TMR63_SCMBR_SCMB8 (*((volatile unsigned int *)(0x423105A0UL)))
#define bM4_TMR63_SCMBR_SCMB9 (*((volatile unsigned int *)(0x423105A4UL)))
#define bM4_TMR63_SCMBR_SCMB10 (*((volatile unsigned int *)(0x423105A8UL)))
#define bM4_TMR63_SCMBR_SCMB11 (*((volatile unsigned int *)(0x423105ACUL)))
#define bM4_TMR63_SCMBR_SCMB12 (*((volatile unsigned int *)(0x423105B0UL)))
#define bM4_TMR63_SCMBR_SCMB13 (*((volatile unsigned int *)(0x423105B4UL)))
#define bM4_TMR63_SCMBR_SCMB14 (*((volatile unsigned int *)(0x423105B8UL)))
#define bM4_TMR63_SCMBR_SCMB15 (*((volatile unsigned int *)(0x423105BCUL)))
#define bM4_TMR63_SCMCR_SCMC0 (*((volatile unsigned int *)(0x42310600UL)))
#define bM4_TMR63_SCMCR_SCMC1 (*((volatile unsigned int *)(0x42310604UL)))
#define bM4_TMR63_SCMCR_SCMC2 (*((volatile unsigned int *)(0x42310608UL)))
#define bM4_TMR63_SCMCR_SCMC3 (*((volatile unsigned int *)(0x4231060CUL)))
#define bM4_TMR63_SCMCR_SCMC4 (*((volatile unsigned int *)(0x42310610UL)))
#define bM4_TMR63_SCMCR_SCMC5 (*((volatile unsigned int *)(0x42310614UL)))
#define bM4_TMR63_SCMCR_SCMC6 (*((volatile unsigned int *)(0x42310618UL)))
#define bM4_TMR63_SCMCR_SCMC7 (*((volatile unsigned int *)(0x4231061CUL)))
#define bM4_TMR63_SCMCR_SCMC8 (*((volatile unsigned int *)(0x42310620UL)))
#define bM4_TMR63_SCMCR_SCMC9 (*((volatile unsigned int *)(0x42310624UL)))
#define bM4_TMR63_SCMCR_SCMC10 (*((volatile unsigned int *)(0x42310628UL)))
#define bM4_TMR63_SCMCR_SCMC11 (*((volatile unsigned int *)(0x4231062CUL)))
#define bM4_TMR63_SCMCR_SCMC12 (*((volatile unsigned int *)(0x42310630UL)))
#define bM4_TMR63_SCMCR_SCMC13 (*((volatile unsigned int *)(0x42310634UL)))
