MarlinFirmware/Marlin/Marlin/lib/h32_core/main/hdsc32core/common/hc32f46x.h
#define bM4_TMR63_SCMCR_SCMC14 (*((volatile unsigned int *)(0x42310638UL)))
#define bM4_TMR63_SCMCR_SCMC15 (*((volatile unsigned int *)(0x4231063CUL)))
#define bM4_TMR63_SCMDR_SCMD0 (*((volatile unsigned int *)(0x42310680UL)))
#define bM4_TMR63_SCMDR_SCMD1 (*((volatile unsigned int *)(0x42310684UL)))
#define bM4_TMR63_SCMDR_SCMD2 (*((volatile unsigned int *)(0x42310688UL)))
#define bM4_TMR63_SCMDR_SCMD3 (*((volatile unsigned int *)(0x4231068CUL)))
#define bM4_TMR63_SCMDR_SCMD4 (*((volatile unsigned int *)(0x42310690UL)))
#define bM4_TMR63_SCMDR_SCMD5 (*((volatile unsigned int *)(0x42310694UL)))
#define bM4_TMR63_SCMDR_SCMD6 (*((volatile unsigned int *)(0x42310698UL)))
#define bM4_TMR63_SCMDR_SCMD7 (*((volatile unsigned int *)(0x4231069CUL)))
#define bM4_TMR63_SCMDR_SCMD8 (*((volatile unsigned int *)(0x423106A0UL)))
#define bM4_TMR63_SCMDR_SCMD9 (*((volatile unsigned int *)(0x423106A4UL)))
#define bM4_TMR63_SCMDR_SCMD10 (*((volatile unsigned int *)(0x423106A8UL)))
#define bM4_TMR63_SCMDR_SCMD11 (*((volatile unsigned int *)(0x423106ACUL)))
#define bM4_TMR63_SCMDR_SCMD12 (*((volatile unsigned int *)(0x423106B0UL)))
#define bM4_TMR63_SCMDR_SCMD13 (*((volatile unsigned int *)(0x423106B4UL)))
#define bM4_TMR63_SCMDR_SCMD14 (*((volatile unsigned int *)(0x423106B8UL)))
#define bM4_TMR63_SCMDR_SCMD15 (*((volatile unsigned int *)(0x423106BCUL)))
#define bM4_TMR63_SCMER_SCME0 (*((volatile unsigned int *)(0x42310700UL)))
#define bM4_TMR63_SCMER_SCME1 (*((volatile unsigned int *)(0x42310704UL)))
#define bM4_TMR63_SCMER_SCME2 (*((volatile unsigned int *)(0x42310708UL)))
#define bM4_TMR63_SCMER_SCME3 (*((volatile unsigned int *)(0x4231070CUL)))
#define bM4_TMR63_SCMER_SCME4 (*((volatile unsigned int *)(0x42310710UL)))
#define bM4_TMR63_SCMER_SCME5 (*((volatile unsigned int *)(0x42310714UL)))
#define bM4_TMR63_SCMER_SCME6 (*((volatile unsigned int *)(0x42310718UL)))
#define bM4_TMR63_SCMER_SCME7 (*((volatile unsigned int *)(0x4231071CUL)))
#define bM4_TMR63_SCMER_SCME8 (*((volatile unsigned int *)(0x42310720UL)))
#define bM4_TMR63_SCMER_SCME9 (*((volatile unsigned int *)(0x42310724UL)))
#define bM4_TMR63_SCMER_SCME10 (*((volatile unsigned int *)(0x42310728UL)))
#define bM4_TMR63_SCMER_SCME11 (*((volatile unsigned int *)(0x4231072CUL)))
#define bM4_TMR63_SCMER_SCME12 (*((volatile unsigned int *)(0x42310730UL)))
#define bM4_TMR63_SCMER_SCME13 (*((volatile unsigned int *)(0x42310734UL)))
#define bM4_TMR63_SCMER_SCME14 (*((volatile unsigned int *)(0x42310738UL)))
#define bM4_TMR63_SCMER_SCME15 (*((volatile unsigned int *)(0x4231073CUL)))
#define bM4_TMR63_SCMFR_SCMF0 (*((volatile unsigned int *)(0x42310780UL)))
#define bM4_TMR63_SCMFR_SCMF1 (*((volatile unsigned int *)(0x42310784UL)))
#define bM4_TMR63_SCMFR_SCMF2 (*((volatile unsigned int *)(0x42310788UL)))
#define bM4_TMR63_SCMFR_SCMF3 (*((volatile unsigned int *)(0x4231078CUL)))
#define bM4_TMR63_SCMFR_SCMF4 (*((volatile unsigned int *)(0x42310790UL)))
#define bM4_TMR63_SCMFR_SCMF5 (*((volatile unsigned int *)(0x42310794UL)))
#define bM4_TMR63_SCMFR_SCMF6 (*((volatile unsigned int *)(0x42310798UL)))
#define bM4_TMR63_SCMFR_SCMF7 (*((volatile unsigned int *)(0x4231079CUL)))
#define bM4_TMR63_SCMFR_SCMF8 (*((volatile unsigned int *)(0x423107A0UL)))
#define bM4_TMR63_SCMFR_SCMF9 (*((volatile unsigned int *)(0x423107A4UL)))
#define bM4_TMR63_SCMFR_SCMF10 (*((volatile unsigned int *)(0x423107A8UL)))
#define bM4_TMR63_SCMFR_SCMF11 (*((volatile unsigned int *)(0x423107ACUL)))
#define bM4_TMR63_SCMFR_SCMF12 (*((volatile unsigned int *)(0x423107B0UL)))
#define bM4_TMR63_SCMFR_SCMF13 (*((volatile unsigned int *)(0x423107B4UL)))
#define bM4_TMR63_SCMFR_SCMF14 (*((volatile unsigned int *)(0x423107B8UL)))
#define bM4_TMR63_SCMFR_SCMF15 (*((volatile unsigned int *)(0x423107BCUL)))
#define bM4_TMR63_DTUAR_DTUA0 (*((volatile unsigned int *)(0x42310800UL)))
#define bM4_TMR63_DTUAR_DTUA1 (*((volatile unsigned int *)(0x42310804UL)))
#define bM4_TMR63_DTUAR_DTUA2 (*((volatile unsigned int *)(0x42310808UL)))
#define bM4_TMR63_DTUAR_DTUA3 (*((volatile unsigned int *)(0x4231080CUL)))
#define bM4_TMR63_DTUAR_DTUA4 (*((volatile unsigned int *)(0x42310810UL)))
#define bM4_TMR63_DTUAR_DTUA5 (*((volatile unsigned int *)(0x42310814UL)))
#define bM4_TMR63_DTUAR_DTUA6 (*((volatile unsigned int *)(0x42310818UL)))
#define bM4_TMR63_DTUAR_DTUA7 (*((volatile unsigned int *)(0x4231081CUL)))
#define bM4_TMR63_DTUAR_DTUA8 (*((volatile unsigned int *)(0x42310820UL)))
#define bM4_TMR63_DTUAR_DTUA9 (*((volatile unsigned int *)(0x42310824UL)))
#define bM4_TMR63_DTUAR_DTUA10 (*((volatile unsigned int *)(0x42310828UL)))
#define bM4_TMR63_DTUAR_DTUA11 (*((volatile unsigned int *)(0x4231082CUL)))
#define bM4_TMR63_DTUAR_DTUA12 (*((volatile unsigned int *)(0x42310830UL)))
#define bM4_TMR63_DTUAR_DTUA13 (*((volatile unsigned int *)(0x42310834UL)))
#define bM4_TMR63_DTUAR_DTUA14 (*((volatile unsigned int *)(0x42310838UL)))
#define bM4_TMR63_DTUAR_DTUA15 (*((volatile unsigned int *)(0x4231083CUL)))
#define bM4_TMR63_DTDAR_DTDA0 (*((volatile unsigned int *)(0x42310880UL)))
#define bM4_TMR63_DTDAR_DTDA1 (*((volatile unsigned int *)(0x42310884UL)))
#define bM4_TMR63_DTDAR_DTDA2 (*((volatile unsigned int *)(0x42310888UL)))
#define bM4_TMR63_DTDAR_DTDA3 (*((volatile unsigned int *)(0x4231088CUL)))
#define bM4_TMR63_DTDAR_DTDA4 (*((volatile unsigned int *)(0x42310890UL)))
#define bM4_TMR63_DTDAR_DTDA5 (*((volatile unsigned int *)(0x42310894UL)))
#define bM4_TMR63_DTDAR_DTDA6 (*((volatile unsigned int *)(0x42310898UL)))
#define bM4_TMR63_DTDAR_DTDA7 (*((volatile unsigned int *)(0x4231089CUL)))
#define bM4_TMR63_DTDAR_DTDA8 (*((volatile unsigned int *)(0x423108A0UL)))
#define bM4_TMR63_DTDAR_DTDA9 (*((volatile unsigned int *)(0x423108A4UL)))
#define bM4_TMR63_DTDAR_DTDA10 (*((volatile unsigned int *)(0x423108A8UL)))
#define bM4_TMR63_DTDAR_DTDA11 (*((volatile unsigned int *)(0x423108ACUL)))
#define bM4_TMR63_DTDAR_DTDA12 (*((volatile unsigned int *)(0x423108B0UL)))
#define bM4_TMR63_DTDAR_DTDA13 (*((volatile unsigned int *)(0x423108B4UL)))
#define bM4_TMR63_DTDAR_DTDA14 (*((volatile unsigned int *)(0x423108B8UL)))
#define bM4_TMR63_DTDAR_DTDA15 (*((volatile unsigned int *)(0x423108BCUL)))
#define bM4_TMR63_DTUBR_DTUB0 (*((volatile unsigned int *)(0x42310900UL)))
#define bM4_TMR63_DTUBR_DTUB1 (*((volatile unsigned int *)(0x42310904UL)))
#define bM4_TMR63_DTUBR_DTUB2 (*((volatile unsigned int *)(0x42310908UL)))
#define bM4_TMR63_DTUBR_DTUB3 (*((volatile unsigned int *)(0x4231090CUL)))
#define bM4_TMR63_DTUBR_DTUB4 (*((volatile unsigned int *)(0x42310910UL)))
#define bM4_TMR63_DTUBR_DTUB5 (*((volatile unsigned int *)(0x42310914UL)))
#define bM4_TMR63_DTUBR_DTUB6 (*((volatile unsigned int *)(0x42310918UL)))
#define bM4_TMR63_DTUBR_DTUB7 (*((volatile unsigned int *)(0x4231091CUL)))
#define bM4_TMR63_DTUBR_DTUB8 (*((volatile unsigned int *)(0x42310920UL)))
#define bM4_TMR63_DTUBR_DTUB9 (*((volatile unsigned int *)(0x42310924UL)))
#define bM4_TMR63_DTUBR_DTUB10 (*((volatile unsigned int *)(0x42310928UL)))
#define bM4_TMR63_DTUBR_DTUB11 (*((volatile unsigned int *)(0x4231092CUL)))
#define bM4_TMR63_DTUBR_DTUB12 (*((volatile unsigned int *)(0x42310930UL)))
#define bM4_TMR63_DTUBR_DTUB13 (*((volatile unsigned int *)(0x42310934UL)))
#define bM4_TMR63_DTUBR_DTUB14 (*((volatile unsigned int *)(0x42310938UL)))
#define bM4_TMR63_DTUBR_DTUB15 (*((volatile unsigned int *)(0x4231093CUL)))
#define bM4_TMR63_DTDBR_DTDB0 (*((volatile unsigned int *)(0x42310980UL)))
#define bM4_TMR63_DTDBR_DTDB1 (*((volatile unsigned int *)(0x42310984UL)))
#define bM4_TMR63_DTDBR_DTDB2 (*((volatile unsigned int *)(0x42310988UL)))
#define bM4_TMR63_DTDBR_DTDB3 (*((volatile unsigned int *)(0x4231098CUL)))
#define bM4_TMR63_DTDBR_DTDB4 (*((volatile unsigned int *)(0x42310990UL)))
#define bM4_TMR63_DTDBR_DTDB5 (*((volatile unsigned int *)(0x42310994UL)))
#define bM4_TMR63_DTDBR_DTDB6 (*((volatile unsigned int *)(0x42310998UL)))
#define bM4_TMR63_DTDBR_DTDB7 (*((volatile unsigned int *)(0x4231099CUL)))
#define bM4_TMR63_DTDBR_DTDB8 (*((volatile unsigned int *)(0x423109A0UL)))
#define bM4_TMR63_DTDBR_DTDB9 (*((volatile unsigned int *)(0x423109A4UL)))
#define bM4_TMR63_DTDBR_DTDB10 (*((volatile unsigned int *)(0x423109A8UL)))
#define bM4_TMR63_DTDBR_DTDB11 (*((volatile unsigned int *)(0x423109ACUL)))
#define bM4_TMR63_DTDBR_DTDB12 (*((volatile unsigned int *)(0x423109B0UL)))
#define bM4_TMR63_DTDBR_DTDB13 (*((volatile unsigned int *)(0x423109B4UL)))
#define bM4_TMR63_DTDBR_DTDB14 (*((volatile unsigned int *)(0x423109B8UL)))
#define bM4_TMR63_DTDBR_DTDB15 (*((volatile unsigned int *)(0x423109BCUL)))
#define bM4_TMR63_GCONR_START (*((volatile unsigned int *)(0x42310A00UL)))
#define bM4_TMR63_GCONR_MODE0 (*((volatile unsigned int *)(0x42310A04UL)))
#define bM4_TMR63_GCONR_MODE1 (*((volatile unsigned int *)(0x42310A08UL)))
#define bM4_TMR63_GCONR_MODE2 (*((volatile unsigned int *)(0x42310A0CUL)))
#define bM4_TMR63_GCONR_CKDIV0 (*((volatile unsigned int *)(0x42310A10UL)))
#define bM4_TMR63_GCONR_CKDIV1 (*((volatile unsigned int *)(0x42310A14UL)))
#define bM4_TMR63_GCONR_CKDIV2 (*((volatile unsigned int *)(0x42310A18UL)))
#define bM4_TMR63_GCONR_DIR (*((volatile unsigned int *)(0x42310A20UL)))
#define bM4_TMR63_GCONR_ZMSKREV (*((volatile unsigned int *)(0x42310A40UL)))
#define bM4_TMR63_GCONR_ZMSKPOS (*((volatile unsigned int *)(0x42310A44UL)))
#define bM4_TMR63_GCONR_ZMSKVAL0 (*((volatile unsigned int *)(0x42310A48UL)))
#define bM4_TMR63_GCONR_ZMSKVAL1 (*((volatile unsigned int *)(0x42310A4CUL)))
#define bM4_TMR63_ICONR_INTENA (*((volatile unsigned int *)(0x42310A80UL)))
#define bM4_TMR63_ICONR_INTENB (*((volatile unsigned int *)(0x42310A84UL)))
#define bM4_TMR63_ICONR_INTENC (*((volatile unsigned int *)(0x42310A88UL)))
#define bM4_TMR63_ICONR_INTEND (*((volatile unsigned int *)(0x42310A8CUL)))
#define bM4_TMR63_ICONR_INTENE (*((volatile unsigned int *)(0x42310A90UL)))
#define bM4_TMR63_ICONR_INTENF (*((volatile unsigned int *)(0x42310A94UL)))
#define bM4_TMR63_ICONR_INTENOVF (*((volatile unsigned int *)(0x42310A98UL)))
#define bM4_TMR63_ICONR_INTENUDF (*((volatile unsigned int *)(0x42310A9CUL)))
#define bM4_TMR63_ICONR_INTENDTE (*((volatile unsigned int *)(0x42310AA0UL)))
#define bM4_TMR63_ICONR_INTENSAU (*((volatile unsigned int *)(0x42310AC0UL)))
#define bM4_TMR63_ICONR_INTENSAD (*((volatile unsigned int *)(0x42310AC4UL)))
#define bM4_TMR63_ICONR_INTENSBU (*((volatile unsigned int *)(0x42310AC8UL)))
#define bM4_TMR63_ICONR_INTENSBD (*((volatile unsigned int *)(0x42310ACCUL)))
#define bM4_TMR63_PCONR_CAPMDA (*((volatile unsigned int *)(0x42310B00UL)))
#define bM4_TMR63_PCONR_STACA (*((volatile unsigned int *)(0x42310B04UL)))
#define bM4_TMR63_PCONR_STPCA (*((volatile unsigned int *)(0x42310B08UL)))
#define bM4_TMR63_PCONR_STASTPSA (*((volatile unsigned int *)(0x42310B0CUL)))
#define bM4_TMR63_PCONR_CMPCA0 (*((volatile unsigned int *)(0x42310B10UL)))
#define bM4_TMR63_PCONR_CMPCA1 (*((volatile unsigned int *)(0x42310B14UL)))
#define bM4_TMR63_PCONR_PERCA0 (*((volatile unsigned int *)(0x42310B18UL)))
#define bM4_TMR63_PCONR_PERCA1 (*((volatile unsigned int *)(0x42310B1CUL)))
#define bM4_TMR63_PCONR_OUTENA (*((volatile unsigned int *)(0x42310B20UL)))
#define bM4_TMR63_PCONR_EMBSELA0 (*((volatile unsigned int *)(0x42310B24UL)))
#define bM4_TMR63_PCONR_EMBSELA1 (*((volatile unsigned int *)(0x42310B28UL)))
#define bM4_TMR63_PCONR_EMBVALA0 (*((volatile unsigned int *)(0x42310B2CUL)))
#define bM4_TMR63_PCONR_EMBVALA1 (*((volatile unsigned int *)(0x42310B30UL)))
#define bM4_TMR63_PCONR_CAPMDB (*((volatile unsigned int *)(0x42310B40UL)))
#define bM4_TMR63_PCONR_STACB (*((volatile unsigned int *)(0x42310B44UL)))
#define bM4_TMR63_PCONR_STPCB (*((volatile unsigned int *)(0x42310B48UL)))
#define bM4_TMR63_PCONR_STASTPSB (*((volatile unsigned int *)(0x42310B4CUL)))
#define bM4_TMR63_PCONR_CMPCB0 (*((volatile unsigned int *)(0x42310B50UL)))
#define bM4_TMR63_PCONR_CMPCB1 (*((volatile unsigned int *)(0x42310B54UL)))
#define bM4_TMR63_PCONR_PERCB0 (*((volatile unsigned int *)(0x42310B58UL)))
#define bM4_TMR63_PCONR_PERCB1 (*((volatile unsigned int *)(0x42310B5CUL)))
#define bM4_TMR63_PCONR_OUTENB (*((volatile unsigned int *)(0x42310B60UL)))
#define bM4_TMR63_PCONR_EMBSELB0 (*((volatile unsigned int *)(0x42310B64UL)))
#define bM4_TMR63_PCONR_EMBSELB1 (*((volatile unsigned int *)(0x42310B68UL)))
#define bM4_TMR63_PCONR_EMBVALB0 (*((volatile unsigned int *)(0x42310B6CUL)))
#define bM4_TMR63_PCONR_EMBVALB1 (*((volatile unsigned int *)(0x42310B70UL)))
#define bM4_TMR63_BCONR_BENA (*((volatile unsigned int *)(0x42310B80UL)))
#define bM4_TMR63_BCONR_BSEA (*((volatile unsigned int *)(0x42310B84UL)))
#define bM4_TMR63_BCONR_BENB (*((volatile unsigned int *)(0x42310B88UL)))
#define bM4_TMR63_BCONR_BSEB (*((volatile unsigned int *)(0x42310B8CUL)))
#define bM4_TMR63_BCONR_BENP (*((volatile unsigned int *)(0x42310BA0UL)))
#define bM4_TMR63_BCONR_BSEP (*((volatile unsigned int *)(0x42310BA4UL)))
#define bM4_TMR63_BCONR_BENSPA (*((volatile unsigned int *)(0x42310BC0UL)))
#define bM4_TMR63_BCONR_BSESPA (*((volatile unsigned int *)(0x42310BC4UL)))
#define bM4_TMR63_BCONR_BTRSPA0 (*((volatile unsigned int *)(0x42310BD0UL)))
#define bM4_TMR63_BCONR_BTRSPA1 (*((volatile unsigned int *)(0x42310BD4UL)))
#define bM4_TMR63_BCONR_BENSPB (*((volatile unsigned int *)(0x42310BE0UL)))
#define bM4_TMR63_BCONR_BSESPB (*((volatile unsigned int *)(0x42310BE4UL)))
#define bM4_TMR63_BCONR_BTRSPB0 (*((volatile unsigned int *)(0x42310BF0UL)))
#define bM4_TMR63_BCONR_BTRSPB1 (*((volatile unsigned int *)(0x42310BF4UL)))
#define bM4_TMR63_DCONR_DTCEN (*((volatile unsigned int *)(0x42310C00UL)))
#define bM4_TMR63_DCONR_DTBENU (*((volatile unsigned int *)(0x42310C10UL)))
#define bM4_TMR63_DCONR_DTBEND (*((volatile unsigned int *)(0x42310C14UL)))
#define bM4_TMR63_DCONR_SEPA (*((volatile unsigned int *)(0x42310C20UL)))
#define bM4_TMR63_FCONR_NOFIENGA (*((volatile unsigned int *)(0x42310D00UL)))
#define bM4_TMR63_FCONR_NOFICKGA0 (*((volatile unsigned int *)(0x42310D04UL)))
#define bM4_TMR63_FCONR_NOFICKGA1 (*((volatile unsigned int *)(0x42310D08UL)))
#define bM4_TMR63_FCONR_NOFIENGB (*((volatile unsigned int *)(0x42310D10UL)))
#define bM4_TMR63_FCONR_NOFICKGB0 (*((volatile unsigned int *)(0x42310D14UL)))
#define bM4_TMR63_FCONR_NOFICKGB1 (*((volatile unsigned int *)(0x42310D18UL)))
#define bM4_TMR63_FCONR_NOFIENTA (*((volatile unsigned int *)(0x42310D40UL)))
#define bM4_TMR63_FCONR_NOFICKTA0 (*((volatile unsigned int *)(0x42310D44UL)))
#define bM4_TMR63_FCONR_NOFICKTA1 (*((volatile unsigned int *)(0x42310D48UL)))
#define bM4_TMR63_FCONR_NOFIENTB (*((volatile unsigned int *)(0x42310D50UL)))
#define bM4_TMR63_FCONR_NOFICKTB0 (*((volatile unsigned int *)(0x42310D54UL)))
#define bM4_TMR63_FCONR_NOFICKTB1 (*((volatile unsigned int *)(0x42310D58UL)))
#define bM4_TMR63_VPERR_SPPERIA (*((volatile unsigned int *)(0x42310DA0UL)))
#define bM4_TMR63_VPERR_SPPERIB (*((volatile unsigned int *)(0x42310DA4UL)))
#define bM4_TMR63_VPERR_PCNTE0 (*((volatile unsigned int *)(0x42310DC0UL)))
#define bM4_TMR63_VPERR_PCNTE1 (*((volatile unsigned int *)(0x42310DC4UL)))
#define bM4_TMR63_VPERR_PCNTS0 (*((volatile unsigned int *)(0x42310DC8UL)))
#define bM4_TMR63_VPERR_PCNTS1 (*((volatile unsigned int *)(0x42310DCCUL)))
#define bM4_TMR63_VPERR_PCNTS2 (*((volatile unsigned int *)(0x42310DD0UL)))
#define bM4_TMR63_STFLR_CMAF (*((volatile unsigned int *)(0x42310E00UL)))
#define bM4_TMR63_STFLR_CMBF (*((volatile unsigned int *)(0x42310E04UL)))
#define bM4_TMR63_STFLR_CMCF (*((volatile unsigned int *)(0x42310E08UL)))
#define bM4_TMR63_STFLR_CMDF (*((volatile unsigned int *)(0x42310E0CUL)))
#define bM4_TMR63_STFLR_CMEF (*((volatile unsigned int *)(0x42310E10UL)))
#define bM4_TMR63_STFLR_CMFF (*((volatile unsigned int *)(0x42310E14UL)))
#define bM4_TMR63_STFLR_OVFF (*((volatile unsigned int *)(0x42310E18UL)))
#define bM4_TMR63_STFLR_UDFF (*((volatile unsigned int *)(0x42310E1CUL)))
#define bM4_TMR63_STFLR_DTEF (*((volatile unsigned int *)(0x42310E20UL)))
#define bM4_TMR63_STFLR_CMSAUF (*((volatile unsigned int *)(0x42310E24UL)))
#define bM4_TMR63_STFLR_CMSADF (*((volatile unsigned int *)(0x42310E28UL)))
#define bM4_TMR63_STFLR_CMSBUF (*((volatile unsigned int *)(0x42310E2CUL)))
#define bM4_TMR63_STFLR_CMSBDF (*((volatile unsigned int *)(0x42310E30UL)))
#define bM4_TMR63_STFLR_VPERNUM0 (*((volatile unsigned int *)(0x42310E54UL)))
#define bM4_TMR63_STFLR_VPERNUM1 (*((volatile unsigned int *)(0x42310E58UL)))
#define bM4_TMR63_STFLR_VPERNUM2 (*((volatile unsigned int *)(0x42310E5CUL)))
#define bM4_TMR63_STFLR_DIRF (*((volatile unsigned int *)(0x42310E7CUL)))
#define bM4_TMR63_HSTAR_HSTA0 (*((volatile unsigned int *)(0x42310E80UL)))
#define bM4_TMR63_HSTAR_HSTA1 (*((volatile unsigned int *)(0x42310E84UL)))
#define bM4_TMR63_HSTAR_HSTA4 (*((volatile unsigned int *)(0x42310E90UL)))
#define bM4_TMR63_HSTAR_HSTA5 (*((volatile unsigned int *)(0x42310E94UL)))
#define bM4_TMR63_HSTAR_HSTA6 (*((volatile unsigned int *)(0x42310E98UL)))
#define bM4_TMR63_HSTAR_HSTA7 (*((volatile unsigned int *)(0x42310E9CUL)))
#define bM4_TMR63_HSTAR_HSTA8 (*((volatile unsigned int *)(0x42310EA0UL)))
#define bM4_TMR63_HSTAR_HSTA9 (*((volatile unsigned int *)(0x42310EA4UL)))
#define bM4_TMR63_HSTAR_HSTA10 (*((volatile unsigned int *)(0x42310EA8UL)))
#define bM4_TMR63_HSTAR_HSTA11 (*((volatile unsigned int *)(0x42310EACUL)))
#define bM4_TMR63_HSTAR_STARTS (*((volatile unsigned int *)(0x42310EFCUL)))
#define bM4_TMR63_HSTPR_HSTP0 (*((volatile unsigned int *)(0x42310F00UL)))
#define bM4_TMR63_HSTPR_HSTP1 (*((volatile unsigned int *)(0x42310F04UL)))
#define bM4_TMR63_HSTPR_HSTP4 (*((volatile unsigned int *)(0x42310F10UL)))
#define bM4_TMR63_HSTPR_HSTP5 (*((volatile unsigned int *)(0x42310F14UL)))
#define bM4_TMR63_HSTPR_HSTP6 (*((volatile unsigned int *)(0x42310F18UL)))
#define bM4_TMR63_HSTPR_HSTP7 (*((volatile unsigned int *)(0x42310F1CUL)))
#define bM4_TMR63_HSTPR_HSTP8 (*((volatile unsigned int *)(0x42310F20UL)))
#define bM4_TMR63_HSTPR_HSTP9 (*((volatile unsigned int *)(0x42310F24UL)))
#define bM4_TMR63_HSTPR_HSTP10 (*((volatile unsigned int *)(0x42310F28UL)))
#define bM4_TMR63_HSTPR_HSTP11 (*((volatile unsigned int *)(0x42310F2CUL)))
#define bM4_TMR63_HSTPR_STOPS (*((volatile unsigned int *)(0x42310F7CUL)))
#define bM4_TMR63_HCLRR_HCLE0 (*((volatile unsigned int *)(0x42310F80UL)))
#define bM4_TMR63_HCLRR_HCLE1 (*((volatile unsigned int *)(0x42310F84UL)))
#define bM4_TMR63_HCLRR_HCLE4 (*((volatile unsigned int *)(0x42310F90UL)))
#define bM4_TMR63_HCLRR_HCLE5 (*((volatile unsigned int *)(0x42310F94UL)))
#define bM4_TMR63_HCLRR_HCLE6 (*((volatile unsigned int *)(0x42310F98UL)))
#define bM4_TMR63_HCLRR_HCLE7 (*((volatile unsigned int *)(0x42310F9CUL)))
#define bM4_TMR63_HCLRR_HCLE8 (*((volatile unsigned int *)(0x42310FA0UL)))
#define bM4_TMR63_HCLRR_HCLE9 (*((volatile unsigned int *)(0x42310FA4UL)))
#define bM4_TMR63_HCLRR_HCLE10 (*((volatile unsigned int *)(0x42310FA8UL)))
#define bM4_TMR63_HCLRR_HCLE11 (*((volatile unsigned int *)(0x42310FACUL)))
#define bM4_TMR63_HCLRR_CLEARS (*((volatile unsigned int *)(0x42310FFCUL)))
#define bM4_TMR63_HCPAR_HCPA0 (*((volatile unsigned int *)(0x42311000UL)))
#define bM4_TMR63_HCPAR_HCPA1 (*((volatile unsigned int *)(0x42311004UL)))
#define bM4_TMR63_HCPAR_HCPA4 (*((volatile unsigned int *)(0x42311010UL)))
#define bM4_TMR63_HCPAR_HCPA5 (*((volatile unsigned int *)(0x42311014UL)))
#define bM4_TMR63_HCPAR_HCPA6 (*((volatile unsigned int *)(0x42311018UL)))
#define bM4_TMR63_HCPAR_HCPA7 (*((volatile unsigned int *)(0x4231101CUL)))
#define bM4_TMR63_HCPAR_HCPA8 (*((volatile unsigned int *)(0x42311020UL)))
#define bM4_TMR63_HCPAR_HCPA9 (*((volatile unsigned int *)(0x42311024UL)))
#define bM4_TMR63_HCPAR_HCPA10 (*((volatile unsigned int *)(0x42311028UL)))
#define bM4_TMR63_HCPAR_HCPA11 (*((volatile unsigned int *)(0x4231102CUL)))
#define bM4_TMR63_HCPBR_HCPB0 (*((volatile unsigned int *)(0x42311080UL)))
#define bM4_TMR63_HCPBR_HCPB1 (*((volatile unsigned int *)(0x42311084UL)))
#define bM4_TMR63_HCPBR_HCPB4 (*((volatile unsigned int *)(0x42311090UL)))
#define bM4_TMR63_HCPBR_HCPB5 (*((volatile unsigned int *)(0x42311094UL)))
#define bM4_TMR63_HCPBR_HCPB6 (*((volatile unsigned int *)(0x42311098UL)))
#define bM4_TMR63_HCPBR_HCPB7 (*((volatile unsigned int *)(0x4231109CUL)))
#define bM4_TMR63_HCPBR_HCPB8 (*((volatile unsigned int *)(0x423110A0UL)))
#define bM4_TMR63_HCPBR_HCPB9 (*((volatile unsigned int *)(0x423110A4UL)))
#define bM4_TMR63_HCPBR_HCPB10 (*((volatile unsigned int *)(0x423110A8UL)))
#define bM4_TMR63_HCPBR_HCPB11 (*((volatile unsigned int *)(0x423110ACUL)))
#define bM4_TMR63_HCUPR_HCUP0 (*((volatile unsigned int *)(0x42311100UL)))
#define bM4_TMR63_HCUPR_HCUP1 (*((volatile unsigned int *)(0x42311104UL)))
#define bM4_TMR63_HCUPR_HCUP2 (*((volatile unsigned int *)(0x42311108UL)))
#define bM4_TMR63_HCUPR_HCUP3 (*((volatile unsigned int *)(0x4231110CUL)))
#define bM4_TMR63_HCUPR_HCUP4 (*((volatile unsigned int *)(0x42311110UL)))
#define bM4_TMR63_HCUPR_HCUP5 (*((volatile unsigned int *)(0x42311114UL)))
#define bM4_TMR63_HCUPR_HCUP6 (*((volatile unsigned int *)(0x42311118UL)))
#define bM4_TMR63_HCUPR_HCUP7 (*((volatile unsigned int *)(0x4231111CUL)))
#define bM4_TMR63_HCUPR_HCUP8 (*((volatile unsigned int *)(0x42311120UL)))
#define bM4_TMR63_HCUPR_HCUP9 (*((volatile unsigned int *)(0x42311124UL)))
#define bM4_TMR63_HCUPR_HCUP10 (*((volatile unsigned int *)(0x42311128UL)))
#define bM4_TMR63_HCUPR_HCUP11 (*((volatile unsigned int *)(0x4231112CUL)))
#define bM4_TMR63_HCUPR_HCUP16 (*((volatile unsigned int *)(0x42311140UL)))
#define bM4_TMR63_HCUPR_HCUP17 (*((volatile unsigned int *)(0x42311144UL)))
#define bM4_TMR63_HCDOR_HCDO0 (*((volatile unsigned int *)(0x42311180UL)))
#define bM4_TMR63_HCDOR_HCDO1 (*((volatile unsigned int *)(0x42311184UL)))
#define bM4_TMR63_HCDOR_HCDO2 (*((volatile unsigned int *)(0x42311188UL)))
#define bM4_TMR63_HCDOR_HCDO3 (*((volatile unsigned int *)(0x4231118CUL)))
#define bM4_TMR63_HCDOR_HCDO4 (*((volatile unsigned int *)(0x42311190UL)))
#define bM4_TMR63_HCDOR_HCDO5 (*((volatile unsigned int *)(0x42311194UL)))
#define bM4_TMR63_HCDOR_HCDO6 (*((volatile unsigned int *)(0x42311198UL)))
#define bM4_TMR63_HCDOR_HCDO7 (*((volatile unsigned int *)(0x4231119CUL)))
#define bM4_TMR63_HCDOR_HCDO8 (*((volatile unsigned int *)(0x423111A0UL)))
#define bM4_TMR63_HCDOR_HCDO9 (*((volatile unsigned int *)(0x423111A4UL)))
#define bM4_TMR63_HCDOR_HCDO10 (*((volatile unsigned int *)(0x423111A8UL)))
#define bM4_TMR63_HCDOR_HCDO11 (*((volatile unsigned int *)(0x423111ACUL)))
#define bM4_TMR63_HCDOR_HCDO16 (*((volatile unsigned int *)(0x423111C0UL)))
#define bM4_TMR63_HCDOR_HCDO17 (*((volatile unsigned int *)(0x423111C4UL)))
#define bM4_TMR6_CR_SSTAR_SSTA1 (*((volatile unsigned int *)(0x42307E80UL)))
#define bM4_TMR6_CR_SSTAR_SSTA2 (*((volatile unsigned int *)(0x42307E84UL)))
#define bM4_TMR6_CR_SSTAR_SSTA3 (*((volatile unsigned int *)(0x42307E88UL)))
#define bM4_TMR6_CR_SSTAR_RESV0 (*((volatile unsigned int *)(0x42307EC0UL)))
#define bM4_TMR6_CR_SSTAR_RESV (*((volatile unsigned int *)(0x42307EE0UL)))
#define bM4_TMR6_CR_SSTPR_SSTP1 (*((volatile unsigned int *)(0x42307F00UL)))
#define bM4_TMR6_CR_SSTPR_SSTP2 (*((volatile unsigned int *)(0x42307F04UL)))
#define bM4_TMR6_CR_SSTPR_SSTP3 (*((volatile unsigned int *)(0x42307F08UL)))
#define bM4_TMR6_CR_SCLRR_SCLE1 (*((volatile unsigned int *)(0x42307F80UL)))
#define bM4_TMR6_CR_SCLRR_SCLE2 (*((volatile unsigned int *)(0x42307F84UL)))
#define bM4_TMR6_CR_SCLRR_SCLE3 (*((volatile unsigned int *)(0x42307F88UL)))
#define bM4_TMRA1_CNTER_CNT0 (*((volatile unsigned int *)(0x422A0000UL)))
#define bM4_TMRA1_CNTER_CNT1 (*((volatile unsigned int *)(0x422A0004UL)))
#define bM4_TMRA1_CNTER_CNT2 (*((volatile unsigned int *)(0x422A0008UL)))
#define bM4_TMRA1_CNTER_CNT3 (*((volatile unsigned int *)(0x422A000CUL)))
#define bM4_TMRA1_CNTER_CNT4 (*((volatile unsigned int *)(0x422A0010UL)))
#define bM4_TMRA1_CNTER_CNT5 (*((volatile unsigned int *)(0x422A0014UL)))
