MarlinFirmware/Marlin/Marlin/lib/h32_core/main/hdsc32core/common/hc32f46x.h
#define bM4_TMRA1_CCONR8_HICP3 (*((volatile unsigned int *)(0x422A23A0UL)))
#define bM4_TMRA1_CCONR8_HICP4 (*((volatile unsigned int *)(0x422A23A4UL)))
#define bM4_TMRA1_CCONR8_NOFIENCP (*((volatile unsigned int *)(0x422A23B0UL)))
#define bM4_TMRA1_CCONR8_NOFICKCP0 (*((volatile unsigned int *)(0x422A23B4UL)))
#define bM4_TMRA1_CCONR8_NOFICKCP1 (*((volatile unsigned int *)(0x422A23B8UL)))
#define bM4_TMRA1_PCONR1_STAC0 (*((volatile unsigned int *)(0x422A2800UL)))
#define bM4_TMRA1_PCONR1_STAC1 (*((volatile unsigned int *)(0x422A2804UL)))
#define bM4_TMRA1_PCONR1_STPC0 (*((volatile unsigned int *)(0x422A2808UL)))
#define bM4_TMRA1_PCONR1_STPC1 (*((volatile unsigned int *)(0x422A280CUL)))
#define bM4_TMRA1_PCONR1_CMPC0 (*((volatile unsigned int *)(0x422A2810UL)))
#define bM4_TMRA1_PCONR1_CMPC1 (*((volatile unsigned int *)(0x422A2814UL)))
#define bM4_TMRA1_PCONR1_PERC0 (*((volatile unsigned int *)(0x422A2818UL)))
#define bM4_TMRA1_PCONR1_PERC1 (*((volatile unsigned int *)(0x422A281CUL)))
#define bM4_TMRA1_PCONR1_FORC0 (*((volatile unsigned int *)(0x422A2820UL)))
#define bM4_TMRA1_PCONR1_FORC1 (*((volatile unsigned int *)(0x422A2824UL)))
#define bM4_TMRA1_PCONR1_OUTEN (*((volatile unsigned int *)(0x422A2830UL)))
#define bM4_TMRA1_PCONR2_STAC0 (*((volatile unsigned int *)(0x422A2880UL)))
#define bM4_TMRA1_PCONR2_STAC1 (*((volatile unsigned int *)(0x422A2884UL)))
#define bM4_TMRA1_PCONR2_STPC0 (*((volatile unsigned int *)(0x422A2888UL)))
#define bM4_TMRA1_PCONR2_STPC1 (*((volatile unsigned int *)(0x422A288CUL)))
#define bM4_TMRA1_PCONR2_CMPC0 (*((volatile unsigned int *)(0x422A2890UL)))
#define bM4_TMRA1_PCONR2_CMPC1 (*((volatile unsigned int *)(0x422A2894UL)))
#define bM4_TMRA1_PCONR2_PERC0 (*((volatile unsigned int *)(0x422A2898UL)))
#define bM4_TMRA1_PCONR2_PERC1 (*((volatile unsigned int *)(0x422A289CUL)))
#define bM4_TMRA1_PCONR2_FORC0 (*((volatile unsigned int *)(0x422A28A0UL)))
#define bM4_TMRA1_PCONR2_FORC1 (*((volatile unsigned int *)(0x422A28A4UL)))
#define bM4_TMRA1_PCONR2_OUTEN (*((volatile unsigned int *)(0x422A28B0UL)))
#define bM4_TMRA1_PCONR3_STAC0 (*((volatile unsigned int *)(0x422A2900UL)))
#define bM4_TMRA1_PCONR3_STAC1 (*((volatile unsigned int *)(0x422A2904UL)))
#define bM4_TMRA1_PCONR3_STPC0 (*((volatile unsigned int *)(0x422A2908UL)))
#define bM4_TMRA1_PCONR3_STPC1 (*((volatile unsigned int *)(0x422A290CUL)))
#define bM4_TMRA1_PCONR3_CMPC0 (*((volatile unsigned int *)(0x422A2910UL)))
#define bM4_TMRA1_PCONR3_CMPC1 (*((volatile unsigned int *)(0x422A2914UL)))
#define bM4_TMRA1_PCONR3_PERC0 (*((volatile unsigned int *)(0x422A2918UL)))
#define bM4_TMRA1_PCONR3_PERC1 (*((volatile unsigned int *)(0x422A291CUL)))
#define bM4_TMRA1_PCONR3_FORC0 (*((volatile unsigned int *)(0x422A2920UL)))
#define bM4_TMRA1_PCONR3_FORC1 (*((volatile unsigned int *)(0x422A2924UL)))
#define bM4_TMRA1_PCONR3_OUTEN (*((volatile unsigned int *)(0x422A2930UL)))
#define bM4_TMRA1_PCONR4_STAC0 (*((volatile unsigned int *)(0x422A2980UL)))
#define bM4_TMRA1_PCONR4_STAC1 (*((volatile unsigned int *)(0x422A2984UL)))
#define bM4_TMRA1_PCONR4_STPC0 (*((volatile unsigned int *)(0x422A2988UL)))
#define bM4_TMRA1_PCONR4_STPC1 (*((volatile unsigned int *)(0x422A298CUL)))
#define bM4_TMRA1_PCONR4_CMPC0 (*((volatile unsigned int *)(0x422A2990UL)))
#define bM4_TMRA1_PCONR4_CMPC1 (*((volatile unsigned int *)(0x422A2994UL)))
#define bM4_TMRA1_PCONR4_PERC0 (*((volatile unsigned int *)(0x422A2998UL)))
#define bM4_TMRA1_PCONR4_PERC1 (*((volatile unsigned int *)(0x422A299CUL)))
#define bM4_TMRA1_PCONR4_FORC0 (*((volatile unsigned int *)(0x422A29A0UL)))
#define bM4_TMRA1_PCONR4_FORC1 (*((volatile unsigned int *)(0x422A29A4UL)))
#define bM4_TMRA1_PCONR4_OUTEN (*((volatile unsigned int *)(0x422A29B0UL)))
#define bM4_TMRA1_PCONR5_STAC0 (*((volatile unsigned int *)(0x422A2A00UL)))
#define bM4_TMRA1_PCONR5_STAC1 (*((volatile unsigned int *)(0x422A2A04UL)))
#define bM4_TMRA1_PCONR5_STPC0 (*((volatile unsigned int *)(0x422A2A08UL)))
#define bM4_TMRA1_PCONR5_STPC1 (*((volatile unsigned int *)(0x422A2A0CUL)))
#define bM4_TMRA1_PCONR5_CMPC0 (*((volatile unsigned int *)(0x422A2A10UL)))
#define bM4_TMRA1_PCONR5_CMPC1 (*((volatile unsigned int *)(0x422A2A14UL)))
#define bM4_TMRA1_PCONR5_PERC0 (*((volatile unsigned int *)(0x422A2A18UL)))
#define bM4_TMRA1_PCONR5_PERC1 (*((volatile unsigned int *)(0x422A2A1CUL)))
#define bM4_TMRA1_PCONR5_FORC0 (*((volatile unsigned int *)(0x422A2A20UL)))
#define bM4_TMRA1_PCONR5_FORC1 (*((volatile unsigned int *)(0x422A2A24UL)))
#define bM4_TMRA1_PCONR5_OUTEN (*((volatile unsigned int *)(0x422A2A30UL)))
#define bM4_TMRA1_PCONR6_STAC0 (*((volatile unsigned int *)(0x422A2A80UL)))
#define bM4_TMRA1_PCONR6_STAC1 (*((volatile unsigned int *)(0x422A2A84UL)))
#define bM4_TMRA1_PCONR6_STPC0 (*((volatile unsigned int *)(0x422A2A88UL)))
#define bM4_TMRA1_PCONR6_STPC1 (*((volatile unsigned int *)(0x422A2A8CUL)))
#define bM4_TMRA1_PCONR6_CMPC0 (*((volatile unsigned int *)(0x422A2A90UL)))
#define bM4_TMRA1_PCONR6_CMPC1 (*((volatile unsigned int *)(0x422A2A94UL)))
#define bM4_TMRA1_PCONR6_PERC0 (*((volatile unsigned int *)(0x422A2A98UL)))
#define bM4_TMRA1_PCONR6_PERC1 (*((volatile unsigned int *)(0x422A2A9CUL)))
#define bM4_TMRA1_PCONR6_FORC0 (*((volatile unsigned int *)(0x422A2AA0UL)))
#define bM4_TMRA1_PCONR6_FORC1 (*((volatile unsigned int *)(0x422A2AA4UL)))
#define bM4_TMRA1_PCONR6_OUTEN (*((volatile unsigned int *)(0x422A2AB0UL)))
#define bM4_TMRA1_PCONR7_STAC0 (*((volatile unsigned int *)(0x422A2B00UL)))
#define bM4_TMRA1_PCONR7_STAC1 (*((volatile unsigned int *)(0x422A2B04UL)))
#define bM4_TMRA1_PCONR7_STPC0 (*((volatile unsigned int *)(0x422A2B08UL)))
#define bM4_TMRA1_PCONR7_STPC1 (*((volatile unsigned int *)(0x422A2B0CUL)))
#define bM4_TMRA1_PCONR7_CMPC0 (*((volatile unsigned int *)(0x422A2B10UL)))
#define bM4_TMRA1_PCONR7_CMPC1 (*((volatile unsigned int *)(0x422A2B14UL)))
#define bM4_TMRA1_PCONR7_PERC0 (*((volatile unsigned int *)(0x422A2B18UL)))
#define bM4_TMRA1_PCONR7_PERC1 (*((volatile unsigned int *)(0x422A2B1CUL)))
#define bM4_TMRA1_PCONR7_FORC0 (*((volatile unsigned int *)(0x422A2B20UL)))
#define bM4_TMRA1_PCONR7_FORC1 (*((volatile unsigned int *)(0x422A2B24UL)))
#define bM4_TMRA1_PCONR7_OUTEN (*((volatile unsigned int *)(0x422A2B30UL)))
#define bM4_TMRA1_PCONR8_STAC0 (*((volatile unsigned int *)(0x422A2B80UL)))
#define bM4_TMRA1_PCONR8_STAC1 (*((volatile unsigned int *)(0x422A2B84UL)))
#define bM4_TMRA1_PCONR8_STPC0 (*((volatile unsigned int *)(0x422A2B88UL)))
#define bM4_TMRA1_PCONR8_STPC1 (*((volatile unsigned int *)(0x422A2B8CUL)))
#define bM4_TMRA1_PCONR8_CMPC0 (*((volatile unsigned int *)(0x422A2B90UL)))
#define bM4_TMRA1_PCONR8_CMPC1 (*((volatile unsigned int *)(0x422A2B94UL)))
#define bM4_TMRA1_PCONR8_PERC0 (*((volatile unsigned int *)(0x422A2B98UL)))
#define bM4_TMRA1_PCONR8_PERC1 (*((volatile unsigned int *)(0x422A2B9CUL)))
#define bM4_TMRA1_PCONR8_FORC0 (*((volatile unsigned int *)(0x422A2BA0UL)))
#define bM4_TMRA1_PCONR8_FORC1 (*((volatile unsigned int *)(0x422A2BA4UL)))
#define bM4_TMRA1_PCONR8_OUTEN (*((volatile unsigned int *)(0x422A2BB0UL)))
#define bM4_TMRA2_CNTER_CNT0 (*((volatile unsigned int *)(0x422A8000UL)))
#define bM4_TMRA2_CNTER_CNT1 (*((volatile unsigned int *)(0x422A8004UL)))
#define bM4_TMRA2_CNTER_CNT2 (*((volatile unsigned int *)(0x422A8008UL)))
#define bM4_TMRA2_CNTER_CNT3 (*((volatile unsigned int *)(0x422A800CUL)))
#define bM4_TMRA2_CNTER_CNT4 (*((volatile unsigned int *)(0x422A8010UL)))
#define bM4_TMRA2_CNTER_CNT5 (*((volatile unsigned int *)(0x422A8014UL)))
#define bM4_TMRA2_CNTER_CNT6 (*((volatile unsigned int *)(0x422A8018UL)))
#define bM4_TMRA2_CNTER_CNT7 (*((volatile unsigned int *)(0x422A801CUL)))
#define bM4_TMRA2_CNTER_CNT8 (*((volatile unsigned int *)(0x422A8020UL)))
#define bM4_TMRA2_CNTER_CNT9 (*((volatile unsigned int *)(0x422A8024UL)))
#define bM4_TMRA2_CNTER_CNT10 (*((volatile unsigned int *)(0x422A8028UL)))
#define bM4_TMRA2_CNTER_CNT11 (*((volatile unsigned int *)(0x422A802CUL)))
#define bM4_TMRA2_CNTER_CNT12 (*((volatile unsigned int *)(0x422A8030UL)))
#define bM4_TMRA2_CNTER_CNT13 (*((volatile unsigned int *)(0x422A8034UL)))
#define bM4_TMRA2_CNTER_CNT14 (*((volatile unsigned int *)(0x422A8038UL)))
#define bM4_TMRA2_CNTER_CNT15 (*((volatile unsigned int *)(0x422A803CUL)))
#define bM4_TMRA2_PERAR_PER0 (*((volatile unsigned int *)(0x422A8080UL)))
#define bM4_TMRA2_PERAR_PER1 (*((volatile unsigned int *)(0x422A8084UL)))
#define bM4_TMRA2_PERAR_PER2 (*((volatile unsigned int *)(0x422A8088UL)))
#define bM4_TMRA2_PERAR_PER3 (*((volatile unsigned int *)(0x422A808CUL)))
#define bM4_TMRA2_PERAR_PER4 (*((volatile unsigned int *)(0x422A8090UL)))
#define bM4_TMRA2_PERAR_PER5 (*((volatile unsigned int *)(0x422A8094UL)))
#define bM4_TMRA2_PERAR_PER6 (*((volatile unsigned int *)(0x422A8098UL)))
#define bM4_TMRA2_PERAR_PER7 (*((volatile unsigned int *)(0x422A809CUL)))
#define bM4_TMRA2_PERAR_PER8 (*((volatile unsigned int *)(0x422A80A0UL)))
#define bM4_TMRA2_PERAR_PER9 (*((volatile unsigned int *)(0x422A80A4UL)))
#define bM4_TMRA2_PERAR_PER10 (*((volatile unsigned int *)(0x422A80A8UL)))
#define bM4_TMRA2_PERAR_PER11 (*((volatile unsigned int *)(0x422A80ACUL)))
#define bM4_TMRA2_PERAR_PER12 (*((volatile unsigned int *)(0x422A80B0UL)))
#define bM4_TMRA2_PERAR_PER13 (*((volatile unsigned int *)(0x422A80B4UL)))
#define bM4_TMRA2_PERAR_PER14 (*((volatile unsigned int *)(0x422A80B8UL)))
#define bM4_TMRA2_PERAR_PER15 (*((volatile unsigned int *)(0x422A80BCUL)))
#define bM4_TMRA2_CMPAR1_CMP0 (*((volatile unsigned int *)(0x422A8800UL)))
#define bM4_TMRA2_CMPAR1_CMP1 (*((volatile unsigned int *)(0x422A8804UL)))
#define bM4_TMRA2_CMPAR1_CMP2 (*((volatile unsigned int *)(0x422A8808UL)))
#define bM4_TMRA2_CMPAR1_CMP3 (*((volatile unsigned int *)(0x422A880CUL)))
#define bM4_TMRA2_CMPAR1_CMP4 (*((volatile unsigned int *)(0x422A8810UL)))
#define bM4_TMRA2_CMPAR1_CMP5 (*((volatile unsigned int *)(0x422A8814UL)))
#define bM4_TMRA2_CMPAR1_CMP6 (*((volatile unsigned int *)(0x422A8818UL)))
#define bM4_TMRA2_CMPAR1_CMP7 (*((volatile unsigned int *)(0x422A881CUL)))
#define bM4_TMRA2_CMPAR1_CMP8 (*((volatile unsigned int *)(0x422A8820UL)))
#define bM4_TMRA2_CMPAR1_CMP9 (*((volatile unsigned int *)(0x422A8824UL)))
#define bM4_TMRA2_CMPAR1_CMP10 (*((volatile unsigned int *)(0x422A8828UL)))
#define bM4_TMRA2_CMPAR1_CMP11 (*((volatile unsigned int *)(0x422A882CUL)))
#define bM4_TMRA2_CMPAR1_CMP12 (*((volatile unsigned int *)(0x422A8830UL)))
#define bM4_TMRA2_CMPAR1_CMP13 (*((volatile unsigned int *)(0x422A8834UL)))
#define bM4_TMRA2_CMPAR1_CMP14 (*((volatile unsigned int *)(0x422A8838UL)))
#define bM4_TMRA2_CMPAR1_CMP15 (*((volatile unsigned int *)(0x422A883CUL)))
#define bM4_TMRA2_CMPAR2_CMP0 (*((volatile unsigned int *)(0x422A8880UL)))
#define bM4_TMRA2_CMPAR2_CMP1 (*((volatile unsigned int *)(0x422A8884UL)))
#define bM4_TMRA2_CMPAR2_CMP2 (*((volatile unsigned int *)(0x422A8888UL)))
#define bM4_TMRA2_CMPAR2_CMP3 (*((volatile unsigned int *)(0x422A888CUL)))
#define bM4_TMRA2_CMPAR2_CMP4 (*((volatile unsigned int *)(0x422A8890UL)))
#define bM4_TMRA2_CMPAR2_CMP5 (*((volatile unsigned int *)(0x422A8894UL)))
#define bM4_TMRA2_CMPAR2_CMP6 (*((volatile unsigned int *)(0x422A8898UL)))
#define bM4_TMRA2_CMPAR2_CMP7 (*((volatile unsigned int *)(0x422A889CUL)))
#define bM4_TMRA2_CMPAR2_CMP8 (*((volatile unsigned int *)(0x422A88A0UL)))
#define bM4_TMRA2_CMPAR2_CMP9 (*((volatile unsigned int *)(0x422A88A4UL)))
#define bM4_TMRA2_CMPAR2_CMP10 (*((volatile unsigned int *)(0x422A88A8UL)))
#define bM4_TMRA2_CMPAR2_CMP11 (*((volatile unsigned int *)(0x422A88ACUL)))
#define bM4_TMRA2_CMPAR2_CMP12 (*((volatile unsigned int *)(0x422A88B0UL)))
#define bM4_TMRA2_CMPAR2_CMP13 (*((volatile unsigned int *)(0x422A88B4UL)))
#define bM4_TMRA2_CMPAR2_CMP14 (*((volatile unsigned int *)(0x422A88B8UL)))
#define bM4_TMRA2_CMPAR2_CMP15 (*((volatile unsigned int *)(0x422A88BCUL)))
#define bM4_TMRA2_CMPAR3_CMP0 (*((volatile unsigned int *)(0x422A8900UL)))
#define bM4_TMRA2_CMPAR3_CMP1 (*((volatile unsigned int *)(0x422A8904UL)))
#define bM4_TMRA2_CMPAR3_CMP2 (*((volatile unsigned int *)(0x422A8908UL)))
#define bM4_TMRA2_CMPAR3_CMP3 (*((volatile unsigned int *)(0x422A890CUL)))
#define bM4_TMRA2_CMPAR3_CMP4 (*((volatile unsigned int *)(0x422A8910UL)))
#define bM4_TMRA2_CMPAR3_CMP5 (*((volatile unsigned int *)(0x422A8914UL)))
#define bM4_TMRA2_CMPAR3_CMP6 (*((volatile unsigned int *)(0x422A8918UL)))
#define bM4_TMRA2_CMPAR3_CMP7 (*((volatile unsigned int *)(0x422A891CUL)))
#define bM4_TMRA2_CMPAR3_CMP8 (*((volatile unsigned int *)(0x422A8920UL)))
#define bM4_TMRA2_CMPAR3_CMP9 (*((volatile unsigned int *)(0x422A8924UL)))
#define bM4_TMRA2_CMPAR3_CMP10 (*((volatile unsigned int *)(0x422A8928UL)))
#define bM4_TMRA2_CMPAR3_CMP11 (*((volatile unsigned int *)(0x422A892CUL)))
#define bM4_TMRA2_CMPAR3_CMP12 (*((volatile unsigned int *)(0x422A8930UL)))
#define bM4_TMRA2_CMPAR3_CMP13 (*((volatile unsigned int *)(0x422A8934UL)))
#define bM4_TMRA2_CMPAR3_CMP14 (*((volatile unsigned int *)(0x422A8938UL)))
#define bM4_TMRA2_CMPAR3_CMP15 (*((volatile unsigned int *)(0x422A893CUL)))
#define bM4_TMRA2_CMPAR4_CMP0 (*((volatile unsigned int *)(0x422A8980UL)))
#define bM4_TMRA2_CMPAR4_CMP1 (*((volatile unsigned int *)(0x422A8984UL)))
#define bM4_TMRA2_CMPAR4_CMP2 (*((volatile unsigned int *)(0x422A8988UL)))
#define bM4_TMRA2_CMPAR4_CMP3 (*((volatile unsigned int *)(0x422A898CUL)))
#define bM4_TMRA2_CMPAR4_CMP4 (*((volatile unsigned int *)(0x422A8990UL)))
#define bM4_TMRA2_CMPAR4_CMP5 (*((volatile unsigned int *)(0x422A8994UL)))
#define bM4_TMRA2_CMPAR4_CMP6 (*((volatile unsigned int *)(0x422A8998UL)))
#define bM4_TMRA2_CMPAR4_CMP7 (*((volatile unsigned int *)(0x422A899CUL)))
#define bM4_TMRA2_CMPAR4_CMP8 (*((volatile unsigned int *)(0x422A89A0UL)))
#define bM4_TMRA2_CMPAR4_CMP9 (*((volatile unsigned int *)(0x422A89A4UL)))
#define bM4_TMRA2_CMPAR4_CMP10 (*((volatile unsigned int *)(0x422A89A8UL)))
#define bM4_TMRA2_CMPAR4_CMP11 (*((volatile unsigned int *)(0x422A89ACUL)))
#define bM4_TMRA2_CMPAR4_CMP12 (*((volatile unsigned int *)(0x422A89B0UL)))
#define bM4_TMRA2_CMPAR4_CMP13 (*((volatile unsigned int *)(0x422A89B4UL)))
#define bM4_TMRA2_CMPAR4_CMP14 (*((volatile unsigned int *)(0x422A89B8UL)))
#define bM4_TMRA2_CMPAR4_CMP15 (*((volatile unsigned int *)(0x422A89BCUL)))
#define bM4_TMRA2_CMPAR5_CMP0 (*((volatile unsigned int *)(0x422A8A00UL)))
#define bM4_TMRA2_CMPAR5_CMP1 (*((volatile unsigned int *)(0x422A8A04UL)))
#define bM4_TMRA2_CMPAR5_CMP2 (*((volatile unsigned int *)(0x422A8A08UL)))
#define bM4_TMRA2_CMPAR5_CMP3 (*((volatile unsigned int *)(0x422A8A0CUL)))
#define bM4_TMRA2_CMPAR5_CMP4 (*((volatile unsigned int *)(0x422A8A10UL)))
#define bM4_TMRA2_CMPAR5_CMP5 (*((volatile unsigned int *)(0x422A8A14UL)))
#define bM4_TMRA2_CMPAR5_CMP6 (*((volatile unsigned int *)(0x422A8A18UL)))
#define bM4_TMRA2_CMPAR5_CMP7 (*((volatile unsigned int *)(0x422A8A1CUL)))
#define bM4_TMRA2_CMPAR5_CMP8 (*((volatile unsigned int *)(0x422A8A20UL)))
#define bM4_TMRA2_CMPAR5_CMP9 (*((volatile unsigned int *)(0x422A8A24UL)))
#define bM4_TMRA2_CMPAR5_CMP10 (*((volatile unsigned int *)(0x422A8A28UL)))
#define bM4_TMRA2_CMPAR5_CMP11 (*((volatile unsigned int *)(0x422A8A2CUL)))
#define bM4_TMRA2_CMPAR5_CMP12 (*((volatile unsigned int *)(0x422A8A30UL)))
#define bM4_TMRA2_CMPAR5_CMP13 (*((volatile unsigned int *)(0x422A8A34UL)))
#define bM4_TMRA2_CMPAR5_CMP14 (*((volatile unsigned int *)(0x422A8A38UL)))
#define bM4_TMRA2_CMPAR5_CMP15 (*((volatile unsigned int *)(0x422A8A3CUL)))
#define bM4_TMRA2_CMPAR6_CMP0 (*((volatile unsigned int *)(0x422A8A80UL)))
#define bM4_TMRA2_CMPAR6_CMP1 (*((volatile unsigned int *)(0x422A8A84UL)))
#define bM4_TMRA2_CMPAR6_CMP2 (*((volatile unsigned int *)(0x422A8A88UL)))
#define bM4_TMRA2_CMPAR6_CMP3 (*((volatile unsigned int *)(0x422A8A8CUL)))
#define bM4_TMRA2_CMPAR6_CMP4 (*((volatile unsigned int *)(0x422A8A90UL)))
#define bM4_TMRA2_CMPAR6_CMP5 (*((volatile unsigned int *)(0x422A8A94UL)))
#define bM4_TMRA2_CMPAR6_CMP6 (*((volatile unsigned int *)(0x422A8A98UL)))
#define bM4_TMRA2_CMPAR6_CMP7 (*((volatile unsigned int *)(0x422A8A9CUL)))
#define bM4_TMRA2_CMPAR6_CMP8 (*((volatile unsigned int *)(0x422A8AA0UL)))
#define bM4_TMRA2_CMPAR6_CMP9 (*((volatile unsigned int *)(0x422A8AA4UL)))
#define bM4_TMRA2_CMPAR6_CMP10 (*((volatile unsigned int *)(0x422A8AA8UL)))
#define bM4_TMRA2_CMPAR6_CMP11 (*((volatile unsigned int *)(0x422A8AACUL)))
#define bM4_TMRA2_CMPAR6_CMP12 (*((volatile unsigned int *)(0x422A8AB0UL)))
#define bM4_TMRA2_CMPAR6_CMP13 (*((volatile unsigned int *)(0x422A8AB4UL)))
#define bM4_TMRA2_CMPAR6_CMP14 (*((volatile unsigned int *)(0x422A8AB8UL)))
#define bM4_TMRA2_CMPAR6_CMP15 (*((volatile unsigned int *)(0x422A8ABCUL)))
#define bM4_TMRA2_CMPAR7_CMP0 (*((volatile unsigned int *)(0x422A8B00UL)))
#define bM4_TMRA2_CMPAR7_CMP1 (*((volatile unsigned int *)(0x422A8B04UL)))
#define bM4_TMRA2_CMPAR7_CMP2 (*((volatile unsigned int *)(0x422A8B08UL)))
#define bM4_TMRA2_CMPAR7_CMP3 (*((volatile unsigned int *)(0x422A8B0CUL)))
#define bM4_TMRA2_CMPAR7_CMP4 (*((volatile unsigned int *)(0x422A8B10UL)))
#define bM4_TMRA2_CMPAR7_CMP5 (*((volatile unsigned int *)(0x422A8B14UL)))
#define bM4_TMRA2_CMPAR7_CMP6 (*((volatile unsigned int *)(0x422A8B18UL)))
#define bM4_TMRA2_CMPAR7_CMP7 (*((volatile unsigned int *)(0x422A8B1CUL)))
#define bM4_TMRA2_CMPAR7_CMP8 (*((volatile unsigned int *)(0x422A8B20UL)))
#define bM4_TMRA2_CMPAR7_CMP9 (*((volatile unsigned int *)(0x422A8B24UL)))
#define bM4_TMRA2_CMPAR7_CMP10 (*((volatile unsigned int *)(0x422A8B28UL)))
#define bM4_TMRA2_CMPAR7_CMP11 (*((volatile unsigned int *)(0x422A8B2CUL)))
#define bM4_TMRA2_CMPAR7_CMP12 (*((volatile unsigned int *)(0x422A8B30UL)))
#define bM4_TMRA2_CMPAR7_CMP13 (*((volatile unsigned int *)(0x422A8B34UL)))
#define bM4_TMRA2_CMPAR7_CMP14 (*((volatile unsigned int *)(0x422A8B38UL)))
#define bM4_TMRA2_CMPAR7_CMP15 (*((volatile unsigned int *)(0x422A8B3CUL)))
#define bM4_TMRA2_CMPAR8_CMP0 (*((volatile unsigned int *)(0x422A8B80UL)))
#define bM4_TMRA2_CMPAR8_CMP1 (*((volatile unsigned int *)(0x422A8B84UL)))
#define bM4_TMRA2_CMPAR8_CMP2 (*((volatile unsigned int *)(0x422A8B88UL)))
#define bM4_TMRA2_CMPAR8_CMP3 (*((volatile unsigned int *)(0x422A8B8CUL)))
#define bM4_TMRA2_CMPAR8_CMP4 (*((volatile unsigned int *)(0x422A8B90UL)))
#define bM4_TMRA2_CMPAR8_CMP5 (*((volatile unsigned int *)(0x422A8B94UL)))
#define bM4_TMRA2_CMPAR8_CMP6 (*((volatile unsigned int *)(0x422A8B98UL)))
#define bM4_TMRA2_CMPAR8_CMP7 (*((volatile unsigned int *)(0x422A8B9CUL)))
#define bM4_TMRA2_CMPAR8_CMP8 (*((volatile unsigned int *)(0x422A8BA0UL)))
#define bM4_TMRA2_CMPAR8_CMP9 (*((volatile unsigned int *)(0x422A8BA4UL)))
#define bM4_TMRA2_CMPAR8_CMP10 (*((volatile unsigned int *)(0x422A8BA8UL)))
#define bM4_TMRA2_CMPAR8_CMP11 (*((volatile unsigned int *)(0x422A8BACUL)))
#define bM4_TMRA2_CMPAR8_CMP12 (*((volatile unsigned int *)(0x422A8BB0UL)))
#define bM4_TMRA2_CMPAR8_CMP13 (*((volatile unsigned int *)(0x422A8BB4UL)))
#define bM4_TMRA2_CMPAR8_CMP14 (*((volatile unsigned int *)(0x422A8BB8UL)))
#define bM4_TMRA2_CMPAR8_CMP15 (*((volatile unsigned int *)(0x422A8BBCUL)))
#define bM4_TMRA2_BCSTR_START (*((volatile unsigned int *)(0x422A9000UL)))
#define bM4_TMRA2_BCSTR_DIR (*((volatile unsigned int *)(0x422A9004UL)))
#define bM4_TMRA2_BCSTR_MODE (*((volatile unsigned int *)(0x422A9008UL)))
#define bM4_TMRA2_BCSTR_SYNST (*((volatile unsigned int *)(0x422A900CUL)))
#define bM4_TMRA2_BCSTR_CKDIV0 (*((volatile unsigned int *)(0x422A9010UL)))
#define bM4_TMRA2_BCSTR_CKDIV1 (*((volatile unsigned int *)(0x422A9014UL)))
#define bM4_TMRA2_BCSTR_CKDIV2 (*((volatile unsigned int *)(0x422A9018UL)))
#define bM4_TMRA2_BCSTR_CKDIV3 (*((volatile unsigned int *)(0x422A901CUL)))
#define bM4_TMRA2_BCSTR_ITENOVF (*((volatile unsigned int *)(0x422A9030UL)))
#define bM4_TMRA2_BCSTR_ITENUDF (*((volatile unsigned int *)(0x422A9034UL)))
#define bM4_TMRA2_BCSTR_OVFF (*((volatile unsigned int *)(0x422A9038UL)))
#define bM4_TMRA2_BCSTR_UDFF (*((volatile unsigned int *)(0x422A903CUL)))
#define bM4_TMRA2_HCONR_HSTA0 (*((volatile unsigned int *)(0x422A9080UL)))
#define bM4_TMRA2_HCONR_HSTA1 (*((volatile unsigned int *)(0x422A9084UL)))
#define bM4_TMRA2_HCONR_HSTA2 (*((volatile unsigned int *)(0x422A9088UL)))
#define bM4_TMRA2_HCONR_HSTP0 (*((volatile unsigned int *)(0x422A9090UL)))
#define bM4_TMRA2_HCONR_HSTP1 (*((volatile unsigned int *)(0x422A9094UL)))
#define bM4_TMRA2_HCONR_HSTP2 (*((volatile unsigned int *)(0x422A9098UL)))
#define bM4_TMRA2_HCONR_HCLE0 (*((volatile unsigned int *)(0x422A90A0UL)))
#define bM4_TMRA2_HCONR_HCLE1 (*((volatile unsigned int *)(0x422A90A4UL)))
#define bM4_TMRA2_HCONR_HCLE2 (*((volatile unsigned int *)(0x422A90A8UL)))
#define bM4_TMRA2_HCONR_HCLE3 (*((volatile unsigned int *)(0x422A90B0UL)))
#define bM4_TMRA2_HCONR_HCLE4 (*((volatile unsigned int *)(0x422A90B4UL)))
#define bM4_TMRA2_HCONR_HCLE5 (*((volatile unsigned int *)(0x422A90B8UL)))
#define bM4_TMRA2_HCONR_HCLE6 (*((volatile unsigned int *)(0x422A90BCUL)))
#define bM4_TMRA2_HCUPR_HCUP0 (*((volatile unsigned int *)(0x422A9100UL)))
#define bM4_TMRA2_HCUPR_HCUP1 (*((volatile unsigned int *)(0x422A9104UL)))
#define bM4_TMRA2_HCUPR_HCUP2 (*((volatile unsigned int *)(0x422A9108UL)))
#define bM4_TMRA2_HCUPR_HCUP3 (*((volatile unsigned int *)(0x422A910CUL)))
#define bM4_TMRA2_HCUPR_HCUP4 (*((volatile unsigned int *)(0x422A9110UL)))
#define bM4_TMRA2_HCUPR_HCUP5 (*((volatile unsigned int *)(0x422A9114UL)))
#define bM4_TMRA2_HCUPR_HCUP6 (*((volatile unsigned int *)(0x422A9118UL)))
#define bM4_TMRA2_HCUPR_HCUP7 (*((volatile unsigned int *)(0x422A911CUL)))
#define bM4_TMRA2_HCUPR_HCUP8 (*((volatile unsigned int *)(0x422A9120UL)))
#define bM4_TMRA2_HCUPR_HCUP9 (*((volatile unsigned int *)(0x422A9124UL)))
#define bM4_TMRA2_HCUPR_HCUP10 (*((volatile unsigned int *)(0x422A9128UL)))
#define bM4_TMRA2_HCUPR_HCUP11 (*((volatile unsigned int *)(0x422A912CUL)))
#define bM4_TMRA2_HCUPR_HCUP12 (*((volatile unsigned int *)(0x422A9130UL)))
#define bM4_TMRA2_HCDOR_HCDO0 (*((volatile unsigned int *)(0x422A9180UL)))
#define bM4_TMRA2_HCDOR_HCDO1 (*((volatile unsigned int *)(0x422A9184UL)))
#define bM4_TMRA2_HCDOR_HCDO2 (*((volatile unsigned int *)(0x422A9188UL)))
#define bM4_TMRA2_HCDOR_HCDO3 (*((volatile unsigned int *)(0x422A918CUL)))
#define bM4_TMRA2_HCDOR_HCDO4 (*((volatile unsigned int *)(0x422A9190UL)))
#define bM4_TMRA2_HCDOR_HCDO5 (*((volatile unsigned int *)(0x422A9194UL)))
#define bM4_TMRA2_HCDOR_HCDO6 (*((volatile unsigned int *)(0x422A9198UL)))
#define bM4_TMRA2_HCDOR_HCDO7 (*((volatile unsigned int *)(0x422A919CUL)))
#define bM4_TMRA2_HCDOR_HCDO8 (*((volatile unsigned int *)(0x422A91A0UL)))
#define bM4_TMRA2_HCDOR_HCDO9 (*((volatile unsigned int *)(0x422A91A4UL)))
#define bM4_TMRA2_HCDOR_HCDO10 (*((volatile unsigned int *)(0x422A91A8UL)))
#define bM4_TMRA2_HCDOR_HCDO11 (*((volatile unsigned int *)(0x422A91ACUL)))
#define bM4_TMRA2_HCDOR_HCDO12 (*((volatile unsigned int *)(0x422A91B0UL)))
#define bM4_TMRA2_ICONR_ITEN1 (*((volatile unsigned int *)(0x422A9200UL)))
#define bM4_TMRA2_ICONR_ITEN2 (*((volatile unsigned int *)(0x422A9204UL)))
#define bM4_TMRA2_ICONR_ITEN3 (*((volatile unsigned int *)(0x422A9208UL)))
#define bM4_TMRA2_ICONR_ITEN4 (*((volatile unsigned int *)(0x422A920CUL)))
#define bM4_TMRA2_ICONR_ITEN5 (*((volatile unsigned int *)(0x422A9210UL)))
#define bM4_TMRA2_ICONR_ITEN6 (*((volatile unsigned int *)(0x422A9214UL)))
#define bM4_TMRA2_ICONR_ITEN7 (*((volatile unsigned int *)(0x422A9218UL)))
#define bM4_TMRA2_ICONR_ITEN8 (*((volatile unsigned int *)(0x422A921CUL)))
#define bM4_TMRA2_ECONR_ETEN1 (*((volatile unsigned int *)(0x422A9280UL)))
#define bM4_TMRA2_ECONR_ETEN2 (*((volatile unsigned int *)(0x422A9284UL)))
#define bM4_TMRA2_ECONR_ETEN3 (*((volatile unsigned int *)(0x422A9288UL)))
#define bM4_TMRA2_ECONR_ETEN4 (*((volatile unsigned int *)(0x422A928CUL)))
#define bM4_TMRA2_ECONR_ETEN5 (*((volatile unsigned int *)(0x422A9290UL)))
#define bM4_TMRA2_ECONR_ETEN6 (*((volatile unsigned int *)(0x422A9294UL)))
