MarlinFirmware/Marlin/Marlin/lib/h32_core/main/hdsc32core/common/hc32f46x.h
#define bM4_TMRA3_CMPAR6_CMP13 (*((volatile unsigned int *)(0x422B0AB4UL)))
#define bM4_TMRA3_CMPAR6_CMP14 (*((volatile unsigned int *)(0x422B0AB8UL)))
#define bM4_TMRA3_CMPAR6_CMP15 (*((volatile unsigned int *)(0x422B0ABCUL)))
#define bM4_TMRA3_CMPAR7_CMP0 (*((volatile unsigned int *)(0x422B0B00UL)))
#define bM4_TMRA3_CMPAR7_CMP1 (*((volatile unsigned int *)(0x422B0B04UL)))
#define bM4_TMRA3_CMPAR7_CMP2 (*((volatile unsigned int *)(0x422B0B08UL)))
#define bM4_TMRA3_CMPAR7_CMP3 (*((volatile unsigned int *)(0x422B0B0CUL)))
#define bM4_TMRA3_CMPAR7_CMP4 (*((volatile unsigned int *)(0x422B0B10UL)))
#define bM4_TMRA3_CMPAR7_CMP5 (*((volatile unsigned int *)(0x422B0B14UL)))
#define bM4_TMRA3_CMPAR7_CMP6 (*((volatile unsigned int *)(0x422B0B18UL)))
#define bM4_TMRA3_CMPAR7_CMP7 (*((volatile unsigned int *)(0x422B0B1CUL)))
#define bM4_TMRA3_CMPAR7_CMP8 (*((volatile unsigned int *)(0x422B0B20UL)))
#define bM4_TMRA3_CMPAR7_CMP9 (*((volatile unsigned int *)(0x422B0B24UL)))
#define bM4_TMRA3_CMPAR7_CMP10 (*((volatile unsigned int *)(0x422B0B28UL)))
#define bM4_TMRA3_CMPAR7_CMP11 (*((volatile unsigned int *)(0x422B0B2CUL)))
#define bM4_TMRA3_CMPAR7_CMP12 (*((volatile unsigned int *)(0x422B0B30UL)))
#define bM4_TMRA3_CMPAR7_CMP13 (*((volatile unsigned int *)(0x422B0B34UL)))
#define bM4_TMRA3_CMPAR7_CMP14 (*((volatile unsigned int *)(0x422B0B38UL)))
#define bM4_TMRA3_CMPAR7_CMP15 (*((volatile unsigned int *)(0x422B0B3CUL)))
#define bM4_TMRA3_CMPAR8_CMP0 (*((volatile unsigned int *)(0x422B0B80UL)))
#define bM4_TMRA3_CMPAR8_CMP1 (*((volatile unsigned int *)(0x422B0B84UL)))
#define bM4_TMRA3_CMPAR8_CMP2 (*((volatile unsigned int *)(0x422B0B88UL)))
#define bM4_TMRA3_CMPAR8_CMP3 (*((volatile unsigned int *)(0x422B0B8CUL)))
#define bM4_TMRA3_CMPAR8_CMP4 (*((volatile unsigned int *)(0x422B0B90UL)))
#define bM4_TMRA3_CMPAR8_CMP5 (*((volatile unsigned int *)(0x422B0B94UL)))
#define bM4_TMRA3_CMPAR8_CMP6 (*((volatile unsigned int *)(0x422B0B98UL)))
#define bM4_TMRA3_CMPAR8_CMP7 (*((volatile unsigned int *)(0x422B0B9CUL)))
#define bM4_TMRA3_CMPAR8_CMP8 (*((volatile unsigned int *)(0x422B0BA0UL)))
#define bM4_TMRA3_CMPAR8_CMP9 (*((volatile unsigned int *)(0x422B0BA4UL)))
#define bM4_TMRA3_CMPAR8_CMP10 (*((volatile unsigned int *)(0x422B0BA8UL)))
#define bM4_TMRA3_CMPAR8_CMP11 (*((volatile unsigned int *)(0x422B0BACUL)))
#define bM4_TMRA3_CMPAR8_CMP12 (*((volatile unsigned int *)(0x422B0BB0UL)))
#define bM4_TMRA3_CMPAR8_CMP13 (*((volatile unsigned int *)(0x422B0BB4UL)))
#define bM4_TMRA3_CMPAR8_CMP14 (*((volatile unsigned int *)(0x422B0BB8UL)))
#define bM4_TMRA3_CMPAR8_CMP15 (*((volatile unsigned int *)(0x422B0BBCUL)))
#define bM4_TMRA3_BCSTR_START (*((volatile unsigned int *)(0x422B1000UL)))
#define bM4_TMRA3_BCSTR_DIR (*((volatile unsigned int *)(0x422B1004UL)))
#define bM4_TMRA3_BCSTR_MODE (*((volatile unsigned int *)(0x422B1008UL)))
#define bM4_TMRA3_BCSTR_SYNST (*((volatile unsigned int *)(0x422B100CUL)))
#define bM4_TMRA3_BCSTR_CKDIV0 (*((volatile unsigned int *)(0x422B1010UL)))
#define bM4_TMRA3_BCSTR_CKDIV1 (*((volatile unsigned int *)(0x422B1014UL)))
#define bM4_TMRA3_BCSTR_CKDIV2 (*((volatile unsigned int *)(0x422B1018UL)))
#define bM4_TMRA3_BCSTR_CKDIV3 (*((volatile unsigned int *)(0x422B101CUL)))
#define bM4_TMRA3_BCSTR_ITENOVF (*((volatile unsigned int *)(0x422B1030UL)))
#define bM4_TMRA3_BCSTR_ITENUDF (*((volatile unsigned int *)(0x422B1034UL)))
#define bM4_TMRA3_BCSTR_OVFF (*((volatile unsigned int *)(0x422B1038UL)))
#define bM4_TMRA3_BCSTR_UDFF (*((volatile unsigned int *)(0x422B103CUL)))
#define bM4_TMRA3_HCONR_HSTA0 (*((volatile unsigned int *)(0x422B1080UL)))
#define bM4_TMRA3_HCONR_HSTA1 (*((volatile unsigned int *)(0x422B1084UL)))
#define bM4_TMRA3_HCONR_HSTA2 (*((volatile unsigned int *)(0x422B1088UL)))
#define bM4_TMRA3_HCONR_HSTP0 (*((volatile unsigned int *)(0x422B1090UL)))
#define bM4_TMRA3_HCONR_HSTP1 (*((volatile unsigned int *)(0x422B1094UL)))
#define bM4_TMRA3_HCONR_HSTP2 (*((volatile unsigned int *)(0x422B1098UL)))
#define bM4_TMRA3_HCONR_HCLE0 (*((volatile unsigned int *)(0x422B10A0UL)))
#define bM4_TMRA3_HCONR_HCLE1 (*((volatile unsigned int *)(0x422B10A4UL)))
#define bM4_TMRA3_HCONR_HCLE2 (*((volatile unsigned int *)(0x422B10A8UL)))
#define bM4_TMRA3_HCONR_HCLE3 (*((volatile unsigned int *)(0x422B10B0UL)))
#define bM4_TMRA3_HCONR_HCLE4 (*((volatile unsigned int *)(0x422B10B4UL)))
#define bM4_TMRA3_HCONR_HCLE5 (*((volatile unsigned int *)(0x422B10B8UL)))
#define bM4_TMRA3_HCONR_HCLE6 (*((volatile unsigned int *)(0x422B10BCUL)))
#define bM4_TMRA3_HCUPR_HCUP0 (*((volatile unsigned int *)(0x422B1100UL)))
#define bM4_TMRA3_HCUPR_HCUP1 (*((volatile unsigned int *)(0x422B1104UL)))
#define bM4_TMRA3_HCUPR_HCUP2 (*((volatile unsigned int *)(0x422B1108UL)))
#define bM4_TMRA3_HCUPR_HCUP3 (*((volatile unsigned int *)(0x422B110CUL)))
#define bM4_TMRA3_HCUPR_HCUP4 (*((volatile unsigned int *)(0x422B1110UL)))
#define bM4_TMRA3_HCUPR_HCUP5 (*((volatile unsigned int *)(0x422B1114UL)))
#define bM4_TMRA3_HCUPR_HCUP6 (*((volatile unsigned int *)(0x422B1118UL)))
#define bM4_TMRA3_HCUPR_HCUP7 (*((volatile unsigned int *)(0x422B111CUL)))
#define bM4_TMRA3_HCUPR_HCUP8 (*((volatile unsigned int *)(0x422B1120UL)))
#define bM4_TMRA3_HCUPR_HCUP9 (*((volatile unsigned int *)(0x422B1124UL)))
#define bM4_TMRA3_HCUPR_HCUP10 (*((volatile unsigned int *)(0x422B1128UL)))
#define bM4_TMRA3_HCUPR_HCUP11 (*((volatile unsigned int *)(0x422B112CUL)))
#define bM4_TMRA3_HCUPR_HCUP12 (*((volatile unsigned int *)(0x422B1130UL)))
#define bM4_TMRA3_HCDOR_HCDO0 (*((volatile unsigned int *)(0x422B1180UL)))
#define bM4_TMRA3_HCDOR_HCDO1 (*((volatile unsigned int *)(0x422B1184UL)))
#define bM4_TMRA3_HCDOR_HCDO2 (*((volatile unsigned int *)(0x422B1188UL)))
#define bM4_TMRA3_HCDOR_HCDO3 (*((volatile unsigned int *)(0x422B118CUL)))
#define bM4_TMRA3_HCDOR_HCDO4 (*((volatile unsigned int *)(0x422B1190UL)))
#define bM4_TMRA3_HCDOR_HCDO5 (*((volatile unsigned int *)(0x422B1194UL)))
#define bM4_TMRA3_HCDOR_HCDO6 (*((volatile unsigned int *)(0x422B1198UL)))
#define bM4_TMRA3_HCDOR_HCDO7 (*((volatile unsigned int *)(0x422B119CUL)))
#define bM4_TMRA3_HCDOR_HCDO8 (*((volatile unsigned int *)(0x422B11A0UL)))
#define bM4_TMRA3_HCDOR_HCDO9 (*((volatile unsigned int *)(0x422B11A4UL)))
#define bM4_TMRA3_HCDOR_HCDO10 (*((volatile unsigned int *)(0x422B11A8UL)))
#define bM4_TMRA3_HCDOR_HCDO11 (*((volatile unsigned int *)(0x422B11ACUL)))
#define bM4_TMRA3_HCDOR_HCDO12 (*((volatile unsigned int *)(0x422B11B0UL)))
#define bM4_TMRA3_ICONR_ITEN1 (*((volatile unsigned int *)(0x422B1200UL)))
#define bM4_TMRA3_ICONR_ITEN2 (*((volatile unsigned int *)(0x422B1204UL)))
#define bM4_TMRA3_ICONR_ITEN3 (*((volatile unsigned int *)(0x422B1208UL)))
#define bM4_TMRA3_ICONR_ITEN4 (*((volatile unsigned int *)(0x422B120CUL)))
#define bM4_TMRA3_ICONR_ITEN5 (*((volatile unsigned int *)(0x422B1210UL)))
#define bM4_TMRA3_ICONR_ITEN6 (*((volatile unsigned int *)(0x422B1214UL)))
#define bM4_TMRA3_ICONR_ITEN7 (*((volatile unsigned int *)(0x422B1218UL)))
#define bM4_TMRA3_ICONR_ITEN8 (*((volatile unsigned int *)(0x422B121CUL)))
#define bM4_TMRA3_ECONR_ETEN1 (*((volatile unsigned int *)(0x422B1280UL)))
#define bM4_TMRA3_ECONR_ETEN2 (*((volatile unsigned int *)(0x422B1284UL)))
#define bM4_TMRA3_ECONR_ETEN3 (*((volatile unsigned int *)(0x422B1288UL)))
#define bM4_TMRA3_ECONR_ETEN4 (*((volatile unsigned int *)(0x422B128CUL)))
#define bM4_TMRA3_ECONR_ETEN5 (*((volatile unsigned int *)(0x422B1290UL)))
#define bM4_TMRA3_ECONR_ETEN6 (*((volatile unsigned int *)(0x422B1294UL)))
#define bM4_TMRA3_ECONR_ETEN7 (*((volatile unsigned int *)(0x422B1298UL)))
#define bM4_TMRA3_ECONR_ETEN8 (*((volatile unsigned int *)(0x422B129CUL)))
#define bM4_TMRA3_FCONR_NOFIENTG (*((volatile unsigned int *)(0x422B1300UL)))
#define bM4_TMRA3_FCONR_NOFICKTG0 (*((volatile unsigned int *)(0x422B1304UL)))
#define bM4_TMRA3_FCONR_NOFICKTG1 (*((volatile unsigned int *)(0x422B1308UL)))
#define bM4_TMRA3_FCONR_NOFIENCA (*((volatile unsigned int *)(0x422B1320UL)))
#define bM4_TMRA3_FCONR_NOFICKCA0 (*((volatile unsigned int *)(0x422B1324UL)))
#define bM4_TMRA3_FCONR_NOFICKCA1 (*((volatile unsigned int *)(0x422B1328UL)))
#define bM4_TMRA3_FCONR_NOFIENCB (*((volatile unsigned int *)(0x422B1330UL)))
#define bM4_TMRA3_FCONR_NOFICKCB0 (*((volatile unsigned int *)(0x422B1334UL)))
#define bM4_TMRA3_FCONR_NOFICKCB1 (*((volatile unsigned int *)(0x422B1338UL)))
#define bM4_TMRA3_STFLR_CMPF1 (*((volatile unsigned int *)(0x422B1380UL)))
#define bM4_TMRA3_STFLR_CMPF2 (*((volatile unsigned int *)(0x422B1384UL)))
#define bM4_TMRA3_STFLR_CMPF3 (*((volatile unsigned int *)(0x422B1388UL)))
#define bM4_TMRA3_STFLR_CMPF4 (*((volatile unsigned int *)(0x422B138CUL)))
#define bM4_TMRA3_STFLR_CMPF5 (*((volatile unsigned int *)(0x422B1390UL)))
#define bM4_TMRA3_STFLR_CMPF6 (*((volatile unsigned int *)(0x422B1394UL)))
#define bM4_TMRA3_STFLR_CMPF7 (*((volatile unsigned int *)(0x422B1398UL)))
#define bM4_TMRA3_STFLR_CMPF8 (*((volatile unsigned int *)(0x422B139CUL)))
#define bM4_TMRA3_BCONR1_BEN (*((volatile unsigned int *)(0x422B1800UL)))
#define bM4_TMRA3_BCONR1_BSE0 (*((volatile unsigned int *)(0x422B1804UL)))
#define bM4_TMRA3_BCONR1_BSE1 (*((volatile unsigned int *)(0x422B1808UL)))
#define bM4_TMRA3_BCONR2_BEN (*((volatile unsigned int *)(0x422B1900UL)))
#define bM4_TMRA3_BCONR2_BSE0 (*((volatile unsigned int *)(0x422B1904UL)))
#define bM4_TMRA3_BCONR2_BSE1 (*((volatile unsigned int *)(0x422B1908UL)))
#define bM4_TMRA3_BCONR3_BEN (*((volatile unsigned int *)(0x422B1A00UL)))
#define bM4_TMRA3_BCONR3_BSE0 (*((volatile unsigned int *)(0x422B1A04UL)))
#define bM4_TMRA3_BCONR3_BSE1 (*((volatile unsigned int *)(0x422B1A08UL)))
#define bM4_TMRA3_BCONR4_BEN (*((volatile unsigned int *)(0x422B1B00UL)))
#define bM4_TMRA3_BCONR4_BSE0 (*((volatile unsigned int *)(0x422B1B04UL)))
#define bM4_TMRA3_BCONR4_BSE1 (*((volatile unsigned int *)(0x422B1B08UL)))
#define bM4_TMRA3_CCONR1_CAPMDA (*((volatile unsigned int *)(0x422B2000UL)))
#define bM4_TMRA3_CCONR1_HICP0 (*((volatile unsigned int *)(0x422B2010UL)))
#define bM4_TMRA3_CCONR1_HICP1 (*((volatile unsigned int *)(0x422B2014UL)))
#define bM4_TMRA3_CCONR1_HICP2 (*((volatile unsigned int *)(0x422B2018UL)))
#define bM4_TMRA3_CCONR1_HICP3 (*((volatile unsigned int *)(0x422B2020UL)))
#define bM4_TMRA3_CCONR1_HICP4 (*((volatile unsigned int *)(0x422B2024UL)))
#define bM4_TMRA3_CCONR1_NOFIENCP (*((volatile unsigned int *)(0x422B2030UL)))
#define bM4_TMRA3_CCONR1_NOFICKCP0 (*((volatile unsigned int *)(0x422B2034UL)))
#define bM4_TMRA3_CCONR1_NOFICKCP1 (*((volatile unsigned int *)(0x422B2038UL)))
#define bM4_TMRA3_CCONR2_CAPMDA (*((volatile unsigned int *)(0x422B2080UL)))
#define bM4_TMRA3_CCONR2_HICP0 (*((volatile unsigned int *)(0x422B2090UL)))
#define bM4_TMRA3_CCONR2_HICP1 (*((volatile unsigned int *)(0x422B2094UL)))
#define bM4_TMRA3_CCONR2_HICP2 (*((volatile unsigned int *)(0x422B2098UL)))
#define bM4_TMRA3_CCONR2_HICP3 (*((volatile unsigned int *)(0x422B20A0UL)))
#define bM4_TMRA3_CCONR2_HICP4 (*((volatile unsigned int *)(0x422B20A4UL)))
#define bM4_TMRA3_CCONR2_NOFIENCP (*((volatile unsigned int *)(0x422B20B0UL)))
#define bM4_TMRA3_CCONR2_NOFICKCP0 (*((volatile unsigned int *)(0x422B20B4UL)))
#define bM4_TMRA3_CCONR2_NOFICKCP1 (*((volatile unsigned int *)(0x422B20B8UL)))
#define bM4_TMRA3_CCONR3_CAPMDA (*((volatile unsigned int *)(0x422B2100UL)))
#define bM4_TMRA3_CCONR3_HICP0 (*((volatile unsigned int *)(0x422B2110UL)))
#define bM4_TMRA3_CCONR3_HICP1 (*((volatile unsigned int *)(0x422B2114UL)))
#define bM4_TMRA3_CCONR3_HICP2 (*((volatile unsigned int *)(0x422B2118UL)))
#define bM4_TMRA3_CCONR3_HICP3 (*((volatile unsigned int *)(0x422B2120UL)))
#define bM4_TMRA3_CCONR3_HICP4 (*((volatile unsigned int *)(0x422B2124UL)))
#define bM4_TMRA3_CCONR3_NOFIENCP (*((volatile unsigned int *)(0x422B2130UL)))
#define bM4_TMRA3_CCONR3_NOFICKCP0 (*((volatile unsigned int *)(0x422B2134UL)))
#define bM4_TMRA3_CCONR3_NOFICKCP1 (*((volatile unsigned int *)(0x422B2138UL)))
#define bM4_TMRA3_CCONR4_CAPMDA (*((volatile unsigned int *)(0x422B2180UL)))
#define bM4_TMRA3_CCONR4_HICP0 (*((volatile unsigned int *)(0x422B2190UL)))
#define bM4_TMRA3_CCONR4_HICP1 (*((volatile unsigned int *)(0x422B2194UL)))
#define bM4_TMRA3_CCONR4_HICP2 (*((volatile unsigned int *)(0x422B2198UL)))
#define bM4_TMRA3_CCONR4_HICP3 (*((volatile unsigned int *)(0x422B21A0UL)))
#define bM4_TMRA3_CCONR4_HICP4 (*((volatile unsigned int *)(0x422B21A4UL)))
#define bM4_TMRA3_CCONR4_NOFIENCP (*((volatile unsigned int *)(0x422B21B0UL)))
#define bM4_TMRA3_CCONR4_NOFICKCP0 (*((volatile unsigned int *)(0x422B21B4UL)))
#define bM4_TMRA3_CCONR4_NOFICKCP1 (*((volatile unsigned int *)(0x422B21B8UL)))
#define bM4_TMRA3_CCONR5_CAPMDA (*((volatile unsigned int *)(0x422B2200UL)))
#define bM4_TMRA3_CCONR5_HICP0 (*((volatile unsigned int *)(0x422B2210UL)))
#define bM4_TMRA3_CCONR5_HICP1 (*((volatile unsigned int *)(0x422B2214UL)))
#define bM4_TMRA3_CCONR5_HICP2 (*((volatile unsigned int *)(0x422B2218UL)))
#define bM4_TMRA3_CCONR5_HICP3 (*((volatile unsigned int *)(0x422B2220UL)))
#define bM4_TMRA3_CCONR5_HICP4 (*((volatile unsigned int *)(0x422B2224UL)))
#define bM4_TMRA3_CCONR5_NOFIENCP (*((volatile unsigned int *)(0x422B2230UL)))
#define bM4_TMRA3_CCONR5_NOFICKCP0 (*((volatile unsigned int *)(0x422B2234UL)))
#define bM4_TMRA3_CCONR5_NOFICKCP1 (*((volatile unsigned int *)(0x422B2238UL)))
#define bM4_TMRA3_CCONR6_CAPMDA (*((volatile unsigned int *)(0x422B2280UL)))
#define bM4_TMRA3_CCONR6_HICP0 (*((volatile unsigned int *)(0x422B2290UL)))
#define bM4_TMRA3_CCONR6_HICP1 (*((volatile unsigned int *)(0x422B2294UL)))
#define bM4_TMRA3_CCONR6_HICP2 (*((volatile unsigned int *)(0x422B2298UL)))
#define bM4_TMRA3_CCONR6_HICP3 (*((volatile unsigned int *)(0x422B22A0UL)))
#define bM4_TMRA3_CCONR6_HICP4 (*((volatile unsigned int *)(0x422B22A4UL)))
#define bM4_TMRA3_CCONR6_NOFIENCP (*((volatile unsigned int *)(0x422B22B0UL)))
#define bM4_TMRA3_CCONR6_NOFICKCP0 (*((volatile unsigned int *)(0x422B22B4UL)))
#define bM4_TMRA3_CCONR6_NOFICKCP1 (*((volatile unsigned int *)(0x422B22B8UL)))
#define bM4_TMRA3_CCONR7_CAPMDA (*((volatile unsigned int *)(0x422B2300UL)))
#define bM4_TMRA3_CCONR7_HICP0 (*((volatile unsigned int *)(0x422B2310UL)))
#define bM4_TMRA3_CCONR7_HICP1 (*((volatile unsigned int *)(0x422B2314UL)))
#define bM4_TMRA3_CCONR7_HICP2 (*((volatile unsigned int *)(0x422B2318UL)))
#define bM4_TMRA3_CCONR7_HICP3 (*((volatile unsigned int *)(0x422B2320UL)))
#define bM4_TMRA3_CCONR7_HICP4 (*((volatile unsigned int *)(0x422B2324UL)))
#define bM4_TMRA3_CCONR7_NOFIENCP (*((volatile unsigned int *)(0x422B2330UL)))
#define bM4_TMRA3_CCONR7_NOFICKCP0 (*((volatile unsigned int *)(0x422B2334UL)))
#define bM4_TMRA3_CCONR7_NOFICKCP1 (*((volatile unsigned int *)(0x422B2338UL)))
#define bM4_TMRA3_CCONR8_CAPMDA (*((volatile unsigned int *)(0x422B2380UL)))
#define bM4_TMRA3_CCONR8_HICP0 (*((volatile unsigned int *)(0x422B2390UL)))
#define bM4_TMRA3_CCONR8_HICP1 (*((volatile unsigned int *)(0x422B2394UL)))
#define bM4_TMRA3_CCONR8_HICP2 (*((volatile unsigned int *)(0x422B2398UL)))
#define bM4_TMRA3_CCONR8_HICP3 (*((volatile unsigned int *)(0x422B23A0UL)))
#define bM4_TMRA3_CCONR8_HICP4 (*((volatile unsigned int *)(0x422B23A4UL)))
#define bM4_TMRA3_CCONR8_NOFIENCP (*((volatile unsigned int *)(0x422B23B0UL)))
#define bM4_TMRA3_CCONR8_NOFICKCP0 (*((volatile unsigned int *)(0x422B23B4UL)))
#define bM4_TMRA3_CCONR8_NOFICKCP1 (*((volatile unsigned int *)(0x422B23B8UL)))
#define bM4_TMRA3_PCONR1_STAC0 (*((volatile unsigned int *)(0x422B2800UL)))
#define bM4_TMRA3_PCONR1_STAC1 (*((volatile unsigned int *)(0x422B2804UL)))
#define bM4_TMRA3_PCONR1_STPC0 (*((volatile unsigned int *)(0x422B2808UL)))
#define bM4_TMRA3_PCONR1_STPC1 (*((volatile unsigned int *)(0x422B280CUL)))
#define bM4_TMRA3_PCONR1_CMPC0 (*((volatile unsigned int *)(0x422B2810UL)))
#define bM4_TMRA3_PCONR1_CMPC1 (*((volatile unsigned int *)(0x422B2814UL)))
#define bM4_TMRA3_PCONR1_PERC0 (*((volatile unsigned int *)(0x422B2818UL)))
#define bM4_TMRA3_PCONR1_PERC1 (*((volatile unsigned int *)(0x422B281CUL)))
#define bM4_TMRA3_PCONR1_FORC0 (*((volatile unsigned int *)(0x422B2820UL)))
#define bM4_TMRA3_PCONR1_FORC1 (*((volatile unsigned int *)(0x422B2824UL)))
#define bM4_TMRA3_PCONR1_OUTEN (*((volatile unsigned int *)(0x422B2830UL)))
#define bM4_TMRA3_PCONR2_STAC0 (*((volatile unsigned int *)(0x422B2880UL)))
#define bM4_TMRA3_PCONR2_STAC1 (*((volatile unsigned int *)(0x422B2884UL)))
#define bM4_TMRA3_PCONR2_STPC0 (*((volatile unsigned int *)(0x422B2888UL)))
#define bM4_TMRA3_PCONR2_STPC1 (*((volatile unsigned int *)(0x422B288CUL)))
#define bM4_TMRA3_PCONR2_CMPC0 (*((volatile unsigned int *)(0x422B2890UL)))
#define bM4_TMRA3_PCONR2_CMPC1 (*((volatile unsigned int *)(0x422B2894UL)))
#define bM4_TMRA3_PCONR2_PERC0 (*((volatile unsigned int *)(0x422B2898UL)))
#define bM4_TMRA3_PCONR2_PERC1 (*((volatile unsigned int *)(0x422B289CUL)))
#define bM4_TMRA3_PCONR2_FORC0 (*((volatile unsigned int *)(0x422B28A0UL)))
#define bM4_TMRA3_PCONR2_FORC1 (*((volatile unsigned int *)(0x422B28A4UL)))
#define bM4_TMRA3_PCONR2_OUTEN (*((volatile unsigned int *)(0x422B28B0UL)))
#define bM4_TMRA3_PCONR3_STAC0 (*((volatile unsigned int *)(0x422B2900UL)))
#define bM4_TMRA3_PCONR3_STAC1 (*((volatile unsigned int *)(0x422B2904UL)))
#define bM4_TMRA3_PCONR3_STPC0 (*((volatile unsigned int *)(0x422B2908UL)))
#define bM4_TMRA3_PCONR3_STPC1 (*((volatile unsigned int *)(0x422B290CUL)))
#define bM4_TMRA3_PCONR3_CMPC0 (*((volatile unsigned int *)(0x422B2910UL)))
#define bM4_TMRA3_PCONR3_CMPC1 (*((volatile unsigned int *)(0x422B2914UL)))
#define bM4_TMRA3_PCONR3_PERC0 (*((volatile unsigned int *)(0x422B2918UL)))
#define bM4_TMRA3_PCONR3_PERC1 (*((volatile unsigned int *)(0x422B291CUL)))
#define bM4_TMRA3_PCONR3_FORC0 (*((volatile unsigned int *)(0x422B2920UL)))
#define bM4_TMRA3_PCONR3_FORC1 (*((volatile unsigned int *)(0x422B2924UL)))
#define bM4_TMRA3_PCONR3_OUTEN (*((volatile unsigned int *)(0x422B2930UL)))
#define bM4_TMRA3_PCONR4_STAC0 (*((volatile unsigned int *)(0x422B2980UL)))
#define bM4_TMRA3_PCONR4_STAC1 (*((volatile unsigned int *)(0x422B2984UL)))
#define bM4_TMRA3_PCONR4_STPC0 (*((volatile unsigned int *)(0x422B2988UL)))
#define bM4_TMRA3_PCONR4_STPC1 (*((volatile unsigned int *)(0x422B298CUL)))
#define bM4_TMRA3_PCONR4_CMPC0 (*((volatile unsigned int *)(0x422B2990UL)))
#define bM4_TMRA3_PCONR4_CMPC1 (*((volatile unsigned int *)(0x422B2994UL)))
#define bM4_TMRA3_PCONR4_PERC0 (*((volatile unsigned int *)(0x422B2998UL)))
#define bM4_TMRA3_PCONR4_PERC1 (*((volatile unsigned int *)(0x422B299CUL)))
#define bM4_TMRA3_PCONR4_FORC0 (*((volatile unsigned int *)(0x422B29A0UL)))
#define bM4_TMRA3_PCONR4_FORC1 (*((volatile unsigned int *)(0x422B29A4UL)))
#define bM4_TMRA3_PCONR4_OUTEN (*((volatile unsigned int *)(0x422B29B0UL)))
#define bM4_TMRA3_PCONR5_STAC0 (*((volatile unsigned int *)(0x422B2A00UL)))
#define bM4_TMRA3_PCONR5_STAC1 (*((volatile unsigned int *)(0x422B2A04UL)))
#define bM4_TMRA3_PCONR5_STPC0 (*((volatile unsigned int *)(0x422B2A08UL)))
#define bM4_TMRA3_PCONR5_STPC1 (*((volatile unsigned int *)(0x422B2A0CUL)))
#define bM4_TMRA3_PCONR5_CMPC0 (*((volatile unsigned int *)(0x422B2A10UL)))
#define bM4_TMRA3_PCONR5_CMPC1 (*((volatile unsigned int *)(0x422B2A14UL)))
#define bM4_TMRA3_PCONR5_PERC0 (*((volatile unsigned int *)(0x422B2A18UL)))
#define bM4_TMRA3_PCONR5_PERC1 (*((volatile unsigned int *)(0x422B2A1CUL)))
#define bM4_TMRA3_PCONR5_FORC0 (*((volatile unsigned int *)(0x422B2A20UL)))
#define bM4_TMRA3_PCONR5_FORC1 (*((volatile unsigned int *)(0x422B2A24UL)))
#define bM4_TMRA3_PCONR5_OUTEN (*((volatile unsigned int *)(0x422B2A30UL)))
#define bM4_TMRA3_PCONR6_STAC0 (*((volatile unsigned int *)(0x422B2A80UL)))
#define bM4_TMRA3_PCONR6_STAC1 (*((volatile unsigned int *)(0x422B2A84UL)))
#define bM4_TMRA3_PCONR6_STPC0 (*((volatile unsigned int *)(0x422B2A88UL)))
#define bM4_TMRA3_PCONR6_STPC1 (*((volatile unsigned int *)(0x422B2A8CUL)))
#define bM4_TMRA3_PCONR6_CMPC0 (*((volatile unsigned int *)(0x422B2A90UL)))
#define bM4_TMRA3_PCONR6_CMPC1 (*((volatile unsigned int *)(0x422B2A94UL)))
#define bM4_TMRA3_PCONR6_PERC0 (*((volatile unsigned int *)(0x422B2A98UL)))
#define bM4_TMRA3_PCONR6_PERC1 (*((volatile unsigned int *)(0x422B2A9CUL)))
#define bM4_TMRA3_PCONR6_FORC0 (*((volatile unsigned int *)(0x422B2AA0UL)))
#define bM4_TMRA3_PCONR6_FORC1 (*((volatile unsigned int *)(0x422B2AA4UL)))
#define bM4_TMRA3_PCONR6_OUTEN (*((volatile unsigned int *)(0x422B2AB0UL)))
#define bM4_TMRA3_PCONR7_STAC0 (*((volatile unsigned int *)(0x422B2B00UL)))
#define bM4_TMRA3_PCONR7_STAC1 (*((volatile unsigned int *)(0x422B2B04UL)))
#define bM4_TMRA3_PCONR7_STPC0 (*((volatile unsigned int *)(0x422B2B08UL)))
#define bM4_TMRA3_PCONR7_STPC1 (*((volatile unsigned int *)(0x422B2B0CUL)))
#define bM4_TMRA3_PCONR7_CMPC0 (*((volatile unsigned int *)(0x422B2B10UL)))
#define bM4_TMRA3_PCONR7_CMPC1 (*((volatile unsigned int *)(0x422B2B14UL)))
#define bM4_TMRA3_PCONR7_PERC0 (*((volatile unsigned int *)(0x422B2B18UL)))
#define bM4_TMRA3_PCONR7_PERC1 (*((volatile unsigned int *)(0x422B2B1CUL)))
#define bM4_TMRA3_PCONR7_FORC0 (*((volatile unsigned int *)(0x422B2B20UL)))
#define bM4_TMRA3_PCONR7_FORC1 (*((volatile unsigned int *)(0x422B2B24UL)))
#define bM4_TMRA3_PCONR7_OUTEN (*((volatile unsigned int *)(0x422B2B30UL)))
#define bM4_TMRA3_PCONR8_STAC0 (*((volatile unsigned int *)(0x422B2B80UL)))
#define bM4_TMRA3_PCONR8_STAC1 (*((volatile unsigned int *)(0x422B2B84UL)))
#define bM4_TMRA3_PCONR8_STPC0 (*((volatile unsigned int *)(0x422B2B88UL)))
#define bM4_TMRA3_PCONR8_STPC1 (*((volatile unsigned int *)(0x422B2B8CUL)))
#define bM4_TMRA3_PCONR8_CMPC0 (*((volatile unsigned int *)(0x422B2B90UL)))
#define bM4_TMRA3_PCONR8_CMPC1 (*((volatile unsigned int *)(0x422B2B94UL)))
#define bM4_TMRA3_PCONR8_PERC0 (*((volatile unsigned int *)(0x422B2B98UL)))
#define bM4_TMRA3_PCONR8_PERC1 (*((volatile unsigned int *)(0x422B2B9CUL)))
#define bM4_TMRA3_PCONR8_FORC0 (*((volatile unsigned int *)(0x422B2BA0UL)))
#define bM4_TMRA3_PCONR8_FORC1 (*((volatile unsigned int *)(0x422B2BA4UL)))
#define bM4_TMRA3_PCONR8_OUTEN (*((volatile unsigned int *)(0x422B2BB0UL)))
#define bM4_TMRA4_CNTER_CNT0 (*((volatile unsigned int *)(0x422B8000UL)))
#define bM4_TMRA4_CNTER_CNT1 (*((volatile unsigned int *)(0x422B8004UL)))
#define bM4_TMRA4_CNTER_CNT2 (*((volatile unsigned int *)(0x422B8008UL)))
#define bM4_TMRA4_CNTER_CNT3 (*((volatile unsigned int *)(0x422B800CUL)))
#define bM4_TMRA4_CNTER_CNT4 (*((volatile unsigned int *)(0x422B8010UL)))
#define bM4_TMRA4_CNTER_CNT5 (*((volatile unsigned int *)(0x422B8014UL)))
#define bM4_TMRA4_CNTER_CNT6 (*((volatile unsigned int *)(0x422B8018UL)))
#define bM4_TMRA4_CNTER_CNT7 (*((volatile unsigned int *)(0x422B801CUL)))
#define bM4_TMRA4_CNTER_CNT8 (*((volatile unsigned int *)(0x422B8020UL)))
#define bM4_TMRA4_CNTER_CNT9 (*((volatile unsigned int *)(0x422B8024UL)))
#define bM4_TMRA4_CNTER_CNT10 (*((volatile unsigned int *)(0x422B8028UL)))
#define bM4_TMRA4_CNTER_CNT11 (*((volatile unsigned int *)(0x422B802CUL)))
#define bM4_TMRA4_CNTER_CNT12 (*((volatile unsigned int *)(0x422B8030UL)))
#define bM4_TMRA4_CNTER_CNT13 (*((volatile unsigned int *)(0x422B8034UL)))
#define bM4_TMRA4_CNTER_CNT14 (*((volatile unsigned int *)(0x422B8038UL)))
#define bM4_TMRA4_CNTER_CNT15 (*((volatile unsigned int *)(0x422B803CUL)))
#define bM4_TMRA4_PERAR_PER0 (*((volatile unsigned int *)(0x422B8080UL)))
#define bM4_TMRA4_PERAR_PER1 (*((volatile unsigned int *)(0x422B8084UL)))
#define bM4_TMRA4_PERAR_PER2 (*((volatile unsigned int *)(0x422B8088UL)))
#define bM4_TMRA4_PERAR_PER3 (*((volatile unsigned int *)(0x422B808CUL)))
#define bM4_TMRA4_PERAR_PER4 (*((volatile unsigned int *)(0x422B8090UL)))
#define bM4_TMRA4_PERAR_PER5 (*((volatile unsigned int *)(0x422B8094UL)))
#define bM4_TMRA4_PERAR_PER6 (*((volatile unsigned int *)(0x422B8098UL)))
#define bM4_TMRA4_PERAR_PER7 (*((volatile unsigned int *)(0x422B809CUL)))
#define bM4_TMRA4_PERAR_PER8 (*((volatile unsigned int *)(0x422B80A0UL)))
