MarlinFirmware/Marlin/Marlin/lib/h32_core/main/hdsc32core/common/hc32f46x.h
#define bM4_TMRA4_PCONR2_STPC0 (*((volatile unsigned int *)(0x422BA888UL)))
#define bM4_TMRA4_PCONR2_STPC1 (*((volatile unsigned int *)(0x422BA88CUL)))
#define bM4_TMRA4_PCONR2_CMPC0 (*((volatile unsigned int *)(0x422BA890UL)))
#define bM4_TMRA4_PCONR2_CMPC1 (*((volatile unsigned int *)(0x422BA894UL)))
#define bM4_TMRA4_PCONR2_PERC0 (*((volatile unsigned int *)(0x422BA898UL)))
#define bM4_TMRA4_PCONR2_PERC1 (*((volatile unsigned int *)(0x422BA89CUL)))
#define bM4_TMRA4_PCONR2_FORC0 (*((volatile unsigned int *)(0x422BA8A0UL)))
#define bM4_TMRA4_PCONR2_FORC1 (*((volatile unsigned int *)(0x422BA8A4UL)))
#define bM4_TMRA4_PCONR2_OUTEN (*((volatile unsigned int *)(0x422BA8B0UL)))
#define bM4_TMRA4_PCONR3_STAC0 (*((volatile unsigned int *)(0x422BA900UL)))
#define bM4_TMRA4_PCONR3_STAC1 (*((volatile unsigned int *)(0x422BA904UL)))
#define bM4_TMRA4_PCONR3_STPC0 (*((volatile unsigned int *)(0x422BA908UL)))
#define bM4_TMRA4_PCONR3_STPC1 (*((volatile unsigned int *)(0x422BA90CUL)))
#define bM4_TMRA4_PCONR3_CMPC0 (*((volatile unsigned int *)(0x422BA910UL)))
#define bM4_TMRA4_PCONR3_CMPC1 (*((volatile unsigned int *)(0x422BA914UL)))
#define bM4_TMRA4_PCONR3_PERC0 (*((volatile unsigned int *)(0x422BA918UL)))
#define bM4_TMRA4_PCONR3_PERC1 (*((volatile unsigned int *)(0x422BA91CUL)))
#define bM4_TMRA4_PCONR3_FORC0 (*((volatile unsigned int *)(0x422BA920UL)))
#define bM4_TMRA4_PCONR3_FORC1 (*((volatile unsigned int *)(0x422BA924UL)))
#define bM4_TMRA4_PCONR3_OUTEN (*((volatile unsigned int *)(0x422BA930UL)))
#define bM4_TMRA4_PCONR4_STAC0 (*((volatile unsigned int *)(0x422BA980UL)))
#define bM4_TMRA4_PCONR4_STAC1 (*((volatile unsigned int *)(0x422BA984UL)))
#define bM4_TMRA4_PCONR4_STPC0 (*((volatile unsigned int *)(0x422BA988UL)))
#define bM4_TMRA4_PCONR4_STPC1 (*((volatile unsigned int *)(0x422BA98CUL)))
#define bM4_TMRA4_PCONR4_CMPC0 (*((volatile unsigned int *)(0x422BA990UL)))
#define bM4_TMRA4_PCONR4_CMPC1 (*((volatile unsigned int *)(0x422BA994UL)))
#define bM4_TMRA4_PCONR4_PERC0 (*((volatile unsigned int *)(0x422BA998UL)))
#define bM4_TMRA4_PCONR4_PERC1 (*((volatile unsigned int *)(0x422BA99CUL)))
#define bM4_TMRA4_PCONR4_FORC0 (*((volatile unsigned int *)(0x422BA9A0UL)))
#define bM4_TMRA4_PCONR4_FORC1 (*((volatile unsigned int *)(0x422BA9A4UL)))
#define bM4_TMRA4_PCONR4_OUTEN (*((volatile unsigned int *)(0x422BA9B0UL)))
#define bM4_TMRA4_PCONR5_STAC0 (*((volatile unsigned int *)(0x422BAA00UL)))
#define bM4_TMRA4_PCONR5_STAC1 (*((volatile unsigned int *)(0x422BAA04UL)))
#define bM4_TMRA4_PCONR5_STPC0 (*((volatile unsigned int *)(0x422BAA08UL)))
#define bM4_TMRA4_PCONR5_STPC1 (*((volatile unsigned int *)(0x422BAA0CUL)))
#define bM4_TMRA4_PCONR5_CMPC0 (*((volatile unsigned int *)(0x422BAA10UL)))
#define bM4_TMRA4_PCONR5_CMPC1 (*((volatile unsigned int *)(0x422BAA14UL)))
#define bM4_TMRA4_PCONR5_PERC0 (*((volatile unsigned int *)(0x422BAA18UL)))
#define bM4_TMRA4_PCONR5_PERC1 (*((volatile unsigned int *)(0x422BAA1CUL)))
#define bM4_TMRA4_PCONR5_FORC0 (*((volatile unsigned int *)(0x422BAA20UL)))
#define bM4_TMRA4_PCONR5_FORC1 (*((volatile unsigned int *)(0x422BAA24UL)))
#define bM4_TMRA4_PCONR5_OUTEN (*((volatile unsigned int *)(0x422BAA30UL)))
#define bM4_TMRA4_PCONR6_STAC0 (*((volatile unsigned int *)(0x422BAA80UL)))
#define bM4_TMRA4_PCONR6_STAC1 (*((volatile unsigned int *)(0x422BAA84UL)))
#define bM4_TMRA4_PCONR6_STPC0 (*((volatile unsigned int *)(0x422BAA88UL)))
#define bM4_TMRA4_PCONR6_STPC1 (*((volatile unsigned int *)(0x422BAA8CUL)))
#define bM4_TMRA4_PCONR6_CMPC0 (*((volatile unsigned int *)(0x422BAA90UL)))
#define bM4_TMRA4_PCONR6_CMPC1 (*((volatile unsigned int *)(0x422BAA94UL)))
#define bM4_TMRA4_PCONR6_PERC0 (*((volatile unsigned int *)(0x422BAA98UL)))
#define bM4_TMRA4_PCONR6_PERC1 (*((volatile unsigned int *)(0x422BAA9CUL)))
#define bM4_TMRA4_PCONR6_FORC0 (*((volatile unsigned int *)(0x422BAAA0UL)))
#define bM4_TMRA4_PCONR6_FORC1 (*((volatile unsigned int *)(0x422BAAA4UL)))
#define bM4_TMRA4_PCONR6_OUTEN (*((volatile unsigned int *)(0x422BAAB0UL)))
#define bM4_TMRA4_PCONR7_STAC0 (*((volatile unsigned int *)(0x422BAB00UL)))
#define bM4_TMRA4_PCONR7_STAC1 (*((volatile unsigned int *)(0x422BAB04UL)))
#define bM4_TMRA4_PCONR7_STPC0 (*((volatile unsigned int *)(0x422BAB08UL)))
#define bM4_TMRA4_PCONR7_STPC1 (*((volatile unsigned int *)(0x422BAB0CUL)))
#define bM4_TMRA4_PCONR7_CMPC0 (*((volatile unsigned int *)(0x422BAB10UL)))
#define bM4_TMRA4_PCONR7_CMPC1 (*((volatile unsigned int *)(0x422BAB14UL)))
#define bM4_TMRA4_PCONR7_PERC0 (*((volatile unsigned int *)(0x422BAB18UL)))
#define bM4_TMRA4_PCONR7_PERC1 (*((volatile unsigned int *)(0x422BAB1CUL)))
#define bM4_TMRA4_PCONR7_FORC0 (*((volatile unsigned int *)(0x422BAB20UL)))
#define bM4_TMRA4_PCONR7_FORC1 (*((volatile unsigned int *)(0x422BAB24UL)))
#define bM4_TMRA4_PCONR7_OUTEN (*((volatile unsigned int *)(0x422BAB30UL)))
#define bM4_TMRA4_PCONR8_STAC0 (*((volatile unsigned int *)(0x422BAB80UL)))
#define bM4_TMRA4_PCONR8_STAC1 (*((volatile unsigned int *)(0x422BAB84UL)))
#define bM4_TMRA4_PCONR8_STPC0 (*((volatile unsigned int *)(0x422BAB88UL)))
#define bM4_TMRA4_PCONR8_STPC1 (*((volatile unsigned int *)(0x422BAB8CUL)))
#define bM4_TMRA4_PCONR8_CMPC0 (*((volatile unsigned int *)(0x422BAB90UL)))
#define bM4_TMRA4_PCONR8_CMPC1 (*((volatile unsigned int *)(0x422BAB94UL)))
#define bM4_TMRA4_PCONR8_PERC0 (*((volatile unsigned int *)(0x422BAB98UL)))
#define bM4_TMRA4_PCONR8_PERC1 (*((volatile unsigned int *)(0x422BAB9CUL)))
#define bM4_TMRA4_PCONR8_FORC0 (*((volatile unsigned int *)(0x422BABA0UL)))
#define bM4_TMRA4_PCONR8_FORC1 (*((volatile unsigned int *)(0x422BABA4UL)))
#define bM4_TMRA4_PCONR8_OUTEN (*((volatile unsigned int *)(0x422BABB0UL)))
#define bM4_TMRA5_CNTER_CNT0 (*((volatile unsigned int *)(0x422C0000UL)))
#define bM4_TMRA5_CNTER_CNT1 (*((volatile unsigned int *)(0x422C0004UL)))
#define bM4_TMRA5_CNTER_CNT2 (*((volatile unsigned int *)(0x422C0008UL)))
#define bM4_TMRA5_CNTER_CNT3 (*((volatile unsigned int *)(0x422C000CUL)))
#define bM4_TMRA5_CNTER_CNT4 (*((volatile unsigned int *)(0x422C0010UL)))
#define bM4_TMRA5_CNTER_CNT5 (*((volatile unsigned int *)(0x422C0014UL)))
#define bM4_TMRA5_CNTER_CNT6 (*((volatile unsigned int *)(0x422C0018UL)))
#define bM4_TMRA5_CNTER_CNT7 (*((volatile unsigned int *)(0x422C001CUL)))
#define bM4_TMRA5_CNTER_CNT8 (*((volatile unsigned int *)(0x422C0020UL)))
#define bM4_TMRA5_CNTER_CNT9 (*((volatile unsigned int *)(0x422C0024UL)))
#define bM4_TMRA5_CNTER_CNT10 (*((volatile unsigned int *)(0x422C0028UL)))
#define bM4_TMRA5_CNTER_CNT11 (*((volatile unsigned int *)(0x422C002CUL)))
#define bM4_TMRA5_CNTER_CNT12 (*((volatile unsigned int *)(0x422C0030UL)))
#define bM4_TMRA5_CNTER_CNT13 (*((volatile unsigned int *)(0x422C0034UL)))
#define bM4_TMRA5_CNTER_CNT14 (*((volatile unsigned int *)(0x422C0038UL)))
#define bM4_TMRA5_CNTER_CNT15 (*((volatile unsigned int *)(0x422C003CUL)))
#define bM4_TMRA5_PERAR_PER0 (*((volatile unsigned int *)(0x422C0080UL)))
#define bM4_TMRA5_PERAR_PER1 (*((volatile unsigned int *)(0x422C0084UL)))
#define bM4_TMRA5_PERAR_PER2 (*((volatile unsigned int *)(0x422C0088UL)))
#define bM4_TMRA5_PERAR_PER3 (*((volatile unsigned int *)(0x422C008CUL)))
#define bM4_TMRA5_PERAR_PER4 (*((volatile unsigned int *)(0x422C0090UL)))
#define bM4_TMRA5_PERAR_PER5 (*((volatile unsigned int *)(0x422C0094UL)))
#define bM4_TMRA5_PERAR_PER6 (*((volatile unsigned int *)(0x422C0098UL)))
#define bM4_TMRA5_PERAR_PER7 (*((volatile unsigned int *)(0x422C009CUL)))
#define bM4_TMRA5_PERAR_PER8 (*((volatile unsigned int *)(0x422C00A0UL)))
#define bM4_TMRA5_PERAR_PER9 (*((volatile unsigned int *)(0x422C00A4UL)))
#define bM4_TMRA5_PERAR_PER10 (*((volatile unsigned int *)(0x422C00A8UL)))
#define bM4_TMRA5_PERAR_PER11 (*((volatile unsigned int *)(0x422C00ACUL)))
#define bM4_TMRA5_PERAR_PER12 (*((volatile unsigned int *)(0x422C00B0UL)))
#define bM4_TMRA5_PERAR_PER13 (*((volatile unsigned int *)(0x422C00B4UL)))
#define bM4_TMRA5_PERAR_PER14 (*((volatile unsigned int *)(0x422C00B8UL)))
#define bM4_TMRA5_PERAR_PER15 (*((volatile unsigned int *)(0x422C00BCUL)))
#define bM4_TMRA5_CMPAR1_CMP0 (*((volatile unsigned int *)(0x422C0800UL)))
#define bM4_TMRA5_CMPAR1_CMP1 (*((volatile unsigned int *)(0x422C0804UL)))
#define bM4_TMRA5_CMPAR1_CMP2 (*((volatile unsigned int *)(0x422C0808UL)))
#define bM4_TMRA5_CMPAR1_CMP3 (*((volatile unsigned int *)(0x422C080CUL)))
#define bM4_TMRA5_CMPAR1_CMP4 (*((volatile unsigned int *)(0x422C0810UL)))
#define bM4_TMRA5_CMPAR1_CMP5 (*((volatile unsigned int *)(0x422C0814UL)))
#define bM4_TMRA5_CMPAR1_CMP6 (*((volatile unsigned int *)(0x422C0818UL)))
#define bM4_TMRA5_CMPAR1_CMP7 (*((volatile unsigned int *)(0x422C081CUL)))
#define bM4_TMRA5_CMPAR1_CMP8 (*((volatile unsigned int *)(0x422C0820UL)))
#define bM4_TMRA5_CMPAR1_CMP9 (*((volatile unsigned int *)(0x422C0824UL)))
#define bM4_TMRA5_CMPAR1_CMP10 (*((volatile unsigned int *)(0x422C0828UL)))
#define bM4_TMRA5_CMPAR1_CMP11 (*((volatile unsigned int *)(0x422C082CUL)))
#define bM4_TMRA5_CMPAR1_CMP12 (*((volatile unsigned int *)(0x422C0830UL)))
#define bM4_TMRA5_CMPAR1_CMP13 (*((volatile unsigned int *)(0x422C0834UL)))
#define bM4_TMRA5_CMPAR1_CMP14 (*((volatile unsigned int *)(0x422C0838UL)))
#define bM4_TMRA5_CMPAR1_CMP15 (*((volatile unsigned int *)(0x422C083CUL)))
#define bM4_TMRA5_CMPAR2_CMP0 (*((volatile unsigned int *)(0x422C0880UL)))
#define bM4_TMRA5_CMPAR2_CMP1 (*((volatile unsigned int *)(0x422C0884UL)))
#define bM4_TMRA5_CMPAR2_CMP2 (*((volatile unsigned int *)(0x422C0888UL)))
#define bM4_TMRA5_CMPAR2_CMP3 (*((volatile unsigned int *)(0x422C088CUL)))
#define bM4_TMRA5_CMPAR2_CMP4 (*((volatile unsigned int *)(0x422C0890UL)))
#define bM4_TMRA5_CMPAR2_CMP5 (*((volatile unsigned int *)(0x422C0894UL)))
#define bM4_TMRA5_CMPAR2_CMP6 (*((volatile unsigned int *)(0x422C0898UL)))
#define bM4_TMRA5_CMPAR2_CMP7 (*((volatile unsigned int *)(0x422C089CUL)))
#define bM4_TMRA5_CMPAR2_CMP8 (*((volatile unsigned int *)(0x422C08A0UL)))
#define bM4_TMRA5_CMPAR2_CMP9 (*((volatile unsigned int *)(0x422C08A4UL)))
#define bM4_TMRA5_CMPAR2_CMP10 (*((volatile unsigned int *)(0x422C08A8UL)))
#define bM4_TMRA5_CMPAR2_CMP11 (*((volatile unsigned int *)(0x422C08ACUL)))
#define bM4_TMRA5_CMPAR2_CMP12 (*((volatile unsigned int *)(0x422C08B0UL)))
#define bM4_TMRA5_CMPAR2_CMP13 (*((volatile unsigned int *)(0x422C08B4UL)))
#define bM4_TMRA5_CMPAR2_CMP14 (*((volatile unsigned int *)(0x422C08B8UL)))
#define bM4_TMRA5_CMPAR2_CMP15 (*((volatile unsigned int *)(0x422C08BCUL)))
#define bM4_TMRA5_CMPAR3_CMP0 (*((volatile unsigned int *)(0x422C0900UL)))
#define bM4_TMRA5_CMPAR3_CMP1 (*((volatile unsigned int *)(0x422C0904UL)))
#define bM4_TMRA5_CMPAR3_CMP2 (*((volatile unsigned int *)(0x422C0908UL)))
#define bM4_TMRA5_CMPAR3_CMP3 (*((volatile unsigned int *)(0x422C090CUL)))
#define bM4_TMRA5_CMPAR3_CMP4 (*((volatile unsigned int *)(0x422C0910UL)))
#define bM4_TMRA5_CMPAR3_CMP5 (*((volatile unsigned int *)(0x422C0914UL)))
#define bM4_TMRA5_CMPAR3_CMP6 (*((volatile unsigned int *)(0x422C0918UL)))
#define bM4_TMRA5_CMPAR3_CMP7 (*((volatile unsigned int *)(0x422C091CUL)))
#define bM4_TMRA5_CMPAR3_CMP8 (*((volatile unsigned int *)(0x422C0920UL)))
#define bM4_TMRA5_CMPAR3_CMP9 (*((volatile unsigned int *)(0x422C0924UL)))
#define bM4_TMRA5_CMPAR3_CMP10 (*((volatile unsigned int *)(0x422C0928UL)))
#define bM4_TMRA5_CMPAR3_CMP11 (*((volatile unsigned int *)(0x422C092CUL)))
#define bM4_TMRA5_CMPAR3_CMP12 (*((volatile unsigned int *)(0x422C0930UL)))
#define bM4_TMRA5_CMPAR3_CMP13 (*((volatile unsigned int *)(0x422C0934UL)))
#define bM4_TMRA5_CMPAR3_CMP14 (*((volatile unsigned int *)(0x422C0938UL)))
#define bM4_TMRA5_CMPAR3_CMP15 (*((volatile unsigned int *)(0x422C093CUL)))
#define bM4_TMRA5_CMPAR4_CMP0 (*((volatile unsigned int *)(0x422C0980UL)))
#define bM4_TMRA5_CMPAR4_CMP1 (*((volatile unsigned int *)(0x422C0984UL)))
#define bM4_TMRA5_CMPAR4_CMP2 (*((volatile unsigned int *)(0x422C0988UL)))
#define bM4_TMRA5_CMPAR4_CMP3 (*((volatile unsigned int *)(0x422C098CUL)))
#define bM4_TMRA5_CMPAR4_CMP4 (*((volatile unsigned int *)(0x422C0990UL)))
#define bM4_TMRA5_CMPAR4_CMP5 (*((volatile unsigned int *)(0x422C0994UL)))
#define bM4_TMRA5_CMPAR4_CMP6 (*((volatile unsigned int *)(0x422C0998UL)))
#define bM4_TMRA5_CMPAR4_CMP7 (*((volatile unsigned int *)(0x422C099CUL)))
#define bM4_TMRA5_CMPAR4_CMP8 (*((volatile unsigned int *)(0x422C09A0UL)))
#define bM4_TMRA5_CMPAR4_CMP9 (*((volatile unsigned int *)(0x422C09A4UL)))
#define bM4_TMRA5_CMPAR4_CMP10 (*((volatile unsigned int *)(0x422C09A8UL)))
#define bM4_TMRA5_CMPAR4_CMP11 (*((volatile unsigned int *)(0x422C09ACUL)))
#define bM4_TMRA5_CMPAR4_CMP12 (*((volatile unsigned int *)(0x422C09B0UL)))
#define bM4_TMRA5_CMPAR4_CMP13 (*((volatile unsigned int *)(0x422C09B4UL)))
#define bM4_TMRA5_CMPAR4_CMP14 (*((volatile unsigned int *)(0x422C09B8UL)))
#define bM4_TMRA5_CMPAR4_CMP15 (*((volatile unsigned int *)(0x422C09BCUL)))
#define bM4_TMRA5_CMPAR5_CMP0 (*((volatile unsigned int *)(0x422C0A00UL)))
#define bM4_TMRA5_CMPAR5_CMP1 (*((volatile unsigned int *)(0x422C0A04UL)))
#define bM4_TMRA5_CMPAR5_CMP2 (*((volatile unsigned int *)(0x422C0A08UL)))
#define bM4_TMRA5_CMPAR5_CMP3 (*((volatile unsigned int *)(0x422C0A0CUL)))
#define bM4_TMRA5_CMPAR5_CMP4 (*((volatile unsigned int *)(0x422C0A10UL)))
#define bM4_TMRA5_CMPAR5_CMP5 (*((volatile unsigned int *)(0x422C0A14UL)))
#define bM4_TMRA5_CMPAR5_CMP6 (*((volatile unsigned int *)(0x422C0A18UL)))
#define bM4_TMRA5_CMPAR5_CMP7 (*((volatile unsigned int *)(0x422C0A1CUL)))
#define bM4_TMRA5_CMPAR5_CMP8 (*((volatile unsigned int *)(0x422C0A20UL)))
#define bM4_TMRA5_CMPAR5_CMP9 (*((volatile unsigned int *)(0x422C0A24UL)))
#define bM4_TMRA5_CMPAR5_CMP10 (*((volatile unsigned int *)(0x422C0A28UL)))
#define bM4_TMRA5_CMPAR5_CMP11 (*((volatile unsigned int *)(0x422C0A2CUL)))
#define bM4_TMRA5_CMPAR5_CMP12 (*((volatile unsigned int *)(0x422C0A30UL)))
#define bM4_TMRA5_CMPAR5_CMP13 (*((volatile unsigned int *)(0x422C0A34UL)))
#define bM4_TMRA5_CMPAR5_CMP14 (*((volatile unsigned int *)(0x422C0A38UL)))
#define bM4_TMRA5_CMPAR5_CMP15 (*((volatile unsigned int *)(0x422C0A3CUL)))
#define bM4_TMRA5_CMPAR6_CMP0 (*((volatile unsigned int *)(0x422C0A80UL)))
#define bM4_TMRA5_CMPAR6_CMP1 (*((volatile unsigned int *)(0x422C0A84UL)))
#define bM4_TMRA5_CMPAR6_CMP2 (*((volatile unsigned int *)(0x422C0A88UL)))
#define bM4_TMRA5_CMPAR6_CMP3 (*((volatile unsigned int *)(0x422C0A8CUL)))
#define bM4_TMRA5_CMPAR6_CMP4 (*((volatile unsigned int *)(0x422C0A90UL)))
#define bM4_TMRA5_CMPAR6_CMP5 (*((volatile unsigned int *)(0x422C0A94UL)))
#define bM4_TMRA5_CMPAR6_CMP6 (*((volatile unsigned int *)(0x422C0A98UL)))
#define bM4_TMRA5_CMPAR6_CMP7 (*((volatile unsigned int *)(0x422C0A9CUL)))
#define bM4_TMRA5_CMPAR6_CMP8 (*((volatile unsigned int *)(0x422C0AA0UL)))
#define bM4_TMRA5_CMPAR6_CMP9 (*((volatile unsigned int *)(0x422C0AA4UL)))
#define bM4_TMRA5_CMPAR6_CMP10 (*((volatile unsigned int *)(0x422C0AA8UL)))
#define bM4_TMRA5_CMPAR6_CMP11 (*((volatile unsigned int *)(0x422C0AACUL)))
#define bM4_TMRA5_CMPAR6_CMP12 (*((volatile unsigned int *)(0x422C0AB0UL)))
#define bM4_TMRA5_CMPAR6_CMP13 (*((volatile unsigned int *)(0x422C0AB4UL)))
#define bM4_TMRA5_CMPAR6_CMP14 (*((volatile unsigned int *)(0x422C0AB8UL)))
#define bM4_TMRA5_CMPAR6_CMP15 (*((volatile unsigned int *)(0x422C0ABCUL)))
#define bM4_TMRA5_CMPAR7_CMP0 (*((volatile unsigned int *)(0x422C0B00UL)))
#define bM4_TMRA5_CMPAR7_CMP1 (*((volatile unsigned int *)(0x422C0B04UL)))
#define bM4_TMRA5_CMPAR7_CMP2 (*((volatile unsigned int *)(0x422C0B08UL)))
#define bM4_TMRA5_CMPAR7_CMP3 (*((volatile unsigned int *)(0x422C0B0CUL)))
#define bM4_TMRA5_CMPAR7_CMP4 (*((volatile unsigned int *)(0x422C0B10UL)))
#define bM4_TMRA5_CMPAR7_CMP5 (*((volatile unsigned int *)(0x422C0B14UL)))
#define bM4_TMRA5_CMPAR7_CMP6 (*((volatile unsigned int *)(0x422C0B18UL)))
#define bM4_TMRA5_CMPAR7_CMP7 (*((volatile unsigned int *)(0x422C0B1CUL)))
#define bM4_TMRA5_CMPAR7_CMP8 (*((volatile unsigned int *)(0x422C0B20UL)))
#define bM4_TMRA5_CMPAR7_CMP9 (*((volatile unsigned int *)(0x422C0B24UL)))
#define bM4_TMRA5_CMPAR7_CMP10 (*((volatile unsigned int *)(0x422C0B28UL)))
#define bM4_TMRA5_CMPAR7_CMP11 (*((volatile unsigned int *)(0x422C0B2CUL)))
#define bM4_TMRA5_CMPAR7_CMP12 (*((volatile unsigned int *)(0x422C0B30UL)))
#define bM4_TMRA5_CMPAR7_CMP13 (*((volatile unsigned int *)(0x422C0B34UL)))
#define bM4_TMRA5_CMPAR7_CMP14 (*((volatile unsigned int *)(0x422C0B38UL)))
#define bM4_TMRA5_CMPAR7_CMP15 (*((volatile unsigned int *)(0x422C0B3CUL)))
#define bM4_TMRA5_CMPAR8_CMP0 (*((volatile unsigned int *)(0x422C0B80UL)))
#define bM4_TMRA5_CMPAR8_CMP1 (*((volatile unsigned int *)(0x422C0B84UL)))
#define bM4_TMRA5_CMPAR8_CMP2 (*((volatile unsigned int *)(0x422C0B88UL)))
#define bM4_TMRA5_CMPAR8_CMP3 (*((volatile unsigned int *)(0x422C0B8CUL)))
#define bM4_TMRA5_CMPAR8_CMP4 (*((volatile unsigned int *)(0x422C0B90UL)))
#define bM4_TMRA5_CMPAR8_CMP5 (*((volatile unsigned int *)(0x422C0B94UL)))
#define bM4_TMRA5_CMPAR8_CMP6 (*((volatile unsigned int *)(0x422C0B98UL)))
#define bM4_TMRA5_CMPAR8_CMP7 (*((volatile unsigned int *)(0x422C0B9CUL)))
#define bM4_TMRA5_CMPAR8_CMP8 (*((volatile unsigned int *)(0x422C0BA0UL)))
#define bM4_TMRA5_CMPAR8_CMP9 (*((volatile unsigned int *)(0x422C0BA4UL)))
#define bM4_TMRA5_CMPAR8_CMP10 (*((volatile unsigned int *)(0x422C0BA8UL)))
#define bM4_TMRA5_CMPAR8_CMP11 (*((volatile unsigned int *)(0x422C0BACUL)))
#define bM4_TMRA5_CMPAR8_CMP12 (*((volatile unsigned int *)(0x422C0BB0UL)))
#define bM4_TMRA5_CMPAR8_CMP13 (*((volatile unsigned int *)(0x422C0BB4UL)))
#define bM4_TMRA5_CMPAR8_CMP14 (*((volatile unsigned int *)(0x422C0BB8UL)))
#define bM4_TMRA5_CMPAR8_CMP15 (*((volatile unsigned int *)(0x422C0BBCUL)))
#define bM4_TMRA5_BCSTR_START (*((volatile unsigned int *)(0x422C1000UL)))
#define bM4_TMRA5_BCSTR_DIR (*((volatile unsigned int *)(0x422C1004UL)))
#define bM4_TMRA5_BCSTR_MODE (*((volatile unsigned int *)(0x422C1008UL)))
#define bM4_TMRA5_BCSTR_SYNST (*((volatile unsigned int *)(0x422C100CUL)))
#define bM4_TMRA5_BCSTR_CKDIV0 (*((volatile unsigned int *)(0x422C1010UL)))
#define bM4_TMRA5_BCSTR_CKDIV1 (*((volatile unsigned int *)(0x422C1014UL)))
#define bM4_TMRA5_BCSTR_CKDIV2 (*((volatile unsigned int *)(0x422C1018UL)))
#define bM4_TMRA5_BCSTR_CKDIV3 (*((volatile unsigned int *)(0x422C101CUL)))
#define bM4_TMRA5_BCSTR_ITENOVF (*((volatile unsigned int *)(0x422C1030UL)))
#define bM4_TMRA5_BCSTR_ITENUDF (*((volatile unsigned int *)(0x422C1034UL)))
#define bM4_TMRA5_BCSTR_OVFF (*((volatile unsigned int *)(0x422C1038UL)))
#define bM4_TMRA5_BCSTR_UDFF (*((volatile unsigned int *)(0x422C103CUL)))
#define bM4_TMRA5_HCONR_HSTA0 (*((volatile unsigned int *)(0x422C1080UL)))
#define bM4_TMRA5_HCONR_HSTA1 (*((volatile unsigned int *)(0x422C1084UL)))
#define bM4_TMRA5_HCONR_HSTA2 (*((volatile unsigned int *)(0x422C1088UL)))
#define bM4_TMRA5_HCONR_HSTP0 (*((volatile unsigned int *)(0x422C1090UL)))
#define bM4_TMRA5_HCONR_HSTP1 (*((volatile unsigned int *)(0x422C1094UL)))
#define bM4_TMRA5_HCONR_HSTP2 (*((volatile unsigned int *)(0x422C1098UL)))
#define bM4_TMRA5_HCONR_HCLE0 (*((volatile unsigned int *)(0x422C10A0UL)))
#define bM4_TMRA5_HCONR_HCLE1 (*((volatile unsigned int *)(0x422C10A4UL)))
#define bM4_TMRA5_HCONR_HCLE2 (*((volatile unsigned int *)(0x422C10A8UL)))
#define bM4_TMRA5_HCONR_HCLE3 (*((volatile unsigned int *)(0x422C10B0UL)))
#define bM4_TMRA5_HCONR_HCLE4 (*((volatile unsigned int *)(0x422C10B4UL)))
#define bM4_TMRA5_HCONR_HCLE5 (*((volatile unsigned int *)(0x422C10B8UL)))
#define bM4_TMRA5_HCONR_HCLE6 (*((volatile unsigned int *)(0x422C10BCUL)))
#define bM4_TMRA5_HCUPR_HCUP0 (*((volatile unsigned int *)(0x422C1100UL)))
#define bM4_TMRA5_HCUPR_HCUP1 (*((volatile unsigned int *)(0x422C1104UL)))
#define bM4_TMRA5_HCUPR_HCUP2 (*((volatile unsigned int *)(0x422C1108UL)))
#define bM4_TMRA5_HCUPR_HCUP3 (*((volatile unsigned int *)(0x422C110CUL)))
#define bM4_TMRA5_HCUPR_HCUP4 (*((volatile unsigned int *)(0x422C1110UL)))
#define bM4_TMRA5_HCUPR_HCUP5 (*((volatile unsigned int *)(0x422C1114UL)))
#define bM4_TMRA5_HCUPR_HCUP6 (*((volatile unsigned int *)(0x422C1118UL)))
#define bM4_TMRA5_HCUPR_HCUP7 (*((volatile unsigned int *)(0x422C111CUL)))
#define bM4_TMRA5_HCUPR_HCUP8 (*((volatile unsigned int *)(0x422C1120UL)))
#define bM4_TMRA5_HCUPR_HCUP9 (*((volatile unsigned int *)(0x422C1124UL)))
#define bM4_TMRA5_HCUPR_HCUP10 (*((volatile unsigned int *)(0x422C1128UL)))
#define bM4_TMRA5_HCUPR_HCUP11 (*((volatile unsigned int *)(0x422C112CUL)))
#define bM4_TMRA5_HCUPR_HCUP12 (*((volatile unsigned int *)(0x422C1130UL)))
#define bM4_TMRA5_HCDOR_HCDO0 (*((volatile unsigned int *)(0x422C1180UL)))
#define bM4_TMRA5_HCDOR_HCDO1 (*((volatile unsigned int *)(0x422C1184UL)))
#define bM4_TMRA5_HCDOR_HCDO2 (*((volatile unsigned int *)(0x422C1188UL)))
#define bM4_TMRA5_HCDOR_HCDO3 (*((volatile unsigned int *)(0x422C118CUL)))
#define bM4_TMRA5_HCDOR_HCDO4 (*((volatile unsigned int *)(0x422C1190UL)))
#define bM4_TMRA5_HCDOR_HCDO5 (*((volatile unsigned int *)(0x422C1194UL)))
#define bM4_TMRA5_HCDOR_HCDO6 (*((volatile unsigned int *)(0x422C1198UL)))
#define bM4_TMRA5_HCDOR_HCDO7 (*((volatile unsigned int *)(0x422C119CUL)))
#define bM4_TMRA5_HCDOR_HCDO8 (*((volatile unsigned int *)(0x422C11A0UL)))
#define bM4_TMRA5_HCDOR_HCDO9 (*((volatile unsigned int *)(0x422C11A4UL)))
#define bM4_TMRA5_HCDOR_HCDO10 (*((volatile unsigned int *)(0x422C11A8UL)))
#define bM4_TMRA5_HCDOR_HCDO11 (*((volatile unsigned int *)(0x422C11ACUL)))
#define bM4_TMRA5_HCDOR_HCDO12 (*((volatile unsigned int *)(0x422C11B0UL)))
#define bM4_TMRA5_ICONR_ITEN1 (*((volatile unsigned int *)(0x422C1200UL)))
#define bM4_TMRA5_ICONR_ITEN2 (*((volatile unsigned int *)(0x422C1204UL)))
#define bM4_TMRA5_ICONR_ITEN3 (*((volatile unsigned int *)(0x422C1208UL)))
#define bM4_TMRA5_ICONR_ITEN4 (*((volatile unsigned int *)(0x422C120CUL)))
#define bM4_TMRA5_ICONR_ITEN5 (*((volatile unsigned int *)(0x422C1210UL)))
#define bM4_TMRA5_ICONR_ITEN6 (*((volatile unsigned int *)(0x422C1214UL)))
#define bM4_TMRA5_ICONR_ITEN7 (*((volatile unsigned int *)(0x422C1218UL)))
#define bM4_TMRA5_ICONR_ITEN8 (*((volatile unsigned int *)(0x422C121CUL)))
#define bM4_TMRA5_ECONR_ETEN1 (*((volatile unsigned int *)(0x422C1280UL)))
#define bM4_TMRA5_ECONR_ETEN2 (*((volatile unsigned int *)(0x422C1284UL)))
#define bM4_TMRA5_ECONR_ETEN3 (*((volatile unsigned int *)(0x422C1288UL)))
#define bM4_TMRA5_ECONR_ETEN4 (*((volatile unsigned int *)(0x422C128CUL)))
#define bM4_TMRA5_ECONR_ETEN5 (*((volatile unsigned int *)(0x422C1290UL)))
#define bM4_TMRA5_ECONR_ETEN6 (*((volatile unsigned int *)(0x422C1294UL)))
#define bM4_TMRA5_ECONR_ETEN7 (*((volatile unsigned int *)(0x422C1298UL)))
#define bM4_TMRA5_ECONR_ETEN8 (*((volatile unsigned int *)(0x422C129CUL)))
#define bM4_TMRA5_FCONR_NOFIENTG (*((volatile unsigned int *)(0x422C1300UL)))
#define bM4_TMRA5_FCONR_NOFICKTG0 (*((volatile unsigned int *)(0x422C1304UL)))
#define bM4_TMRA5_FCONR_NOFICKTG1 (*((volatile unsigned int *)(0x422C1308UL)))
#define bM4_TMRA5_FCONR_NOFIENCA (*((volatile unsigned int *)(0x422C1320UL)))
#define bM4_TMRA5_FCONR_NOFICKCA0 (*((volatile unsigned int *)(0x422C1324UL)))
#define bM4_TMRA5_FCONR_NOFICKCA1 (*((volatile unsigned int *)(0x422C1328UL)))
#define bM4_TMRA5_FCONR_NOFIENCB (*((volatile unsigned int *)(0x422C1330UL)))
#define bM4_TMRA5_FCONR_NOFICKCB0 (*((volatile unsigned int *)(0x422C1334UL)))
#define bM4_TMRA5_FCONR_NOFICKCB1 (*((volatile unsigned int *)(0x422C1338UL)))
#define bM4_TMRA5_STFLR_CMPF1 (*((volatile unsigned int *)(0x422C1380UL)))
#define bM4_TMRA5_STFLR_CMPF2 (*((volatile unsigned int *)(0x422C1384UL)))
#define bM4_TMRA5_STFLR_CMPF3 (*((volatile unsigned int *)(0x422C1388UL)))
#define bM4_TMRA5_STFLR_CMPF4 (*((volatile unsigned int *)(0x422C138CUL)))
#define bM4_TMRA5_STFLR_CMPF5 (*((volatile unsigned int *)(0x422C1390UL)))
#define bM4_TMRA5_STFLR_CMPF6 (*((volatile unsigned int *)(0x422C1394UL)))
#define bM4_TMRA5_STFLR_CMPF7 (*((volatile unsigned int *)(0x422C1398UL)))
