MarlinFirmware/Marlin/Marlin/lib/h32_core/main/hdsc32core/common/hc32f46x.h
#define bM4_TMRA5_STFLR_CMPF8 (*((volatile unsigned int *)(0x422C139CUL)))
#define bM4_TMRA5_BCONR1_BEN (*((volatile unsigned int *)(0x422C1800UL)))
#define bM4_TMRA5_BCONR1_BSE0 (*((volatile unsigned int *)(0x422C1804UL)))
#define bM4_TMRA5_BCONR1_BSE1 (*((volatile unsigned int *)(0x422C1808UL)))
#define bM4_TMRA5_BCONR2_BEN (*((volatile unsigned int *)(0x422C1900UL)))
#define bM4_TMRA5_BCONR2_BSE0 (*((volatile unsigned int *)(0x422C1904UL)))
#define bM4_TMRA5_BCONR2_BSE1 (*((volatile unsigned int *)(0x422C1908UL)))
#define bM4_TMRA5_BCONR3_BEN (*((volatile unsigned int *)(0x422C1A00UL)))
#define bM4_TMRA5_BCONR3_BSE0 (*((volatile unsigned int *)(0x422C1A04UL)))
#define bM4_TMRA5_BCONR3_BSE1 (*((volatile unsigned int *)(0x422C1A08UL)))
#define bM4_TMRA5_BCONR4_BEN (*((volatile unsigned int *)(0x422C1B00UL)))
#define bM4_TMRA5_BCONR4_BSE0 (*((volatile unsigned int *)(0x422C1B04UL)))
#define bM4_TMRA5_BCONR4_BSE1 (*((volatile unsigned int *)(0x422C1B08UL)))
#define bM4_TMRA5_CCONR1_CAPMDA (*((volatile unsigned int *)(0x422C2000UL)))
#define bM4_TMRA5_CCONR1_HICP0 (*((volatile unsigned int *)(0x422C2010UL)))
#define bM4_TMRA5_CCONR1_HICP1 (*((volatile unsigned int *)(0x422C2014UL)))
#define bM4_TMRA5_CCONR1_HICP2 (*((volatile unsigned int *)(0x422C2018UL)))
#define bM4_TMRA5_CCONR1_HICP3 (*((volatile unsigned int *)(0x422C2020UL)))
#define bM4_TMRA5_CCONR1_HICP4 (*((volatile unsigned int *)(0x422C2024UL)))
#define bM4_TMRA5_CCONR1_NOFIENCP (*((volatile unsigned int *)(0x422C2030UL)))
#define bM4_TMRA5_CCONR1_NOFICKCP0 (*((volatile unsigned int *)(0x422C2034UL)))
#define bM4_TMRA5_CCONR1_NOFICKCP1 (*((volatile unsigned int *)(0x422C2038UL)))
#define bM4_TMRA5_CCONR2_CAPMDA (*((volatile unsigned int *)(0x422C2080UL)))
#define bM4_TMRA5_CCONR2_HICP0 (*((volatile unsigned int *)(0x422C2090UL)))
#define bM4_TMRA5_CCONR2_HICP1 (*((volatile unsigned int *)(0x422C2094UL)))
#define bM4_TMRA5_CCONR2_HICP2 (*((volatile unsigned int *)(0x422C2098UL)))
#define bM4_TMRA5_CCONR2_HICP3 (*((volatile unsigned int *)(0x422C20A0UL)))
#define bM4_TMRA5_CCONR2_HICP4 (*((volatile unsigned int *)(0x422C20A4UL)))
#define bM4_TMRA5_CCONR2_NOFIENCP (*((volatile unsigned int *)(0x422C20B0UL)))
#define bM4_TMRA5_CCONR2_NOFICKCP0 (*((volatile unsigned int *)(0x422C20B4UL)))
#define bM4_TMRA5_CCONR2_NOFICKCP1 (*((volatile unsigned int *)(0x422C20B8UL)))
#define bM4_TMRA5_CCONR3_CAPMDA (*((volatile unsigned int *)(0x422C2100UL)))
#define bM4_TMRA5_CCONR3_HICP0 (*((volatile unsigned int *)(0x422C2110UL)))
#define bM4_TMRA5_CCONR3_HICP1 (*((volatile unsigned int *)(0x422C2114UL)))
#define bM4_TMRA5_CCONR3_HICP2 (*((volatile unsigned int *)(0x422C2118UL)))
#define bM4_TMRA5_CCONR3_HICP3 (*((volatile unsigned int *)(0x422C2120UL)))
#define bM4_TMRA5_CCONR3_HICP4 (*((volatile unsigned int *)(0x422C2124UL)))
#define bM4_TMRA5_CCONR3_NOFIENCP (*((volatile unsigned int *)(0x422C2130UL)))
#define bM4_TMRA5_CCONR3_NOFICKCP0 (*((volatile unsigned int *)(0x422C2134UL)))
#define bM4_TMRA5_CCONR3_NOFICKCP1 (*((volatile unsigned int *)(0x422C2138UL)))
#define bM4_TMRA5_CCONR4_CAPMDA (*((volatile unsigned int *)(0x422C2180UL)))
#define bM4_TMRA5_CCONR4_HICP0 (*((volatile unsigned int *)(0x422C2190UL)))
#define bM4_TMRA5_CCONR4_HICP1 (*((volatile unsigned int *)(0x422C2194UL)))
#define bM4_TMRA5_CCONR4_HICP2 (*((volatile unsigned int *)(0x422C2198UL)))
#define bM4_TMRA5_CCONR4_HICP3 (*((volatile unsigned int *)(0x422C21A0UL)))
#define bM4_TMRA5_CCONR4_HICP4 (*((volatile unsigned int *)(0x422C21A4UL)))
#define bM4_TMRA5_CCONR4_NOFIENCP (*((volatile unsigned int *)(0x422C21B0UL)))
#define bM4_TMRA5_CCONR4_NOFICKCP0 (*((volatile unsigned int *)(0x422C21B4UL)))
#define bM4_TMRA5_CCONR4_NOFICKCP1 (*((volatile unsigned int *)(0x422C21B8UL)))
#define bM4_TMRA5_CCONR5_CAPMDA (*((volatile unsigned int *)(0x422C2200UL)))
#define bM4_TMRA5_CCONR5_HICP0 (*((volatile unsigned int *)(0x422C2210UL)))
#define bM4_TMRA5_CCONR5_HICP1 (*((volatile unsigned int *)(0x422C2214UL)))
#define bM4_TMRA5_CCONR5_HICP2 (*((volatile unsigned int *)(0x422C2218UL)))
#define bM4_TMRA5_CCONR5_HICP3 (*((volatile unsigned int *)(0x422C2220UL)))
#define bM4_TMRA5_CCONR5_HICP4 (*((volatile unsigned int *)(0x422C2224UL)))
#define bM4_TMRA5_CCONR5_NOFIENCP (*((volatile unsigned int *)(0x422C2230UL)))
#define bM4_TMRA5_CCONR5_NOFICKCP0 (*((volatile unsigned int *)(0x422C2234UL)))
#define bM4_TMRA5_CCONR5_NOFICKCP1 (*((volatile unsigned int *)(0x422C2238UL)))
#define bM4_TMRA5_CCONR6_CAPMDA (*((volatile unsigned int *)(0x422C2280UL)))
#define bM4_TMRA5_CCONR6_HICP0 (*((volatile unsigned int *)(0x422C2290UL)))
#define bM4_TMRA5_CCONR6_HICP1 (*((volatile unsigned int *)(0x422C2294UL)))
#define bM4_TMRA5_CCONR6_HICP2 (*((volatile unsigned int *)(0x422C2298UL)))
#define bM4_TMRA5_CCONR6_HICP3 (*((volatile unsigned int *)(0x422C22A0UL)))
#define bM4_TMRA5_CCONR6_HICP4 (*((volatile unsigned int *)(0x422C22A4UL)))
#define bM4_TMRA5_CCONR6_NOFIENCP (*((volatile unsigned int *)(0x422C22B0UL)))
#define bM4_TMRA5_CCONR6_NOFICKCP0 (*((volatile unsigned int *)(0x422C22B4UL)))
#define bM4_TMRA5_CCONR6_NOFICKCP1 (*((volatile unsigned int *)(0x422C22B8UL)))
#define bM4_TMRA5_CCONR7_CAPMDA (*((volatile unsigned int *)(0x422C2300UL)))
#define bM4_TMRA5_CCONR7_HICP0 (*((volatile unsigned int *)(0x422C2310UL)))
#define bM4_TMRA5_CCONR7_HICP1 (*((volatile unsigned int *)(0x422C2314UL)))
#define bM4_TMRA5_CCONR7_HICP2 (*((volatile unsigned int *)(0x422C2318UL)))
#define bM4_TMRA5_CCONR7_HICP3 (*((volatile unsigned int *)(0x422C2320UL)))
#define bM4_TMRA5_CCONR7_HICP4 (*((volatile unsigned int *)(0x422C2324UL)))
#define bM4_TMRA5_CCONR7_NOFIENCP (*((volatile unsigned int *)(0x422C2330UL)))
#define bM4_TMRA5_CCONR7_NOFICKCP0 (*((volatile unsigned int *)(0x422C2334UL)))
#define bM4_TMRA5_CCONR7_NOFICKCP1 (*((volatile unsigned int *)(0x422C2338UL)))
#define bM4_TMRA5_CCONR8_CAPMDA (*((volatile unsigned int *)(0x422C2380UL)))
#define bM4_TMRA5_CCONR8_HICP0 (*((volatile unsigned int *)(0x422C2390UL)))
#define bM4_TMRA5_CCONR8_HICP1 (*((volatile unsigned int *)(0x422C2394UL)))
#define bM4_TMRA5_CCONR8_HICP2 (*((volatile unsigned int *)(0x422C2398UL)))
#define bM4_TMRA5_CCONR8_HICP3 (*((volatile unsigned int *)(0x422C23A0UL)))
#define bM4_TMRA5_CCONR8_HICP4 (*((volatile unsigned int *)(0x422C23A4UL)))
#define bM4_TMRA5_CCONR8_NOFIENCP (*((volatile unsigned int *)(0x422C23B0UL)))
#define bM4_TMRA5_CCONR8_NOFICKCP0 (*((volatile unsigned int *)(0x422C23B4UL)))
#define bM4_TMRA5_CCONR8_NOFICKCP1 (*((volatile unsigned int *)(0x422C23B8UL)))
#define bM4_TMRA5_PCONR1_STAC0 (*((volatile unsigned int *)(0x422C2800UL)))
#define bM4_TMRA5_PCONR1_STAC1 (*((volatile unsigned int *)(0x422C2804UL)))
#define bM4_TMRA5_PCONR1_STPC0 (*((volatile unsigned int *)(0x422C2808UL)))
#define bM4_TMRA5_PCONR1_STPC1 (*((volatile unsigned int *)(0x422C280CUL)))
#define bM4_TMRA5_PCONR1_CMPC0 (*((volatile unsigned int *)(0x422C2810UL)))
#define bM4_TMRA5_PCONR1_CMPC1 (*((volatile unsigned int *)(0x422C2814UL)))
#define bM4_TMRA5_PCONR1_PERC0 (*((volatile unsigned int *)(0x422C2818UL)))
#define bM4_TMRA5_PCONR1_PERC1 (*((volatile unsigned int *)(0x422C281CUL)))
#define bM4_TMRA5_PCONR1_FORC0 (*((volatile unsigned int *)(0x422C2820UL)))
#define bM4_TMRA5_PCONR1_FORC1 (*((volatile unsigned int *)(0x422C2824UL)))
#define bM4_TMRA5_PCONR1_OUTEN (*((volatile unsigned int *)(0x422C2830UL)))
#define bM4_TMRA5_PCONR2_STAC0 (*((volatile unsigned int *)(0x422C2880UL)))
#define bM4_TMRA5_PCONR2_STAC1 (*((volatile unsigned int *)(0x422C2884UL)))
#define bM4_TMRA5_PCONR2_STPC0 (*((volatile unsigned int *)(0x422C2888UL)))
#define bM4_TMRA5_PCONR2_STPC1 (*((volatile unsigned int *)(0x422C288CUL)))
#define bM4_TMRA5_PCONR2_CMPC0 (*((volatile unsigned int *)(0x422C2890UL)))
#define bM4_TMRA5_PCONR2_CMPC1 (*((volatile unsigned int *)(0x422C2894UL)))
#define bM4_TMRA5_PCONR2_PERC0 (*((volatile unsigned int *)(0x422C2898UL)))
#define bM4_TMRA5_PCONR2_PERC1 (*((volatile unsigned int *)(0x422C289CUL)))
#define bM4_TMRA5_PCONR2_FORC0 (*((volatile unsigned int *)(0x422C28A0UL)))
#define bM4_TMRA5_PCONR2_FORC1 (*((volatile unsigned int *)(0x422C28A4UL)))
#define bM4_TMRA5_PCONR2_OUTEN (*((volatile unsigned int *)(0x422C28B0UL)))
#define bM4_TMRA5_PCONR3_STAC0 (*((volatile unsigned int *)(0x422C2900UL)))
#define bM4_TMRA5_PCONR3_STAC1 (*((volatile unsigned int *)(0x422C2904UL)))
#define bM4_TMRA5_PCONR3_STPC0 (*((volatile unsigned int *)(0x422C2908UL)))
#define bM4_TMRA5_PCONR3_STPC1 (*((volatile unsigned int *)(0x422C290CUL)))
#define bM4_TMRA5_PCONR3_CMPC0 (*((volatile unsigned int *)(0x422C2910UL)))
#define bM4_TMRA5_PCONR3_CMPC1 (*((volatile unsigned int *)(0x422C2914UL)))
#define bM4_TMRA5_PCONR3_PERC0 (*((volatile unsigned int *)(0x422C2918UL)))
#define bM4_TMRA5_PCONR3_PERC1 (*((volatile unsigned int *)(0x422C291CUL)))
#define bM4_TMRA5_PCONR3_FORC0 (*((volatile unsigned int *)(0x422C2920UL)))
#define bM4_TMRA5_PCONR3_FORC1 (*((volatile unsigned int *)(0x422C2924UL)))
#define bM4_TMRA5_PCONR3_OUTEN (*((volatile unsigned int *)(0x422C2930UL)))
#define bM4_TMRA5_PCONR4_STAC0 (*((volatile unsigned int *)(0x422C2980UL)))
#define bM4_TMRA5_PCONR4_STAC1 (*((volatile unsigned int *)(0x422C2984UL)))
#define bM4_TMRA5_PCONR4_STPC0 (*((volatile unsigned int *)(0x422C2988UL)))
#define bM4_TMRA5_PCONR4_STPC1 (*((volatile unsigned int *)(0x422C298CUL)))
#define bM4_TMRA5_PCONR4_CMPC0 (*((volatile unsigned int *)(0x422C2990UL)))
#define bM4_TMRA5_PCONR4_CMPC1 (*((volatile unsigned int *)(0x422C2994UL)))
#define bM4_TMRA5_PCONR4_PERC0 (*((volatile unsigned int *)(0x422C2998UL)))
#define bM4_TMRA5_PCONR4_PERC1 (*((volatile unsigned int *)(0x422C299CUL)))
#define bM4_TMRA5_PCONR4_FORC0 (*((volatile unsigned int *)(0x422C29A0UL)))
#define bM4_TMRA5_PCONR4_FORC1 (*((volatile unsigned int *)(0x422C29A4UL)))
#define bM4_TMRA5_PCONR4_OUTEN (*((volatile unsigned int *)(0x422C29B0UL)))
#define bM4_TMRA5_PCONR5_STAC0 (*((volatile unsigned int *)(0x422C2A00UL)))
#define bM4_TMRA5_PCONR5_STAC1 (*((volatile unsigned int *)(0x422C2A04UL)))
#define bM4_TMRA5_PCONR5_STPC0 (*((volatile unsigned int *)(0x422C2A08UL)))
#define bM4_TMRA5_PCONR5_STPC1 (*((volatile unsigned int *)(0x422C2A0CUL)))
#define bM4_TMRA5_PCONR5_CMPC0 (*((volatile unsigned int *)(0x422C2A10UL)))
#define bM4_TMRA5_PCONR5_CMPC1 (*((volatile unsigned int *)(0x422C2A14UL)))
#define bM4_TMRA5_PCONR5_PERC0 (*((volatile unsigned int *)(0x422C2A18UL)))
#define bM4_TMRA5_PCONR5_PERC1 (*((volatile unsigned int *)(0x422C2A1CUL)))
#define bM4_TMRA5_PCONR5_FORC0 (*((volatile unsigned int *)(0x422C2A20UL)))
#define bM4_TMRA5_PCONR5_FORC1 (*((volatile unsigned int *)(0x422C2A24UL)))
#define bM4_TMRA5_PCONR5_OUTEN (*((volatile unsigned int *)(0x422C2A30UL)))
#define bM4_TMRA5_PCONR6_STAC0 (*((volatile unsigned int *)(0x422C2A80UL)))
#define bM4_TMRA5_PCONR6_STAC1 (*((volatile unsigned int *)(0x422C2A84UL)))
#define bM4_TMRA5_PCONR6_STPC0 (*((volatile unsigned int *)(0x422C2A88UL)))
#define bM4_TMRA5_PCONR6_STPC1 (*((volatile unsigned int *)(0x422C2A8CUL)))
#define bM4_TMRA5_PCONR6_CMPC0 (*((volatile unsigned int *)(0x422C2A90UL)))
#define bM4_TMRA5_PCONR6_CMPC1 (*((volatile unsigned int *)(0x422C2A94UL)))
#define bM4_TMRA5_PCONR6_PERC0 (*((volatile unsigned int *)(0x422C2A98UL)))
#define bM4_TMRA5_PCONR6_PERC1 (*((volatile unsigned int *)(0x422C2A9CUL)))
#define bM4_TMRA5_PCONR6_FORC0 (*((volatile unsigned int *)(0x422C2AA0UL)))
#define bM4_TMRA5_PCONR6_FORC1 (*((volatile unsigned int *)(0x422C2AA4UL)))
#define bM4_TMRA5_PCONR6_OUTEN (*((volatile unsigned int *)(0x422C2AB0UL)))
#define bM4_TMRA5_PCONR7_STAC0 (*((volatile unsigned int *)(0x422C2B00UL)))
#define bM4_TMRA5_PCONR7_STAC1 (*((volatile unsigned int *)(0x422C2B04UL)))
#define bM4_TMRA5_PCONR7_STPC0 (*((volatile unsigned int *)(0x422C2B08UL)))
#define bM4_TMRA5_PCONR7_STPC1 (*((volatile unsigned int *)(0x422C2B0CUL)))
#define bM4_TMRA5_PCONR7_CMPC0 (*((volatile unsigned int *)(0x422C2B10UL)))
#define bM4_TMRA5_PCONR7_CMPC1 (*((volatile unsigned int *)(0x422C2B14UL)))
#define bM4_TMRA5_PCONR7_PERC0 (*((volatile unsigned int *)(0x422C2B18UL)))
#define bM4_TMRA5_PCONR7_PERC1 (*((volatile unsigned int *)(0x422C2B1CUL)))
#define bM4_TMRA5_PCONR7_FORC0 (*((volatile unsigned int *)(0x422C2B20UL)))
#define bM4_TMRA5_PCONR7_FORC1 (*((volatile unsigned int *)(0x422C2B24UL)))
#define bM4_TMRA5_PCONR7_OUTEN (*((volatile unsigned int *)(0x422C2B30UL)))
#define bM4_TMRA5_PCONR8_STAC0 (*((volatile unsigned int *)(0x422C2B80UL)))
#define bM4_TMRA5_PCONR8_STAC1 (*((volatile unsigned int *)(0x422C2B84UL)))
#define bM4_TMRA5_PCONR8_STPC0 (*((volatile unsigned int *)(0x422C2B88UL)))
#define bM4_TMRA5_PCONR8_STPC1 (*((volatile unsigned int *)(0x422C2B8CUL)))
#define bM4_TMRA5_PCONR8_CMPC0 (*((volatile unsigned int *)(0x422C2B90UL)))
#define bM4_TMRA5_PCONR8_CMPC1 (*((volatile unsigned int *)(0x422C2B94UL)))
#define bM4_TMRA5_PCONR8_PERC0 (*((volatile unsigned int *)(0x422C2B98UL)))
#define bM4_TMRA5_PCONR8_PERC1 (*((volatile unsigned int *)(0x422C2B9CUL)))
#define bM4_TMRA5_PCONR8_FORC0 (*((volatile unsigned int *)(0x422C2BA0UL)))
#define bM4_TMRA5_PCONR8_FORC1 (*((volatile unsigned int *)(0x422C2BA4UL)))
#define bM4_TMRA5_PCONR8_OUTEN (*((volatile unsigned int *)(0x422C2BB0UL)))
#define bM4_TMRA6_CNTER_CNT0 (*((volatile unsigned int *)(0x422C8000UL)))
#define bM4_TMRA6_CNTER_CNT1 (*((volatile unsigned int *)(0x422C8004UL)))
#define bM4_TMRA6_CNTER_CNT2 (*((volatile unsigned int *)(0x422C8008UL)))
#define bM4_TMRA6_CNTER_CNT3 (*((volatile unsigned int *)(0x422C800CUL)))
#define bM4_TMRA6_CNTER_CNT4 (*((volatile unsigned int *)(0x422C8010UL)))
#define bM4_TMRA6_CNTER_CNT5 (*((volatile unsigned int *)(0x422C8014UL)))
#define bM4_TMRA6_CNTER_CNT6 (*((volatile unsigned int *)(0x422C8018UL)))
#define bM4_TMRA6_CNTER_CNT7 (*((volatile unsigned int *)(0x422C801CUL)))
#define bM4_TMRA6_CNTER_CNT8 (*((volatile unsigned int *)(0x422C8020UL)))
#define bM4_TMRA6_CNTER_CNT9 (*((volatile unsigned int *)(0x422C8024UL)))
#define bM4_TMRA6_CNTER_CNT10 (*((volatile unsigned int *)(0x422C8028UL)))
#define bM4_TMRA6_CNTER_CNT11 (*((volatile unsigned int *)(0x422C802CUL)))
#define bM4_TMRA6_CNTER_CNT12 (*((volatile unsigned int *)(0x422C8030UL)))
#define bM4_TMRA6_CNTER_CNT13 (*((volatile unsigned int *)(0x422C8034UL)))
#define bM4_TMRA6_CNTER_CNT14 (*((volatile unsigned int *)(0x422C8038UL)))
#define bM4_TMRA6_CNTER_CNT15 (*((volatile unsigned int *)(0x422C803CUL)))
#define bM4_TMRA6_PERAR_PER0 (*((volatile unsigned int *)(0x422C8080UL)))
#define bM4_TMRA6_PERAR_PER1 (*((volatile unsigned int *)(0x422C8084UL)))
#define bM4_TMRA6_PERAR_PER2 (*((volatile unsigned int *)(0x422C8088UL)))
#define bM4_TMRA6_PERAR_PER3 (*((volatile unsigned int *)(0x422C808CUL)))
#define bM4_TMRA6_PERAR_PER4 (*((volatile unsigned int *)(0x422C8090UL)))
#define bM4_TMRA6_PERAR_PER5 (*((volatile unsigned int *)(0x422C8094UL)))
#define bM4_TMRA6_PERAR_PER6 (*((volatile unsigned int *)(0x422C8098UL)))
#define bM4_TMRA6_PERAR_PER7 (*((volatile unsigned int *)(0x422C809CUL)))
#define bM4_TMRA6_PERAR_PER8 (*((volatile unsigned int *)(0x422C80A0UL)))
#define bM4_TMRA6_PERAR_PER9 (*((volatile unsigned int *)(0x422C80A4UL)))
#define bM4_TMRA6_PERAR_PER10 (*((volatile unsigned int *)(0x422C80A8UL)))
#define bM4_TMRA6_PERAR_PER11 (*((volatile unsigned int *)(0x422C80ACUL)))
#define bM4_TMRA6_PERAR_PER12 (*((volatile unsigned int *)(0x422C80B0UL)))
#define bM4_TMRA6_PERAR_PER13 (*((volatile unsigned int *)(0x422C80B4UL)))
#define bM4_TMRA6_PERAR_PER14 (*((volatile unsigned int *)(0x422C80B8UL)))
#define bM4_TMRA6_PERAR_PER15 (*((volatile unsigned int *)(0x422C80BCUL)))
#define bM4_TMRA6_CMPAR1_CMP0 (*((volatile unsigned int *)(0x422C8800UL)))
#define bM4_TMRA6_CMPAR1_CMP1 (*((volatile unsigned int *)(0x422C8804UL)))
#define bM4_TMRA6_CMPAR1_CMP2 (*((volatile unsigned int *)(0x422C8808UL)))
#define bM4_TMRA6_CMPAR1_CMP3 (*((volatile unsigned int *)(0x422C880CUL)))
#define bM4_TMRA6_CMPAR1_CMP4 (*((volatile unsigned int *)(0x422C8810UL)))
#define bM4_TMRA6_CMPAR1_CMP5 (*((volatile unsigned int *)(0x422C8814UL)))
#define bM4_TMRA6_CMPAR1_CMP6 (*((volatile unsigned int *)(0x422C8818UL)))
#define bM4_TMRA6_CMPAR1_CMP7 (*((volatile unsigned int *)(0x422C881CUL)))
#define bM4_TMRA6_CMPAR1_CMP8 (*((volatile unsigned int *)(0x422C8820UL)))
#define bM4_TMRA6_CMPAR1_CMP9 (*((volatile unsigned int *)(0x422C8824UL)))
#define bM4_TMRA6_CMPAR1_CMP10 (*((volatile unsigned int *)(0x422C8828UL)))
#define bM4_TMRA6_CMPAR1_CMP11 (*((volatile unsigned int *)(0x422C882CUL)))
#define bM4_TMRA6_CMPAR1_CMP12 (*((volatile unsigned int *)(0x422C8830UL)))
#define bM4_TMRA6_CMPAR1_CMP13 (*((volatile unsigned int *)(0x422C8834UL)))
#define bM4_TMRA6_CMPAR1_CMP14 (*((volatile unsigned int *)(0x422C8838UL)))
#define bM4_TMRA6_CMPAR1_CMP15 (*((volatile unsigned int *)(0x422C883CUL)))
#define bM4_TMRA6_CMPAR2_CMP0 (*((volatile unsigned int *)(0x422C8880UL)))
#define bM4_TMRA6_CMPAR2_CMP1 (*((volatile unsigned int *)(0x422C8884UL)))
#define bM4_TMRA6_CMPAR2_CMP2 (*((volatile unsigned int *)(0x422C8888UL)))
#define bM4_TMRA6_CMPAR2_CMP3 (*((volatile unsigned int *)(0x422C888CUL)))
#define bM4_TMRA6_CMPAR2_CMP4 (*((volatile unsigned int *)(0x422C8890UL)))
#define bM4_TMRA6_CMPAR2_CMP5 (*((volatile unsigned int *)(0x422C8894UL)))
#define bM4_TMRA6_CMPAR2_CMP6 (*((volatile unsigned int *)(0x422C8898UL)))
#define bM4_TMRA6_CMPAR2_CMP7 (*((volatile unsigned int *)(0x422C889CUL)))
#define bM4_TMRA6_CMPAR2_CMP8 (*((volatile unsigned int *)(0x422C88A0UL)))
#define bM4_TMRA6_CMPAR2_CMP9 (*((volatile unsigned int *)(0x422C88A4UL)))
#define bM4_TMRA6_CMPAR2_CMP10 (*((volatile unsigned int *)(0x422C88A8UL)))
#define bM4_TMRA6_CMPAR2_CMP11 (*((volatile unsigned int *)(0x422C88ACUL)))
#define bM4_TMRA6_CMPAR2_CMP12 (*((volatile unsigned int *)(0x422C88B0UL)))
#define bM4_TMRA6_CMPAR2_CMP13 (*((volatile unsigned int *)(0x422C88B4UL)))
#define bM4_TMRA6_CMPAR2_CMP14 (*((volatile unsigned int *)(0x422C88B8UL)))
#define bM4_TMRA6_CMPAR2_CMP15 (*((volatile unsigned int *)(0x422C88BCUL)))
#define bM4_TMRA6_CMPAR3_CMP0 (*((volatile unsigned int *)(0x422C8900UL)))
#define bM4_TMRA6_CMPAR3_CMP1 (*((volatile unsigned int *)(0x422C8904UL)))
#define bM4_TMRA6_CMPAR3_CMP2 (*((volatile unsigned int *)(0x422C8908UL)))
#define bM4_TMRA6_CMPAR3_CMP3 (*((volatile unsigned int *)(0x422C890CUL)))
#define bM4_TMRA6_CMPAR3_CMP4 (*((volatile unsigned int *)(0x422C8910UL)))
#define bM4_TMRA6_CMPAR3_CMP5 (*((volatile unsigned int *)(0x422C8914UL)))
#define bM4_TMRA6_CMPAR3_CMP6 (*((volatile unsigned int *)(0x422C8918UL)))
#define bM4_TMRA6_CMPAR3_CMP7 (*((volatile unsigned int *)(0x422C891CUL)))
#define bM4_TMRA6_CMPAR3_CMP8 (*((volatile unsigned int *)(0x422C8920UL)))
#define bM4_TMRA6_CMPAR3_CMP9 (*((volatile unsigned int *)(0x422C8924UL)))
#define bM4_TMRA6_CMPAR3_CMP10 (*((volatile unsigned int *)(0x422C8928UL)))
#define bM4_TMRA6_CMPAR3_CMP11 (*((volatile unsigned int *)(0x422C892CUL)))
#define bM4_TMRA6_CMPAR3_CMP12 (*((volatile unsigned int *)(0x422C8930UL)))
#define bM4_TMRA6_CMPAR3_CMP13 (*((volatile unsigned int *)(0x422C8934UL)))
#define bM4_TMRA6_CMPAR3_CMP14 (*((volatile unsigned int *)(0x422C8938UL)))
#define bM4_TMRA6_CMPAR3_CMP15 (*((volatile unsigned int *)(0x422C893CUL)))
#define bM4_TMRA6_CMPAR4_CMP0 (*((volatile unsigned int *)(0x422C8980UL)))
#define bM4_TMRA6_CMPAR4_CMP1 (*((volatile unsigned int *)(0x422C8984UL)))
#define bM4_TMRA6_CMPAR4_CMP2 (*((volatile unsigned int *)(0x422C8988UL)))
#define bM4_TMRA6_CMPAR4_CMP3 (*((volatile unsigned int *)(0x422C898CUL)))
#define bM4_TMRA6_CMPAR4_CMP4 (*((volatile unsigned int *)(0x422C8990UL)))
#define bM4_TMRA6_CMPAR4_CMP5 (*((volatile unsigned int *)(0x422C8994UL)))
#define bM4_TMRA6_CMPAR4_CMP6 (*((volatile unsigned int *)(0x422C8998UL)))
#define bM4_TMRA6_CMPAR4_CMP7 (*((volatile unsigned int *)(0x422C899CUL)))
#define bM4_TMRA6_CMPAR4_CMP8 (*((volatile unsigned int *)(0x422C89A0UL)))
#define bM4_TMRA6_CMPAR4_CMP9 (*((volatile unsigned int *)(0x422C89A4UL)))
#define bM4_TMRA6_CMPAR4_CMP10 (*((volatile unsigned int *)(0x422C89A8UL)))
#define bM4_TMRA6_CMPAR4_CMP11 (*((volatile unsigned int *)(0x422C89ACUL)))
#define bM4_TMRA6_CMPAR4_CMP12 (*((volatile unsigned int *)(0x422C89B0UL)))
#define bM4_TMRA6_CMPAR4_CMP13 (*((volatile unsigned int *)(0x422C89B4UL)))
#define bM4_TMRA6_CMPAR4_CMP14 (*((volatile unsigned int *)(0x422C89B8UL)))
#define bM4_TMRA6_CMPAR4_CMP15 (*((volatile unsigned int *)(0x422C89BCUL)))
#define bM4_TMRA6_CMPAR5_CMP0 (*((volatile unsigned int *)(0x422C8A00UL)))
#define bM4_TMRA6_CMPAR5_CMP1 (*((volatile unsigned int *)(0x422C8A04UL)))
#define bM4_TMRA6_CMPAR5_CMP2 (*((volatile unsigned int *)(0x422C8A08UL)))
#define bM4_TMRA6_CMPAR5_CMP3 (*((volatile unsigned int *)(0x422C8A0CUL)))
#define bM4_TMRA6_CMPAR5_CMP4 (*((volatile unsigned int *)(0x422C8A10UL)))
#define bM4_TMRA6_CMPAR5_CMP5 (*((volatile unsigned int *)(0x422C8A14UL)))
#define bM4_TMRA6_CMPAR5_CMP6 (*((volatile unsigned int *)(0x422C8A18UL)))
#define bM4_TMRA6_CMPAR5_CMP7 (*((volatile unsigned int *)(0x422C8A1CUL)))
#define bM4_TMRA6_CMPAR5_CMP8 (*((volatile unsigned int *)(0x422C8A20UL)))
#define bM4_TMRA6_CMPAR5_CMP9 (*((volatile unsigned int *)(0x422C8A24UL)))
#define bM4_TMRA6_CMPAR5_CMP10 (*((volatile unsigned int *)(0x422C8A28UL)))
#define bM4_TMRA6_CMPAR5_CMP11 (*((volatile unsigned int *)(0x422C8A2CUL)))
#define bM4_TMRA6_CMPAR5_CMP12 (*((volatile unsigned int *)(0x422C8A30UL)))
#define bM4_TMRA6_CMPAR5_CMP13 (*((volatile unsigned int *)(0x422C8A34UL)))
#define bM4_TMRA6_CMPAR5_CMP14 (*((volatile unsigned int *)(0x422C8A38UL)))
#define bM4_TMRA6_CMPAR5_CMP15 (*((volatile unsigned int *)(0x422C8A3CUL)))
#define bM4_TMRA6_CMPAR6_CMP0 (*((volatile unsigned int *)(0x422C8A80UL)))
#define bM4_TMRA6_CMPAR6_CMP1 (*((volatile unsigned int *)(0x422C8A84UL)))
#define bM4_TMRA6_CMPAR6_CMP2 (*((volatile unsigned int *)(0x422C8A88UL)))
#define bM4_TMRA6_CMPAR6_CMP3 (*((volatile unsigned int *)(0x422C8A8CUL)))
#define bM4_TMRA6_CMPAR6_CMP4 (*((volatile unsigned int *)(0x422C8A90UL)))
#define bM4_TMRA6_CMPAR6_CMP5 (*((volatile unsigned int *)(0x422C8A94UL)))
#define bM4_TMRA6_CMPAR6_CMP6 (*((volatile unsigned int *)(0x422C8A98UL)))
#define bM4_TMRA6_CMPAR6_CMP7 (*((volatile unsigned int *)(0x422C8A9CUL)))
#define bM4_TMRA6_CMPAR6_CMP8 (*((volatile unsigned int *)(0x422C8AA0UL)))
#define bM4_TMRA6_CMPAR6_CMP9 (*((volatile unsigned int *)(0x422C8AA4UL)))
#define bM4_TMRA6_CMPAR6_CMP10 (*((volatile unsigned int *)(0x422C8AA8UL)))
#define bM4_TMRA6_CMPAR6_CMP11 (*((volatile unsigned int *)(0x422C8AACUL)))
#define bM4_TMRA6_CMPAR6_CMP12 (*((volatile unsigned int *)(0x422C8AB0UL)))
#define bM4_TMRA6_CMPAR6_CMP13 (*((volatile unsigned int *)(0x422C8AB4UL)))
#define bM4_TMRA6_CMPAR6_CMP14 (*((volatile unsigned int *)(0x422C8AB8UL)))
#define bM4_TMRA6_CMPAR6_CMP15 (*((volatile unsigned int *)(0x422C8ABCUL)))
#define bM4_TMRA6_CMPAR7_CMP0 (*((volatile unsigned int *)(0x422C8B00UL)))
#define bM4_TMRA6_CMPAR7_CMP1 (*((volatile unsigned int *)(0x422C8B04UL)))
#define bM4_TMRA6_CMPAR7_CMP2 (*((volatile unsigned int *)(0x422C8B08UL)))
#define bM4_TMRA6_CMPAR7_CMP3 (*((volatile unsigned int *)(0x422C8B0CUL)))
#define bM4_TMRA6_CMPAR7_CMP4 (*((volatile unsigned int *)(0x422C8B10UL)))
#define bM4_TMRA6_CMPAR7_CMP5 (*((volatile unsigned int *)(0x422C8B14UL)))
#define bM4_TMRA6_CMPAR7_CMP6 (*((volatile unsigned int *)(0x422C8B18UL)))
#define bM4_TMRA6_CMPAR7_CMP7 (*((volatile unsigned int *)(0x422C8B1CUL)))
#define bM4_TMRA6_CMPAR7_CMP8 (*((volatile unsigned int *)(0x422C8B20UL)))
#define bM4_TMRA6_CMPAR7_CMP9 (*((volatile unsigned int *)(0x422C8B24UL)))
#define bM4_TMRA6_CMPAR7_CMP10 (*((volatile unsigned int *)(0x422C8B28UL)))
#define bM4_TMRA6_CMPAR7_CMP11 (*((volatile unsigned int *)(0x422C8B2CUL)))
#define bM4_TMRA6_CMPAR7_CMP12 (*((volatile unsigned int *)(0x422C8B30UL)))
#define bM4_TMRA6_CMPAR7_CMP13 (*((volatile unsigned int *)(0x422C8B34UL)))
#define bM4_TMRA6_CMPAR7_CMP14 (*((volatile unsigned int *)(0x422C8B38UL)))
