MarlinFirmware/Marlin/Marlin/lib/h32_core/main/hdsc32core/common/hc32f46x.h
#define bM4_TMRA6_CMPAR7_CMP15 (*((volatile unsigned int *)(0x422C8B3CUL)))
#define bM4_TMRA6_CMPAR8_CMP0 (*((volatile unsigned int *)(0x422C8B80UL)))
#define bM4_TMRA6_CMPAR8_CMP1 (*((volatile unsigned int *)(0x422C8B84UL)))
#define bM4_TMRA6_CMPAR8_CMP2 (*((volatile unsigned int *)(0x422C8B88UL)))
#define bM4_TMRA6_CMPAR8_CMP3 (*((volatile unsigned int *)(0x422C8B8CUL)))
#define bM4_TMRA6_CMPAR8_CMP4 (*((volatile unsigned int *)(0x422C8B90UL)))
#define bM4_TMRA6_CMPAR8_CMP5 (*((volatile unsigned int *)(0x422C8B94UL)))
#define bM4_TMRA6_CMPAR8_CMP6 (*((volatile unsigned int *)(0x422C8B98UL)))
#define bM4_TMRA6_CMPAR8_CMP7 (*((volatile unsigned int *)(0x422C8B9CUL)))
#define bM4_TMRA6_CMPAR8_CMP8 (*((volatile unsigned int *)(0x422C8BA0UL)))
#define bM4_TMRA6_CMPAR8_CMP9 (*((volatile unsigned int *)(0x422C8BA4UL)))
#define bM4_TMRA6_CMPAR8_CMP10 (*((volatile unsigned int *)(0x422C8BA8UL)))
#define bM4_TMRA6_CMPAR8_CMP11 (*((volatile unsigned int *)(0x422C8BACUL)))
#define bM4_TMRA6_CMPAR8_CMP12 (*((volatile unsigned int *)(0x422C8BB0UL)))
#define bM4_TMRA6_CMPAR8_CMP13 (*((volatile unsigned int *)(0x422C8BB4UL)))
#define bM4_TMRA6_CMPAR8_CMP14 (*((volatile unsigned int *)(0x422C8BB8UL)))
#define bM4_TMRA6_CMPAR8_CMP15 (*((volatile unsigned int *)(0x422C8BBCUL)))
#define bM4_TMRA6_BCSTR_START (*((volatile unsigned int *)(0x422C9000UL)))
#define bM4_TMRA6_BCSTR_DIR (*((volatile unsigned int *)(0x422C9004UL)))
#define bM4_TMRA6_BCSTR_MODE (*((volatile unsigned int *)(0x422C9008UL)))
#define bM4_TMRA6_BCSTR_SYNST (*((volatile unsigned int *)(0x422C900CUL)))
#define bM4_TMRA6_BCSTR_CKDIV0 (*((volatile unsigned int *)(0x422C9010UL)))
#define bM4_TMRA6_BCSTR_CKDIV1 (*((volatile unsigned int *)(0x422C9014UL)))
#define bM4_TMRA6_BCSTR_CKDIV2 (*((volatile unsigned int *)(0x422C9018UL)))
#define bM4_TMRA6_BCSTR_CKDIV3 (*((volatile unsigned int *)(0x422C901CUL)))
#define bM4_TMRA6_BCSTR_ITENOVF (*((volatile unsigned int *)(0x422C9030UL)))
#define bM4_TMRA6_BCSTR_ITENUDF (*((volatile unsigned int *)(0x422C9034UL)))
#define bM4_TMRA6_BCSTR_OVFF (*((volatile unsigned int *)(0x422C9038UL)))
#define bM4_TMRA6_BCSTR_UDFF (*((volatile unsigned int *)(0x422C903CUL)))
#define bM4_TMRA6_HCONR_HSTA0 (*((volatile unsigned int *)(0x422C9080UL)))
#define bM4_TMRA6_HCONR_HSTA1 (*((volatile unsigned int *)(0x422C9084UL)))
#define bM4_TMRA6_HCONR_HSTA2 (*((volatile unsigned int *)(0x422C9088UL)))
#define bM4_TMRA6_HCONR_HSTP0 (*((volatile unsigned int *)(0x422C9090UL)))
#define bM4_TMRA6_HCONR_HSTP1 (*((volatile unsigned int *)(0x422C9094UL)))
#define bM4_TMRA6_HCONR_HSTP2 (*((volatile unsigned int *)(0x422C9098UL)))
#define bM4_TMRA6_HCONR_HCLE0 (*((volatile unsigned int *)(0x422C90A0UL)))
#define bM4_TMRA6_HCONR_HCLE1 (*((volatile unsigned int *)(0x422C90A4UL)))
#define bM4_TMRA6_HCONR_HCLE2 (*((volatile unsigned int *)(0x422C90A8UL)))
#define bM4_TMRA6_HCONR_HCLE3 (*((volatile unsigned int *)(0x422C90B0UL)))
#define bM4_TMRA6_HCONR_HCLE4 (*((volatile unsigned int *)(0x422C90B4UL)))
#define bM4_TMRA6_HCONR_HCLE5 (*((volatile unsigned int *)(0x422C90B8UL)))
#define bM4_TMRA6_HCONR_HCLE6 (*((volatile unsigned int *)(0x422C90BCUL)))
#define bM4_TMRA6_HCUPR_HCUP0 (*((volatile unsigned int *)(0x422C9100UL)))
#define bM4_TMRA6_HCUPR_HCUP1 (*((volatile unsigned int *)(0x422C9104UL)))
#define bM4_TMRA6_HCUPR_HCUP2 (*((volatile unsigned int *)(0x422C9108UL)))
#define bM4_TMRA6_HCUPR_HCUP3 (*((volatile unsigned int *)(0x422C910CUL)))
#define bM4_TMRA6_HCUPR_HCUP4 (*((volatile unsigned int *)(0x422C9110UL)))
#define bM4_TMRA6_HCUPR_HCUP5 (*((volatile unsigned int *)(0x422C9114UL)))
#define bM4_TMRA6_HCUPR_HCUP6 (*((volatile unsigned int *)(0x422C9118UL)))
#define bM4_TMRA6_HCUPR_HCUP7 (*((volatile unsigned int *)(0x422C911CUL)))
#define bM4_TMRA6_HCUPR_HCUP8 (*((volatile unsigned int *)(0x422C9120UL)))
#define bM4_TMRA6_HCUPR_HCUP9 (*((volatile unsigned int *)(0x422C9124UL)))
#define bM4_TMRA6_HCUPR_HCUP10 (*((volatile unsigned int *)(0x422C9128UL)))
#define bM4_TMRA6_HCUPR_HCUP11 (*((volatile unsigned int *)(0x422C912CUL)))
#define bM4_TMRA6_HCUPR_HCUP12 (*((volatile unsigned int *)(0x422C9130UL)))
#define bM4_TMRA6_HCDOR_HCDO0 (*((volatile unsigned int *)(0x422C9180UL)))
#define bM4_TMRA6_HCDOR_HCDO1 (*((volatile unsigned int *)(0x422C9184UL)))
#define bM4_TMRA6_HCDOR_HCDO2 (*((volatile unsigned int *)(0x422C9188UL)))
#define bM4_TMRA6_HCDOR_HCDO3 (*((volatile unsigned int *)(0x422C918CUL)))
#define bM4_TMRA6_HCDOR_HCDO4 (*((volatile unsigned int *)(0x422C9190UL)))
#define bM4_TMRA6_HCDOR_HCDO5 (*((volatile unsigned int *)(0x422C9194UL)))
#define bM4_TMRA6_HCDOR_HCDO6 (*((volatile unsigned int *)(0x422C9198UL)))
#define bM4_TMRA6_HCDOR_HCDO7 (*((volatile unsigned int *)(0x422C919CUL)))
#define bM4_TMRA6_HCDOR_HCDO8 (*((volatile unsigned int *)(0x422C91A0UL)))
#define bM4_TMRA6_HCDOR_HCDO9 (*((volatile unsigned int *)(0x422C91A4UL)))
#define bM4_TMRA6_HCDOR_HCDO10 (*((volatile unsigned int *)(0x422C91A8UL)))
#define bM4_TMRA6_HCDOR_HCDO11 (*((volatile unsigned int *)(0x422C91ACUL)))
#define bM4_TMRA6_HCDOR_HCDO12 (*((volatile unsigned int *)(0x422C91B0UL)))
#define bM4_TMRA6_ICONR_ITEN1 (*((volatile unsigned int *)(0x422C9200UL)))
#define bM4_TMRA6_ICONR_ITEN2 (*((volatile unsigned int *)(0x422C9204UL)))
#define bM4_TMRA6_ICONR_ITEN3 (*((volatile unsigned int *)(0x422C9208UL)))
#define bM4_TMRA6_ICONR_ITEN4 (*((volatile unsigned int *)(0x422C920CUL)))
#define bM4_TMRA6_ICONR_ITEN5 (*((volatile unsigned int *)(0x422C9210UL)))
#define bM4_TMRA6_ICONR_ITEN6 (*((volatile unsigned int *)(0x422C9214UL)))
#define bM4_TMRA6_ICONR_ITEN7 (*((volatile unsigned int *)(0x422C9218UL)))
#define bM4_TMRA6_ICONR_ITEN8 (*((volatile unsigned int *)(0x422C921CUL)))
#define bM4_TMRA6_ECONR_ETEN1 (*((volatile unsigned int *)(0x422C9280UL)))
#define bM4_TMRA6_ECONR_ETEN2 (*((volatile unsigned int *)(0x422C9284UL)))
#define bM4_TMRA6_ECONR_ETEN3 (*((volatile unsigned int *)(0x422C9288UL)))
#define bM4_TMRA6_ECONR_ETEN4 (*((volatile unsigned int *)(0x422C928CUL)))
#define bM4_TMRA6_ECONR_ETEN5 (*((volatile unsigned int *)(0x422C9290UL)))
#define bM4_TMRA6_ECONR_ETEN6 (*((volatile unsigned int *)(0x422C9294UL)))
#define bM4_TMRA6_ECONR_ETEN7 (*((volatile unsigned int *)(0x422C9298UL)))
#define bM4_TMRA6_ECONR_ETEN8 (*((volatile unsigned int *)(0x422C929CUL)))
#define bM4_TMRA6_FCONR_NOFIENTG (*((volatile unsigned int *)(0x422C9300UL)))
#define bM4_TMRA6_FCONR_NOFICKTG0 (*((volatile unsigned int *)(0x422C9304UL)))
#define bM4_TMRA6_FCONR_NOFICKTG1 (*((volatile unsigned int *)(0x422C9308UL)))
#define bM4_TMRA6_FCONR_NOFIENCA (*((volatile unsigned int *)(0x422C9320UL)))
#define bM4_TMRA6_FCONR_NOFICKCA0 (*((volatile unsigned int *)(0x422C9324UL)))
#define bM4_TMRA6_FCONR_NOFICKCA1 (*((volatile unsigned int *)(0x422C9328UL)))
#define bM4_TMRA6_FCONR_NOFIENCB (*((volatile unsigned int *)(0x422C9330UL)))
#define bM4_TMRA6_FCONR_NOFICKCB0 (*((volatile unsigned int *)(0x422C9334UL)))
#define bM4_TMRA6_FCONR_NOFICKCB1 (*((volatile unsigned int *)(0x422C9338UL)))
#define bM4_TMRA6_STFLR_CMPF1 (*((volatile unsigned int *)(0x422C9380UL)))
#define bM4_TMRA6_STFLR_CMPF2 (*((volatile unsigned int *)(0x422C9384UL)))
#define bM4_TMRA6_STFLR_CMPF3 (*((volatile unsigned int *)(0x422C9388UL)))
#define bM4_TMRA6_STFLR_CMPF4 (*((volatile unsigned int *)(0x422C938CUL)))
#define bM4_TMRA6_STFLR_CMPF5 (*((volatile unsigned int *)(0x422C9390UL)))
#define bM4_TMRA6_STFLR_CMPF6 (*((volatile unsigned int *)(0x422C9394UL)))
#define bM4_TMRA6_STFLR_CMPF7 (*((volatile unsigned int *)(0x422C9398UL)))
#define bM4_TMRA6_STFLR_CMPF8 (*((volatile unsigned int *)(0x422C939CUL)))
#define bM4_TMRA6_BCONR1_BEN (*((volatile unsigned int *)(0x422C9800UL)))
#define bM4_TMRA6_BCONR1_BSE0 (*((volatile unsigned int *)(0x422C9804UL)))
#define bM4_TMRA6_BCONR1_BSE1 (*((volatile unsigned int *)(0x422C9808UL)))
#define bM4_TMRA6_BCONR2_BEN (*((volatile unsigned int *)(0x422C9900UL)))
#define bM4_TMRA6_BCONR2_BSE0 (*((volatile unsigned int *)(0x422C9904UL)))
#define bM4_TMRA6_BCONR2_BSE1 (*((volatile unsigned int *)(0x422C9908UL)))
#define bM4_TMRA6_BCONR3_BEN (*((volatile unsigned int *)(0x422C9A00UL)))
#define bM4_TMRA6_BCONR3_BSE0 (*((volatile unsigned int *)(0x422C9A04UL)))
#define bM4_TMRA6_BCONR3_BSE1 (*((volatile unsigned int *)(0x422C9A08UL)))
#define bM4_TMRA6_BCONR4_BEN (*((volatile unsigned int *)(0x422C9B00UL)))
#define bM4_TMRA6_BCONR4_BSE0 (*((volatile unsigned int *)(0x422C9B04UL)))
#define bM4_TMRA6_BCONR4_BSE1 (*((volatile unsigned int *)(0x422C9B08UL)))
#define bM4_TMRA6_CCONR1_CAPMDA (*((volatile unsigned int *)(0x422CA000UL)))
#define bM4_TMRA6_CCONR1_HICP0 (*((volatile unsigned int *)(0x422CA010UL)))
#define bM4_TMRA6_CCONR1_HICP1 (*((volatile unsigned int *)(0x422CA014UL)))
#define bM4_TMRA6_CCONR1_HICP2 (*((volatile unsigned int *)(0x422CA018UL)))
#define bM4_TMRA6_CCONR1_HICP3 (*((volatile unsigned int *)(0x422CA020UL)))
#define bM4_TMRA6_CCONR1_HICP4 (*((volatile unsigned int *)(0x422CA024UL)))
#define bM4_TMRA6_CCONR1_NOFIENCP (*((volatile unsigned int *)(0x422CA030UL)))
#define bM4_TMRA6_CCONR1_NOFICKCP0 (*((volatile unsigned int *)(0x422CA034UL)))
#define bM4_TMRA6_CCONR1_NOFICKCP1 (*((volatile unsigned int *)(0x422CA038UL)))
#define bM4_TMRA6_CCONR2_CAPMDA (*((volatile unsigned int *)(0x422CA080UL)))
#define bM4_TMRA6_CCONR2_HICP0 (*((volatile unsigned int *)(0x422CA090UL)))
#define bM4_TMRA6_CCONR2_HICP1 (*((volatile unsigned int *)(0x422CA094UL)))
#define bM4_TMRA6_CCONR2_HICP2 (*((volatile unsigned int *)(0x422CA098UL)))
#define bM4_TMRA6_CCONR2_HICP3 (*((volatile unsigned int *)(0x422CA0A0UL)))
#define bM4_TMRA6_CCONR2_HICP4 (*((volatile unsigned int *)(0x422CA0A4UL)))
#define bM4_TMRA6_CCONR2_NOFIENCP (*((volatile unsigned int *)(0x422CA0B0UL)))
#define bM4_TMRA6_CCONR2_NOFICKCP0 (*((volatile unsigned int *)(0x422CA0B4UL)))
#define bM4_TMRA6_CCONR2_NOFICKCP1 (*((volatile unsigned int *)(0x422CA0B8UL)))
#define bM4_TMRA6_CCONR3_CAPMDA (*((volatile unsigned int *)(0x422CA100UL)))
#define bM4_TMRA6_CCONR3_HICP0 (*((volatile unsigned int *)(0x422CA110UL)))
#define bM4_TMRA6_CCONR3_HICP1 (*((volatile unsigned int *)(0x422CA114UL)))
#define bM4_TMRA6_CCONR3_HICP2 (*((volatile unsigned int *)(0x422CA118UL)))
#define bM4_TMRA6_CCONR3_HICP3 (*((volatile unsigned int *)(0x422CA120UL)))
#define bM4_TMRA6_CCONR3_HICP4 (*((volatile unsigned int *)(0x422CA124UL)))
#define bM4_TMRA6_CCONR3_NOFIENCP (*((volatile unsigned int *)(0x422CA130UL)))
#define bM4_TMRA6_CCONR3_NOFICKCP0 (*((volatile unsigned int *)(0x422CA134UL)))
#define bM4_TMRA6_CCONR3_NOFICKCP1 (*((volatile unsigned int *)(0x422CA138UL)))
#define bM4_TMRA6_CCONR4_CAPMDA (*((volatile unsigned int *)(0x422CA180UL)))
#define bM4_TMRA6_CCONR4_HICP0 (*((volatile unsigned int *)(0x422CA190UL)))
#define bM4_TMRA6_CCONR4_HICP1 (*((volatile unsigned int *)(0x422CA194UL)))
#define bM4_TMRA6_CCONR4_HICP2 (*((volatile unsigned int *)(0x422CA198UL)))
#define bM4_TMRA6_CCONR4_HICP3 (*((volatile unsigned int *)(0x422CA1A0UL)))
#define bM4_TMRA6_CCONR4_HICP4 (*((volatile unsigned int *)(0x422CA1A4UL)))
#define bM4_TMRA6_CCONR4_NOFIENCP (*((volatile unsigned int *)(0x422CA1B0UL)))
#define bM4_TMRA6_CCONR4_NOFICKCP0 (*((volatile unsigned int *)(0x422CA1B4UL)))
#define bM4_TMRA6_CCONR4_NOFICKCP1 (*((volatile unsigned int *)(0x422CA1B8UL)))
#define bM4_TMRA6_CCONR5_CAPMDA (*((volatile unsigned int *)(0x422CA200UL)))
#define bM4_TMRA6_CCONR5_HICP0 (*((volatile unsigned int *)(0x422CA210UL)))
#define bM4_TMRA6_CCONR5_HICP1 (*((volatile unsigned int *)(0x422CA214UL)))
#define bM4_TMRA6_CCONR5_HICP2 (*((volatile unsigned int *)(0x422CA218UL)))
#define bM4_TMRA6_CCONR5_HICP3 (*((volatile unsigned int *)(0x422CA220UL)))
#define bM4_TMRA6_CCONR5_HICP4 (*((volatile unsigned int *)(0x422CA224UL)))
#define bM4_TMRA6_CCONR5_NOFIENCP (*((volatile unsigned int *)(0x422CA230UL)))
#define bM4_TMRA6_CCONR5_NOFICKCP0 (*((volatile unsigned int *)(0x422CA234UL)))
#define bM4_TMRA6_CCONR5_NOFICKCP1 (*((volatile unsigned int *)(0x422CA238UL)))
#define bM4_TMRA6_CCONR6_CAPMDA (*((volatile unsigned int *)(0x422CA280UL)))
#define bM4_TMRA6_CCONR6_HICP0 (*((volatile unsigned int *)(0x422CA290UL)))
#define bM4_TMRA6_CCONR6_HICP1 (*((volatile unsigned int *)(0x422CA294UL)))
#define bM4_TMRA6_CCONR6_HICP2 (*((volatile unsigned int *)(0x422CA298UL)))
#define bM4_TMRA6_CCONR6_HICP3 (*((volatile unsigned int *)(0x422CA2A0UL)))
#define bM4_TMRA6_CCONR6_HICP4 (*((volatile unsigned int *)(0x422CA2A4UL)))
#define bM4_TMRA6_CCONR6_NOFIENCP (*((volatile unsigned int *)(0x422CA2B0UL)))
#define bM4_TMRA6_CCONR6_NOFICKCP0 (*((volatile unsigned int *)(0x422CA2B4UL)))
#define bM4_TMRA6_CCONR6_NOFICKCP1 (*((volatile unsigned int *)(0x422CA2B8UL)))
#define bM4_TMRA6_CCONR7_CAPMDA (*((volatile unsigned int *)(0x422CA300UL)))
#define bM4_TMRA6_CCONR7_HICP0 (*((volatile unsigned int *)(0x422CA310UL)))
#define bM4_TMRA6_CCONR7_HICP1 (*((volatile unsigned int *)(0x422CA314UL)))
#define bM4_TMRA6_CCONR7_HICP2 (*((volatile unsigned int *)(0x422CA318UL)))
#define bM4_TMRA6_CCONR7_HICP3 (*((volatile unsigned int *)(0x422CA320UL)))
#define bM4_TMRA6_CCONR7_HICP4 (*((volatile unsigned int *)(0x422CA324UL)))
#define bM4_TMRA6_CCONR7_NOFIENCP (*((volatile unsigned int *)(0x422CA330UL)))
#define bM4_TMRA6_CCONR7_NOFICKCP0 (*((volatile unsigned int *)(0x422CA334UL)))
#define bM4_TMRA6_CCONR7_NOFICKCP1 (*((volatile unsigned int *)(0x422CA338UL)))
#define bM4_TMRA6_CCONR8_CAPMDA (*((volatile unsigned int *)(0x422CA380UL)))
#define bM4_TMRA6_CCONR8_HICP0 (*((volatile unsigned int *)(0x422CA390UL)))
#define bM4_TMRA6_CCONR8_HICP1 (*((volatile unsigned int *)(0x422CA394UL)))
#define bM4_TMRA6_CCONR8_HICP2 (*((volatile unsigned int *)(0x422CA398UL)))
#define bM4_TMRA6_CCONR8_HICP3 (*((volatile unsigned int *)(0x422CA3A0UL)))
#define bM4_TMRA6_CCONR8_HICP4 (*((volatile unsigned int *)(0x422CA3A4UL)))
#define bM4_TMRA6_CCONR8_NOFIENCP (*((volatile unsigned int *)(0x422CA3B0UL)))
#define bM4_TMRA6_CCONR8_NOFICKCP0 (*((volatile unsigned int *)(0x422CA3B4UL)))
#define bM4_TMRA6_CCONR8_NOFICKCP1 (*((volatile unsigned int *)(0x422CA3B8UL)))
#define bM4_TMRA6_PCONR1_STAC0 (*((volatile unsigned int *)(0x422CA800UL)))
#define bM4_TMRA6_PCONR1_STAC1 (*((volatile unsigned int *)(0x422CA804UL)))
#define bM4_TMRA6_PCONR1_STPC0 (*((volatile unsigned int *)(0x422CA808UL)))
#define bM4_TMRA6_PCONR1_STPC1 (*((volatile unsigned int *)(0x422CA80CUL)))
#define bM4_TMRA6_PCONR1_CMPC0 (*((volatile unsigned int *)(0x422CA810UL)))
#define bM4_TMRA6_PCONR1_CMPC1 (*((volatile unsigned int *)(0x422CA814UL)))
#define bM4_TMRA6_PCONR1_PERC0 (*((volatile unsigned int *)(0x422CA818UL)))
#define bM4_TMRA6_PCONR1_PERC1 (*((volatile unsigned int *)(0x422CA81CUL)))
#define bM4_TMRA6_PCONR1_FORC0 (*((volatile unsigned int *)(0x422CA820UL)))
#define bM4_TMRA6_PCONR1_FORC1 (*((volatile unsigned int *)(0x422CA824UL)))
#define bM4_TMRA6_PCONR1_OUTEN (*((volatile unsigned int *)(0x422CA830UL)))
#define bM4_TMRA6_PCONR2_STAC0 (*((volatile unsigned int *)(0x422CA880UL)))
#define bM4_TMRA6_PCONR2_STAC1 (*((volatile unsigned int *)(0x422CA884UL)))
#define bM4_TMRA6_PCONR2_STPC0 (*((volatile unsigned int *)(0x422CA888UL)))
#define bM4_TMRA6_PCONR2_STPC1 (*((volatile unsigned int *)(0x422CA88CUL)))
#define bM4_TMRA6_PCONR2_CMPC0 (*((volatile unsigned int *)(0x422CA890UL)))
#define bM4_TMRA6_PCONR2_CMPC1 (*((volatile unsigned int *)(0x422CA894UL)))
#define bM4_TMRA6_PCONR2_PERC0 (*((volatile unsigned int *)(0x422CA898UL)))
#define bM4_TMRA6_PCONR2_PERC1 (*((volatile unsigned int *)(0x422CA89CUL)))
#define bM4_TMRA6_PCONR2_FORC0 (*((volatile unsigned int *)(0x422CA8A0UL)))
#define bM4_TMRA6_PCONR2_FORC1 (*((volatile unsigned int *)(0x422CA8A4UL)))
#define bM4_TMRA6_PCONR2_OUTEN (*((volatile unsigned int *)(0x422CA8B0UL)))
#define bM4_TMRA6_PCONR3_STAC0 (*((volatile unsigned int *)(0x422CA900UL)))
#define bM4_TMRA6_PCONR3_STAC1 (*((volatile unsigned int *)(0x422CA904UL)))
#define bM4_TMRA6_PCONR3_STPC0 (*((volatile unsigned int *)(0x422CA908UL)))
#define bM4_TMRA6_PCONR3_STPC1 (*((volatile unsigned int *)(0x422CA90CUL)))
#define bM4_TMRA6_PCONR3_CMPC0 (*((volatile unsigned int *)(0x422CA910UL)))
#define bM4_TMRA6_PCONR3_CMPC1 (*((volatile unsigned int *)(0x422CA914UL)))
#define bM4_TMRA6_PCONR3_PERC0 (*((volatile unsigned int *)(0x422CA918UL)))
#define bM4_TMRA6_PCONR3_PERC1 (*((volatile unsigned int *)(0x422CA91CUL)))
#define bM4_TMRA6_PCONR3_FORC0 (*((volatile unsigned int *)(0x422CA920UL)))
#define bM4_TMRA6_PCONR3_FORC1 (*((volatile unsigned int *)(0x422CA924UL)))
#define bM4_TMRA6_PCONR3_OUTEN (*((volatile unsigned int *)(0x422CA930UL)))
#define bM4_TMRA6_PCONR4_STAC0 (*((volatile unsigned int *)(0x422CA980UL)))
#define bM4_TMRA6_PCONR4_STAC1 (*((volatile unsigned int *)(0x422CA984UL)))
#define bM4_TMRA6_PCONR4_STPC0 (*((volatile unsigned int *)(0x422CA988UL)))
#define bM4_TMRA6_PCONR4_STPC1 (*((volatile unsigned int *)(0x422CA98CUL)))
#define bM4_TMRA6_PCONR4_CMPC0 (*((volatile unsigned int *)(0x422CA990UL)))
#define bM4_TMRA6_PCONR4_CMPC1 (*((volatile unsigned int *)(0x422CA994UL)))
#define bM4_TMRA6_PCONR4_PERC0 (*((volatile unsigned int *)(0x422CA998UL)))
#define bM4_TMRA6_PCONR4_PERC1 (*((volatile unsigned int *)(0x422CA99CUL)))
#define bM4_TMRA6_PCONR4_FORC0 (*((volatile unsigned int *)(0x422CA9A0UL)))
#define bM4_TMRA6_PCONR4_FORC1 (*((volatile unsigned int *)(0x422CA9A4UL)))
#define bM4_TMRA6_PCONR4_OUTEN (*((volatile unsigned int *)(0x422CA9B0UL)))
#define bM4_TMRA6_PCONR5_STAC0 (*((volatile unsigned int *)(0x422CAA00UL)))
#define bM4_TMRA6_PCONR5_STAC1 (*((volatile unsigned int *)(0x422CAA04UL)))
#define bM4_TMRA6_PCONR5_STPC0 (*((volatile unsigned int *)(0x422CAA08UL)))
#define bM4_TMRA6_PCONR5_STPC1 (*((volatile unsigned int *)(0x422CAA0CUL)))
#define bM4_TMRA6_PCONR5_CMPC0 (*((volatile unsigned int *)(0x422CAA10UL)))
#define bM4_TMRA6_PCONR5_CMPC1 (*((volatile unsigned int *)(0x422CAA14UL)))
#define bM4_TMRA6_PCONR5_PERC0 (*((volatile unsigned int *)(0x422CAA18UL)))
#define bM4_TMRA6_PCONR5_PERC1 (*((volatile unsigned int *)(0x422CAA1CUL)))
#define bM4_TMRA6_PCONR5_FORC0 (*((volatile unsigned int *)(0x422CAA20UL)))
#define bM4_TMRA6_PCONR5_FORC1 (*((volatile unsigned int *)(0x422CAA24UL)))
#define bM4_TMRA6_PCONR5_OUTEN (*((volatile unsigned int *)(0x422CAA30UL)))
#define bM4_TMRA6_PCONR6_STAC0 (*((volatile unsigned int *)(0x422CAA80UL)))
#define bM4_TMRA6_PCONR6_STAC1 (*((volatile unsigned int *)(0x422CAA84UL)))
#define bM4_TMRA6_PCONR6_STPC0 (*((volatile unsigned int *)(0x422CAA88UL)))
#define bM4_TMRA6_PCONR6_STPC1 (*((volatile unsigned int *)(0x422CAA8CUL)))
#define bM4_TMRA6_PCONR6_CMPC0 (*((volatile unsigned int *)(0x422CAA90UL)))
#define bM4_TMRA6_PCONR6_CMPC1 (*((volatile unsigned int *)(0x422CAA94UL)))
#define bM4_TMRA6_PCONR6_PERC0 (*((volatile unsigned int *)(0x422CAA98UL)))
#define bM4_TMRA6_PCONR6_PERC1 (*((volatile unsigned int *)(0x422CAA9CUL)))
#define bM4_TMRA6_PCONR6_FORC0 (*((volatile unsigned int *)(0x422CAAA0UL)))
#define bM4_TMRA6_PCONR6_FORC1 (*((volatile unsigned int *)(0x422CAAA4UL)))
#define bM4_TMRA6_PCONR6_OUTEN (*((volatile unsigned int *)(0x422CAAB0UL)))
#define bM4_TMRA6_PCONR7_STAC0 (*((volatile unsigned int *)(0x422CAB00UL)))
#define bM4_TMRA6_PCONR7_STAC1 (*((volatile unsigned int *)(0x422CAB04UL)))
#define bM4_TMRA6_PCONR7_STPC0 (*((volatile unsigned int *)(0x422CAB08UL)))
#define bM4_TMRA6_PCONR7_STPC1 (*((volatile unsigned int *)(0x422CAB0CUL)))
#define bM4_TMRA6_PCONR7_CMPC0 (*((volatile unsigned int *)(0x422CAB10UL)))
#define bM4_TMRA6_PCONR7_CMPC1 (*((volatile unsigned int *)(0x422CAB14UL)))
#define bM4_TMRA6_PCONR7_PERC0 (*((volatile unsigned int *)(0x422CAB18UL)))
#define bM4_TMRA6_PCONR7_PERC1 (*((volatile unsigned int *)(0x422CAB1CUL)))
#define bM4_TMRA6_PCONR7_FORC0 (*((volatile unsigned int *)(0x422CAB20UL)))
#define bM4_TMRA6_PCONR7_FORC1 (*((volatile unsigned int *)(0x422CAB24UL)))
#define bM4_TMRA6_PCONR7_OUTEN (*((volatile unsigned int *)(0x422CAB30UL)))
#define bM4_TMRA6_PCONR8_STAC0 (*((volatile unsigned int *)(0x422CAB80UL)))
#define bM4_TMRA6_PCONR8_STAC1 (*((volatile unsigned int *)(0x422CAB84UL)))
#define bM4_TMRA6_PCONR8_STPC0 (*((volatile unsigned int *)(0x422CAB88UL)))
#define bM4_TMRA6_PCONR8_STPC1 (*((volatile unsigned int *)(0x422CAB8CUL)))
#define bM4_TMRA6_PCONR8_CMPC0 (*((volatile unsigned int *)(0x422CAB90UL)))
#define bM4_TMRA6_PCONR8_CMPC1 (*((volatile unsigned int *)(0x422CAB94UL)))
#define bM4_TMRA6_PCONR8_PERC0 (*((volatile unsigned int *)(0x422CAB98UL)))
#define bM4_TMRA6_PCONR8_PERC1 (*((volatile unsigned int *)(0x422CAB9CUL)))
#define bM4_TMRA6_PCONR8_FORC0 (*((volatile unsigned int *)(0x422CABA0UL)))
#define bM4_TMRA6_PCONR8_FORC1 (*((volatile unsigned int *)(0x422CABA4UL)))
#define bM4_TMRA6_PCONR8_OUTEN (*((volatile unsigned int *)(0x422CABB0UL)))
#define bM4_TRNG_CR_EN (*((volatile unsigned int *)(0x42820000UL)))
#define bM4_TRNG_CR_RUN (*((volatile unsigned int *)(0x42820004UL)))
#define bM4_TRNG_MR_LOAD (*((volatile unsigned int *)(0x42820080UL)))
#define bM4_TRNG_MR_CNT0 (*((volatile unsigned int *)(0x42820088UL)))
#define bM4_TRNG_MR_CNT1 (*((volatile unsigned int *)(0x4282008CUL)))
#define bM4_TRNG_MR_CNT2 (*((volatile unsigned int *)(0x42820090UL)))
#define bM4_USART1_SR_PE (*((volatile unsigned int *)(0x423A0000UL)))
#define bM4_USART1_SR_FE (*((volatile unsigned int *)(0x423A0004UL)))
#define bM4_USART1_SR_ORE (*((volatile unsigned int *)(0x423A000CUL)))
#define bM4_USART1_SR_RXNE (*((volatile unsigned int *)(0x423A0014UL)))
#define bM4_USART1_SR_TC (*((volatile unsigned int *)(0x423A0018UL)))
#define bM4_USART1_SR_TXE (*((volatile unsigned int *)(0x423A001CUL)))
#define bM4_USART1_SR_RTOF (*((volatile unsigned int *)(0x423A0020UL)))
#define bM4_USART1_SR_MPB (*((volatile unsigned int *)(0x423A0040UL)))
#define bM4_USART1_DR_TDR0 (*((volatile unsigned int *)(0x423A0080UL)))
#define bM4_USART1_DR_TDR1 (*((volatile unsigned int *)(0x423A0084UL)))
#define bM4_USART1_DR_TDR2 (*((volatile unsigned int *)(0x423A0088UL)))
#define bM4_USART1_DR_TDR3 (*((volatile unsigned int *)(0x423A008CUL)))
#define bM4_USART1_DR_TDR4 (*((volatile unsigned int *)(0x423A0090UL)))
#define bM4_USART1_DR_TDR5 (*((volatile unsigned int *)(0x423A0094UL)))
#define bM4_USART1_DR_TDR6 (*((volatile unsigned int *)(0x423A0098UL)))
#define bM4_USART1_DR_TDR7 (*((volatile unsigned int *)(0x423A009CUL)))
#define bM4_USART1_DR_TDR8 (*((volatile unsigned int *)(0x423A00A0UL)))
#define bM4_USART1_DR_MPID (*((volatile unsigned int *)(0x423A00A4UL)))
#define bM4_USART1_DR_RDR0 (*((volatile unsigned int *)(0x423A00C0UL)))
#define bM4_USART1_DR_RDR1 (*((volatile unsigned int *)(0x423A00C4UL)))
#define bM4_USART1_DR_RDR2 (*((volatile unsigned int *)(0x423A00C8UL)))
#define bM4_USART1_DR_RDR3 (*((volatile unsigned int *)(0x423A00CCUL)))
#define bM4_USART1_DR_RDR4 (*((volatile unsigned int *)(0x423A00D0UL)))
#define bM4_USART1_DR_RDR5 (*((volatile unsigned int *)(0x423A00D4UL)))
#define bM4_USART1_DR_RDR6 (*((volatile unsigned int *)(0x423A00D8UL)))
#define bM4_USART1_DR_RDR7 (*((volatile unsigned int *)(0x423A00DCUL)))
#define bM4_USART1_DR_RDR8 (*((volatile unsigned int *)(0x423A00E0UL)))
#define bM4_USART1_BRR_DIV_FRACTION0 (*((volatile unsigned int *)(0x423A0100UL)))
#define bM4_USART1_BRR_DIV_FRACTION1 (*((volatile unsigned int *)(0x423A0104UL)))
#define bM4_USART1_BRR_DIV_FRACTION2 (*((volatile unsigned int *)(0x423A0108UL)))
#define bM4_USART1_BRR_DIV_FRACTION3 (*((volatile unsigned int *)(0x423A010CUL)))
#define bM4_USART1_BRR_DIV_FRACTION4 (*((volatile unsigned int *)(0x423A0110UL)))
#define bM4_USART1_BRR_DIV_FRACTION5 (*((volatile unsigned int *)(0x423A0114UL)))
#define bM4_USART1_BRR_DIV_FRACTION6 (*((volatile unsigned int *)(0x423A0118UL)))
#define bM4_USART1_BRR_DIV_INTEGER0 (*((volatile unsigned int *)(0x423A0120UL)))
#define bM4_USART1_BRR_DIV_INTEGER1 (*((volatile unsigned int *)(0x423A0124UL)))
#define bM4_USART1_BRR_DIV_INTEGER2 (*((volatile unsigned int *)(0x423A0128UL)))
