MarlinFirmware/Marlin/Marlin/lib/h32_core/main/hdsc32core/common/hc32f46x.h
#define bM4_USBFS_HCTSIZ6_XFRSIZ11 (*((volatile unsigned int *)(0x4380BA2CUL)))
#define bM4_USBFS_HCTSIZ6_XFRSIZ12 (*((volatile unsigned int *)(0x4380BA30UL)))
#define bM4_USBFS_HCTSIZ6_XFRSIZ13 (*((volatile unsigned int *)(0x4380BA34UL)))
#define bM4_USBFS_HCTSIZ6_XFRSIZ14 (*((volatile unsigned int *)(0x4380BA38UL)))
#define bM4_USBFS_HCTSIZ6_XFRSIZ15 (*((volatile unsigned int *)(0x4380BA3CUL)))
#define bM4_USBFS_HCTSIZ6_XFRSIZ16 (*((volatile unsigned int *)(0x4380BA40UL)))
#define bM4_USBFS_HCTSIZ6_XFRSIZ17 (*((volatile unsigned int *)(0x4380BA44UL)))
#define bM4_USBFS_HCTSIZ6_XFRSIZ18 (*((volatile unsigned int *)(0x4380BA48UL)))
#define bM4_USBFS_HCTSIZ6_PKTCNT0 (*((volatile unsigned int *)(0x4380BA4CUL)))
#define bM4_USBFS_HCTSIZ6_PKTCNT1 (*((volatile unsigned int *)(0x4380BA50UL)))
#define bM4_USBFS_HCTSIZ6_PKTCNT2 (*((volatile unsigned int *)(0x4380BA54UL)))
#define bM4_USBFS_HCTSIZ6_PKTCNT3 (*((volatile unsigned int *)(0x4380BA58UL)))
#define bM4_USBFS_HCTSIZ6_PKTCNT4 (*((volatile unsigned int *)(0x4380BA5CUL)))
#define bM4_USBFS_HCTSIZ6_PKTCNT5 (*((volatile unsigned int *)(0x4380BA60UL)))
#define bM4_USBFS_HCTSIZ6_PKTCNT6 (*((volatile unsigned int *)(0x4380BA64UL)))
#define bM4_USBFS_HCTSIZ6_PKTCNT7 (*((volatile unsigned int *)(0x4380BA68UL)))
#define bM4_USBFS_HCTSIZ6_PKTCNT8 (*((volatile unsigned int *)(0x4380BA6CUL)))
#define bM4_USBFS_HCTSIZ6_PKTCNT9 (*((volatile unsigned int *)(0x4380BA70UL)))
#define bM4_USBFS_HCTSIZ6_DPID0 (*((volatile unsigned int *)(0x4380BA74UL)))
#define bM4_USBFS_HCTSIZ6_DPID1 (*((volatile unsigned int *)(0x4380BA78UL)))
#define bM4_USBFS_HCCHAR7_MPSIZ0 (*((volatile unsigned int *)(0x4380BC00UL)))
#define bM4_USBFS_HCCHAR7_MPSIZ1 (*((volatile unsigned int *)(0x4380BC04UL)))
#define bM4_USBFS_HCCHAR7_MPSIZ2 (*((volatile unsigned int *)(0x4380BC08UL)))
#define bM4_USBFS_HCCHAR7_MPSIZ3 (*((volatile unsigned int *)(0x4380BC0CUL)))
#define bM4_USBFS_HCCHAR7_MPSIZ4 (*((volatile unsigned int *)(0x4380BC10UL)))
#define bM4_USBFS_HCCHAR7_MPSIZ5 (*((volatile unsigned int *)(0x4380BC14UL)))
#define bM4_USBFS_HCCHAR7_MPSIZ6 (*((volatile unsigned int *)(0x4380BC18UL)))
#define bM4_USBFS_HCCHAR7_MPSIZ7 (*((volatile unsigned int *)(0x4380BC1CUL)))
#define bM4_USBFS_HCCHAR7_MPSIZ8 (*((volatile unsigned int *)(0x4380BC20UL)))
#define bM4_USBFS_HCCHAR7_MPSIZ9 (*((volatile unsigned int *)(0x4380BC24UL)))
#define bM4_USBFS_HCCHAR7_MPSIZ10 (*((volatile unsigned int *)(0x4380BC28UL)))
#define bM4_USBFS_HCCHAR7_EPNUM0 (*((volatile unsigned int *)(0x4380BC2CUL)))
#define bM4_USBFS_HCCHAR7_EPNUM1 (*((volatile unsigned int *)(0x4380BC30UL)))
#define bM4_USBFS_HCCHAR7_EPNUM2 (*((volatile unsigned int *)(0x4380BC34UL)))
#define bM4_USBFS_HCCHAR7_EPNUM3 (*((volatile unsigned int *)(0x4380BC38UL)))
#define bM4_USBFS_HCCHAR7_EPDIR (*((volatile unsigned int *)(0x4380BC3CUL)))
#define bM4_USBFS_HCCHAR7_LSDEV (*((volatile unsigned int *)(0x4380BC44UL)))
#define bM4_USBFS_HCCHAR7_EPTYP0 (*((volatile unsigned int *)(0x4380BC48UL)))
#define bM4_USBFS_HCCHAR7_EPTYP1 (*((volatile unsigned int *)(0x4380BC4CUL)))
#define bM4_USBFS_HCCHAR7_DAD0 (*((volatile unsigned int *)(0x4380BC58UL)))
#define bM4_USBFS_HCCHAR7_DAD1 (*((volatile unsigned int *)(0x4380BC5CUL)))
#define bM4_USBFS_HCCHAR7_DAD2 (*((volatile unsigned int *)(0x4380BC60UL)))
#define bM4_USBFS_HCCHAR7_DAD3 (*((volatile unsigned int *)(0x4380BC64UL)))
#define bM4_USBFS_HCCHAR7_DAD4 (*((volatile unsigned int *)(0x4380BC68UL)))
#define bM4_USBFS_HCCHAR7_DAD5 (*((volatile unsigned int *)(0x4380BC6CUL)))
#define bM4_USBFS_HCCHAR7_DAD6 (*((volatile unsigned int *)(0x4380BC70UL)))
#define bM4_USBFS_HCCHAR7_ODDFRM (*((volatile unsigned int *)(0x4380BC74UL)))
#define bM4_USBFS_HCCHAR7_CHDIS (*((volatile unsigned int *)(0x4380BC78UL)))
#define bM4_USBFS_HCCHAR7_CHENA (*((volatile unsigned int *)(0x4380BC7CUL)))
#define bM4_USBFS_HCINT7_XFRC (*((volatile unsigned int *)(0x4380BD00UL)))
#define bM4_USBFS_HCINT7_CHH (*((volatile unsigned int *)(0x4380BD04UL)))
#define bM4_USBFS_HCINT7_STALL (*((volatile unsigned int *)(0x4380BD0CUL)))
#define bM4_USBFS_HCINT7_NAK (*((volatile unsigned int *)(0x4380BD10UL)))
#define bM4_USBFS_HCINT7_ACK (*((volatile unsigned int *)(0x4380BD14UL)))
#define bM4_USBFS_HCINT7_TXERR (*((volatile unsigned int *)(0x4380BD1CUL)))
#define bM4_USBFS_HCINT7_BBERR (*((volatile unsigned int *)(0x4380BD20UL)))
#define bM4_USBFS_HCINT7_FRMOR (*((volatile unsigned int *)(0x4380BD24UL)))
#define bM4_USBFS_HCINT7_DTERR (*((volatile unsigned int *)(0x4380BD28UL)))
#define bM4_USBFS_HCINTMSK7_XFRCM (*((volatile unsigned int *)(0x4380BD80UL)))
#define bM4_USBFS_HCINTMSK7_CHHM (*((volatile unsigned int *)(0x4380BD84UL)))
#define bM4_USBFS_HCINTMSK7_STALLM (*((volatile unsigned int *)(0x4380BD8CUL)))
#define bM4_USBFS_HCINTMSK7_NAKM (*((volatile unsigned int *)(0x4380BD90UL)))
#define bM4_USBFS_HCINTMSK7_ACKM (*((volatile unsigned int *)(0x4380BD94UL)))
#define bM4_USBFS_HCINTMSK7_TXERRM (*((volatile unsigned int *)(0x4380BD9CUL)))
#define bM4_USBFS_HCINTMSK7_BBERRM (*((volatile unsigned int *)(0x4380BDA0UL)))
#define bM4_USBFS_HCINTMSK7_FRMORM (*((volatile unsigned int *)(0x4380BDA4UL)))
#define bM4_USBFS_HCINTMSK7_DTERRM (*((volatile unsigned int *)(0x4380BDA8UL)))
#define bM4_USBFS_HCTSIZ7_XFRSIZ0 (*((volatile unsigned int *)(0x4380BE00UL)))
#define bM4_USBFS_HCTSIZ7_XFRSIZ1 (*((volatile unsigned int *)(0x4380BE04UL)))
#define bM4_USBFS_HCTSIZ7_XFRSIZ2 (*((volatile unsigned int *)(0x4380BE08UL)))
#define bM4_USBFS_HCTSIZ7_XFRSIZ3 (*((volatile unsigned int *)(0x4380BE0CUL)))
#define bM4_USBFS_HCTSIZ7_XFRSIZ4 (*((volatile unsigned int *)(0x4380BE10UL)))
#define bM4_USBFS_HCTSIZ7_XFRSIZ5 (*((volatile unsigned int *)(0x4380BE14UL)))
#define bM4_USBFS_HCTSIZ7_XFRSIZ6 (*((volatile unsigned int *)(0x4380BE18UL)))
#define bM4_USBFS_HCTSIZ7_XFRSIZ7 (*((volatile unsigned int *)(0x4380BE1CUL)))
#define bM4_USBFS_HCTSIZ7_XFRSIZ8 (*((volatile unsigned int *)(0x4380BE20UL)))
#define bM4_USBFS_HCTSIZ7_XFRSIZ9 (*((volatile unsigned int *)(0x4380BE24UL)))
#define bM4_USBFS_HCTSIZ7_XFRSIZ10 (*((volatile unsigned int *)(0x4380BE28UL)))
#define bM4_USBFS_HCTSIZ7_XFRSIZ11 (*((volatile unsigned int *)(0x4380BE2CUL)))
#define bM4_USBFS_HCTSIZ7_XFRSIZ12 (*((volatile unsigned int *)(0x4380BE30UL)))
#define bM4_USBFS_HCTSIZ7_XFRSIZ13 (*((volatile unsigned int *)(0x4380BE34UL)))
#define bM4_USBFS_HCTSIZ7_XFRSIZ14 (*((volatile unsigned int *)(0x4380BE38UL)))
#define bM4_USBFS_HCTSIZ7_XFRSIZ15 (*((volatile unsigned int *)(0x4380BE3CUL)))
#define bM4_USBFS_HCTSIZ7_XFRSIZ16 (*((volatile unsigned int *)(0x4380BE40UL)))
#define bM4_USBFS_HCTSIZ7_XFRSIZ17 (*((volatile unsigned int *)(0x4380BE44UL)))
#define bM4_USBFS_HCTSIZ7_XFRSIZ18 (*((volatile unsigned int *)(0x4380BE48UL)))
#define bM4_USBFS_HCTSIZ7_PKTCNT0 (*((volatile unsigned int *)(0x4380BE4CUL)))
#define bM4_USBFS_HCTSIZ7_PKTCNT1 (*((volatile unsigned int *)(0x4380BE50UL)))
#define bM4_USBFS_HCTSIZ7_PKTCNT2 (*((volatile unsigned int *)(0x4380BE54UL)))
#define bM4_USBFS_HCTSIZ7_PKTCNT3 (*((volatile unsigned int *)(0x4380BE58UL)))
#define bM4_USBFS_HCTSIZ7_PKTCNT4 (*((volatile unsigned int *)(0x4380BE5CUL)))
#define bM4_USBFS_HCTSIZ7_PKTCNT5 (*((volatile unsigned int *)(0x4380BE60UL)))
#define bM4_USBFS_HCTSIZ7_PKTCNT6 (*((volatile unsigned int *)(0x4380BE64UL)))
#define bM4_USBFS_HCTSIZ7_PKTCNT7 (*((volatile unsigned int *)(0x4380BE68UL)))
#define bM4_USBFS_HCTSIZ7_PKTCNT8 (*((volatile unsigned int *)(0x4380BE6CUL)))
#define bM4_USBFS_HCTSIZ7_PKTCNT9 (*((volatile unsigned int *)(0x4380BE70UL)))
#define bM4_USBFS_HCTSIZ7_DPID0 (*((volatile unsigned int *)(0x4380BE74UL)))
#define bM4_USBFS_HCTSIZ7_DPID1 (*((volatile unsigned int *)(0x4380BE78UL)))
#define bM4_USBFS_HCCHAR8_MPSIZ0 (*((volatile unsigned int *)(0x4380C000UL)))
#define bM4_USBFS_HCCHAR8_MPSIZ1 (*((volatile unsigned int *)(0x4380C004UL)))
#define bM4_USBFS_HCCHAR8_MPSIZ2 (*((volatile unsigned int *)(0x4380C008UL)))
#define bM4_USBFS_HCCHAR8_MPSIZ3 (*((volatile unsigned int *)(0x4380C00CUL)))
#define bM4_USBFS_HCCHAR8_MPSIZ4 (*((volatile unsigned int *)(0x4380C010UL)))
#define bM4_USBFS_HCCHAR8_MPSIZ5 (*((volatile unsigned int *)(0x4380C014UL)))
#define bM4_USBFS_HCCHAR8_MPSIZ6 (*((volatile unsigned int *)(0x4380C018UL)))
#define bM4_USBFS_HCCHAR8_MPSIZ7 (*((volatile unsigned int *)(0x4380C01CUL)))
#define bM4_USBFS_HCCHAR8_MPSIZ8 (*((volatile unsigned int *)(0x4380C020UL)))
#define bM4_USBFS_HCCHAR8_MPSIZ9 (*((volatile unsigned int *)(0x4380C024UL)))
#define bM4_USBFS_HCCHAR8_MPSIZ10 (*((volatile unsigned int *)(0x4380C028UL)))
#define bM4_USBFS_HCCHAR8_EPNUM0 (*((volatile unsigned int *)(0x4380C02CUL)))
#define bM4_USBFS_HCCHAR8_EPNUM1 (*((volatile unsigned int *)(0x4380C030UL)))
#define bM4_USBFS_HCCHAR8_EPNUM2 (*((volatile unsigned int *)(0x4380C034UL)))
#define bM4_USBFS_HCCHAR8_EPNUM3 (*((volatile unsigned int *)(0x4380C038UL)))
#define bM4_USBFS_HCCHAR8_EPDIR (*((volatile unsigned int *)(0x4380C03CUL)))
#define bM4_USBFS_HCCHAR8_LSDEV (*((volatile unsigned int *)(0x4380C044UL)))
#define bM4_USBFS_HCCHAR8_EPTYP0 (*((volatile unsigned int *)(0x4380C048UL)))
#define bM4_USBFS_HCCHAR8_EPTYP1 (*((volatile unsigned int *)(0x4380C04CUL)))
#define bM4_USBFS_HCCHAR8_DAD0 (*((volatile unsigned int *)(0x4380C058UL)))
#define bM4_USBFS_HCCHAR8_DAD1 (*((volatile unsigned int *)(0x4380C05CUL)))
#define bM4_USBFS_HCCHAR8_DAD2 (*((volatile unsigned int *)(0x4380C060UL)))
#define bM4_USBFS_HCCHAR8_DAD3 (*((volatile unsigned int *)(0x4380C064UL)))
#define bM4_USBFS_HCCHAR8_DAD4 (*((volatile unsigned int *)(0x4380C068UL)))
#define bM4_USBFS_HCCHAR8_DAD5 (*((volatile unsigned int *)(0x4380C06CUL)))
#define bM4_USBFS_HCCHAR8_DAD6 (*((volatile unsigned int *)(0x4380C070UL)))
#define bM4_USBFS_HCCHAR8_ODDFRM (*((volatile unsigned int *)(0x4380C074UL)))
#define bM4_USBFS_HCCHAR8_CHDIS (*((volatile unsigned int *)(0x4380C078UL)))
#define bM4_USBFS_HCCHAR8_CHENA (*((volatile unsigned int *)(0x4380C07CUL)))
#define bM4_USBFS_HCINT8_XFRC (*((volatile unsigned int *)(0x4380C100UL)))
#define bM4_USBFS_HCINT8_CHH (*((volatile unsigned int *)(0x4380C104UL)))
#define bM4_USBFS_HCINT8_STALL (*((volatile unsigned int *)(0x4380C10CUL)))
#define bM4_USBFS_HCINT8_NAK (*((volatile unsigned int *)(0x4380C110UL)))
#define bM4_USBFS_HCINT8_ACK (*((volatile unsigned int *)(0x4380C114UL)))
#define bM4_USBFS_HCINT8_TXERR (*((volatile unsigned int *)(0x4380C11CUL)))
#define bM4_USBFS_HCINT8_BBERR (*((volatile unsigned int *)(0x4380C120UL)))
#define bM4_USBFS_HCINT8_FRMOR (*((volatile unsigned int *)(0x4380C124UL)))
#define bM4_USBFS_HCINT8_DTERR (*((volatile unsigned int *)(0x4380C128UL)))
#define bM4_USBFS_HCINTMSK8_XFRCM (*((volatile unsigned int *)(0x4380C180UL)))
#define bM4_USBFS_HCINTMSK8_CHHM (*((volatile unsigned int *)(0x4380C184UL)))
#define bM4_USBFS_HCINTMSK8_STALLM (*((volatile unsigned int *)(0x4380C18CUL)))
#define bM4_USBFS_HCINTMSK8_NAKM (*((volatile unsigned int *)(0x4380C190UL)))
#define bM4_USBFS_HCINTMSK8_ACKM (*((volatile unsigned int *)(0x4380C194UL)))
#define bM4_USBFS_HCINTMSK8_TXERRM (*((volatile unsigned int *)(0x4380C19CUL)))
#define bM4_USBFS_HCINTMSK8_BBERRM (*((volatile unsigned int *)(0x4380C1A0UL)))
#define bM4_USBFS_HCINTMSK8_FRMORM (*((volatile unsigned int *)(0x4380C1A4UL)))
#define bM4_USBFS_HCINTMSK8_DTERRM (*((volatile unsigned int *)(0x4380C1A8UL)))
#define bM4_USBFS_HCTSIZ8_XFRSIZ0 (*((volatile unsigned int *)(0x4380C200UL)))
#define bM4_USBFS_HCTSIZ8_XFRSIZ1 (*((volatile unsigned int *)(0x4380C204UL)))
#define bM4_USBFS_HCTSIZ8_XFRSIZ2 (*((volatile unsigned int *)(0x4380C208UL)))
#define bM4_USBFS_HCTSIZ8_XFRSIZ3 (*((volatile unsigned int *)(0x4380C20CUL)))
#define bM4_USBFS_HCTSIZ8_XFRSIZ4 (*((volatile unsigned int *)(0x4380C210UL)))
#define bM4_USBFS_HCTSIZ8_XFRSIZ5 (*((volatile unsigned int *)(0x4380C214UL)))
#define bM4_USBFS_HCTSIZ8_XFRSIZ6 (*((volatile unsigned int *)(0x4380C218UL)))
#define bM4_USBFS_HCTSIZ8_XFRSIZ7 (*((volatile unsigned int *)(0x4380C21CUL)))
#define bM4_USBFS_HCTSIZ8_XFRSIZ8 (*((volatile unsigned int *)(0x4380C220UL)))
#define bM4_USBFS_HCTSIZ8_XFRSIZ9 (*((volatile unsigned int *)(0x4380C224UL)))
#define bM4_USBFS_HCTSIZ8_XFRSIZ10 (*((volatile unsigned int *)(0x4380C228UL)))
#define bM4_USBFS_HCTSIZ8_XFRSIZ11 (*((volatile unsigned int *)(0x4380C22CUL)))
#define bM4_USBFS_HCTSIZ8_XFRSIZ12 (*((volatile unsigned int *)(0x4380C230UL)))
#define bM4_USBFS_HCTSIZ8_XFRSIZ13 (*((volatile unsigned int *)(0x4380C234UL)))
#define bM4_USBFS_HCTSIZ8_XFRSIZ14 (*((volatile unsigned int *)(0x4380C238UL)))
#define bM4_USBFS_HCTSIZ8_XFRSIZ15 (*((volatile unsigned int *)(0x4380C23CUL)))
#define bM4_USBFS_HCTSIZ8_XFRSIZ16 (*((volatile unsigned int *)(0x4380C240UL)))
#define bM4_USBFS_HCTSIZ8_XFRSIZ17 (*((volatile unsigned int *)(0x4380C244UL)))
#define bM4_USBFS_HCTSIZ8_XFRSIZ18 (*((volatile unsigned int *)(0x4380C248UL)))
#define bM4_USBFS_HCTSIZ8_PKTCNT0 (*((volatile unsigned int *)(0x4380C24CUL)))
#define bM4_USBFS_HCTSIZ8_PKTCNT1 (*((volatile unsigned int *)(0x4380C250UL)))
#define bM4_USBFS_HCTSIZ8_PKTCNT2 (*((volatile unsigned int *)(0x4380C254UL)))
#define bM4_USBFS_HCTSIZ8_PKTCNT3 (*((volatile unsigned int *)(0x4380C258UL)))
#define bM4_USBFS_HCTSIZ8_PKTCNT4 (*((volatile unsigned int *)(0x4380C25CUL)))
#define bM4_USBFS_HCTSIZ8_PKTCNT5 (*((volatile unsigned int *)(0x4380C260UL)))
#define bM4_USBFS_HCTSIZ8_PKTCNT6 (*((volatile unsigned int *)(0x4380C264UL)))
#define bM4_USBFS_HCTSIZ8_PKTCNT7 (*((volatile unsigned int *)(0x4380C268UL)))
#define bM4_USBFS_HCTSIZ8_PKTCNT8 (*((volatile unsigned int *)(0x4380C26CUL)))
#define bM4_USBFS_HCTSIZ8_PKTCNT9 (*((volatile unsigned int *)(0x4380C270UL)))
#define bM4_USBFS_HCTSIZ8_DPID0 (*((volatile unsigned int *)(0x4380C274UL)))
#define bM4_USBFS_HCTSIZ8_DPID1 (*((volatile unsigned int *)(0x4380C278UL)))
#define bM4_USBFS_HCCHAR9_MPSIZ0 (*((volatile unsigned int *)(0x4380C400UL)))
#define bM4_USBFS_HCCHAR9_MPSIZ1 (*((volatile unsigned int *)(0x4380C404UL)))
#define bM4_USBFS_HCCHAR9_MPSIZ2 (*((volatile unsigned int *)(0x4380C408UL)))
#define bM4_USBFS_HCCHAR9_MPSIZ3 (*((volatile unsigned int *)(0x4380C40CUL)))
#define bM4_USBFS_HCCHAR9_MPSIZ4 (*((volatile unsigned int *)(0x4380C410UL)))
#define bM4_USBFS_HCCHAR9_MPSIZ5 (*((volatile unsigned int *)(0x4380C414UL)))
#define bM4_USBFS_HCCHAR9_MPSIZ6 (*((volatile unsigned int *)(0x4380C418UL)))
#define bM4_USBFS_HCCHAR9_MPSIZ7 (*((volatile unsigned int *)(0x4380C41CUL)))
#define bM4_USBFS_HCCHAR9_MPSIZ8 (*((volatile unsigned int *)(0x4380C420UL)))
#define bM4_USBFS_HCCHAR9_MPSIZ9 (*((volatile unsigned int *)(0x4380C424UL)))
#define bM4_USBFS_HCCHAR9_MPSIZ10 (*((volatile unsigned int *)(0x4380C428UL)))
#define bM4_USBFS_HCCHAR9_EPNUM0 (*((volatile unsigned int *)(0x4380C42CUL)))
#define bM4_USBFS_HCCHAR9_EPNUM1 (*((volatile unsigned int *)(0x4380C430UL)))
#define bM4_USBFS_HCCHAR9_EPNUM2 (*((volatile unsigned int *)(0x4380C434UL)))
#define bM4_USBFS_HCCHAR9_EPNUM3 (*((volatile unsigned int *)(0x4380C438UL)))
#define bM4_USBFS_HCCHAR9_EPDIR (*((volatile unsigned int *)(0x4380C43CUL)))
#define bM4_USBFS_HCCHAR9_LSDEV (*((volatile unsigned int *)(0x4380C444UL)))
#define bM4_USBFS_HCCHAR9_EPTYP0 (*((volatile unsigned int *)(0x4380C448UL)))
#define bM4_USBFS_HCCHAR9_EPTYP1 (*((volatile unsigned int *)(0x4380C44CUL)))
#define bM4_USBFS_HCCHAR9_DAD0 (*((volatile unsigned int *)(0x4380C458UL)))
#define bM4_USBFS_HCCHAR9_DAD1 (*((volatile unsigned int *)(0x4380C45CUL)))
#define bM4_USBFS_HCCHAR9_DAD2 (*((volatile unsigned int *)(0x4380C460UL)))
#define bM4_USBFS_HCCHAR9_DAD3 (*((volatile unsigned int *)(0x4380C464UL)))
#define bM4_USBFS_HCCHAR9_DAD4 (*((volatile unsigned int *)(0x4380C468UL)))
#define bM4_USBFS_HCCHAR9_DAD5 (*((volatile unsigned int *)(0x4380C46CUL)))
#define bM4_USBFS_HCCHAR9_DAD6 (*((volatile unsigned int *)(0x4380C470UL)))
#define bM4_USBFS_HCCHAR9_ODDFRM (*((volatile unsigned int *)(0x4380C474UL)))
#define bM4_USBFS_HCCHAR9_CHDIS (*((volatile unsigned int *)(0x4380C478UL)))
#define bM4_USBFS_HCCHAR9_CHENA (*((volatile unsigned int *)(0x4380C47CUL)))
#define bM4_USBFS_HCINT9_XFRC (*((volatile unsigned int *)(0x4380C500UL)))
#define bM4_USBFS_HCINT9_CHH (*((volatile unsigned int *)(0x4380C504UL)))
#define bM4_USBFS_HCINT9_STALL (*((volatile unsigned int *)(0x4380C50CUL)))
#define bM4_USBFS_HCINT9_NAK (*((volatile unsigned int *)(0x4380C510UL)))
#define bM4_USBFS_HCINT9_ACK (*((volatile unsigned int *)(0x4380C514UL)))
#define bM4_USBFS_HCINT9_TXERR (*((volatile unsigned int *)(0x4380C51CUL)))
#define bM4_USBFS_HCINT9_BBERR (*((volatile unsigned int *)(0x4380C520UL)))
#define bM4_USBFS_HCINT9_FRMOR (*((volatile unsigned int *)(0x4380C524UL)))
#define bM4_USBFS_HCINT9_DTERR (*((volatile unsigned int *)(0x4380C528UL)))
#define bM4_USBFS_HCINTMSK9_XFRCM (*((volatile unsigned int *)(0x4380C580UL)))
#define bM4_USBFS_HCINTMSK9_CHHM (*((volatile unsigned int *)(0x4380C584UL)))
#define bM4_USBFS_HCINTMSK9_STALLM (*((volatile unsigned int *)(0x4380C58CUL)))
#define bM4_USBFS_HCINTMSK9_NAKM (*((volatile unsigned int *)(0x4380C590UL)))
#define bM4_USBFS_HCINTMSK9_ACKM (*((volatile unsigned int *)(0x4380C594UL)))
#define bM4_USBFS_HCINTMSK9_TXERRM (*((volatile unsigned int *)(0x4380C59CUL)))
#define bM4_USBFS_HCINTMSK9_BBERRM (*((volatile unsigned int *)(0x4380C5A0UL)))
#define bM4_USBFS_HCINTMSK9_FRMORM (*((volatile unsigned int *)(0x4380C5A4UL)))
#define bM4_USBFS_HCINTMSK9_DTERRM (*((volatile unsigned int *)(0x4380C5A8UL)))
#define bM4_USBFS_HCTSIZ9_XFRSIZ0 (*((volatile unsigned int *)(0x4380C600UL)))
#define bM4_USBFS_HCTSIZ9_XFRSIZ1 (*((volatile unsigned int *)(0x4380C604UL)))
#define bM4_USBFS_HCTSIZ9_XFRSIZ2 (*((volatile unsigned int *)(0x4380C608UL)))
#define bM4_USBFS_HCTSIZ9_XFRSIZ3 (*((volatile unsigned int *)(0x4380C60CUL)))
#define bM4_USBFS_HCTSIZ9_XFRSIZ4 (*((volatile unsigned int *)(0x4380C610UL)))
#define bM4_USBFS_HCTSIZ9_XFRSIZ5 (*((volatile unsigned int *)(0x4380C614UL)))
#define bM4_USBFS_HCTSIZ9_XFRSIZ6 (*((volatile unsigned int *)(0x4380C618UL)))
#define bM4_USBFS_HCTSIZ9_XFRSIZ7 (*((volatile unsigned int *)(0x4380C61CUL)))
#define bM4_USBFS_HCTSIZ9_XFRSIZ8 (*((volatile unsigned int *)(0x4380C620UL)))
#define bM4_USBFS_HCTSIZ9_XFRSIZ9 (*((volatile unsigned int *)(0x4380C624UL)))
#define bM4_USBFS_HCTSIZ9_XFRSIZ10 (*((volatile unsigned int *)(0x4380C628UL)))
#define bM4_USBFS_HCTSIZ9_XFRSIZ11 (*((volatile unsigned int *)(0x4380C62CUL)))
#define bM4_USBFS_HCTSIZ9_XFRSIZ12 (*((volatile unsigned int *)(0x4380C630UL)))
#define bM4_USBFS_HCTSIZ9_XFRSIZ13 (*((volatile unsigned int *)(0x4380C634UL)))
#define bM4_USBFS_HCTSIZ9_XFRSIZ14 (*((volatile unsigned int *)(0x4380C638UL)))
#define bM4_USBFS_HCTSIZ9_XFRSIZ15 (*((volatile unsigned int *)(0x4380C63CUL)))
#define bM4_USBFS_HCTSIZ9_XFRSIZ16 (*((volatile unsigned int *)(0x4380C640UL)))
#define bM4_USBFS_HCTSIZ9_XFRSIZ17 (*((volatile unsigned int *)(0x4380C644UL)))
#define bM4_USBFS_HCTSIZ9_XFRSIZ18 (*((volatile unsigned int *)(0x4380C648UL)))
#define bM4_USBFS_HCTSIZ9_PKTCNT0 (*((volatile unsigned int *)(0x4380C64CUL)))
#define bM4_USBFS_HCTSIZ9_PKTCNT1 (*((volatile unsigned int *)(0x4380C650UL)))
#define bM4_USBFS_HCTSIZ9_PKTCNT2 (*((volatile unsigned int *)(0x4380C654UL)))
#define bM4_USBFS_HCTSIZ9_PKTCNT3 (*((volatile unsigned int *)(0x4380C658UL)))
#define bM4_USBFS_HCTSIZ9_PKTCNT4 (*((volatile unsigned int *)(0x4380C65CUL)))
#define bM4_USBFS_HCTSIZ9_PKTCNT5 (*((volatile unsigned int *)(0x4380C660UL)))
#define bM4_USBFS_HCTSIZ9_PKTCNT6 (*((volatile unsigned int *)(0x4380C664UL)))
#define bM4_USBFS_HCTSIZ9_PKTCNT7 (*((volatile unsigned int *)(0x4380C668UL)))
#define bM4_USBFS_HCTSIZ9_PKTCNT8 (*((volatile unsigned int *)(0x4380C66CUL)))
#define bM4_USBFS_HCTSIZ9_PKTCNT9 (*((volatile unsigned int *)(0x4380C670UL)))
#define bM4_USBFS_HCTSIZ9_DPID0 (*((volatile unsigned int *)(0x4380C674UL)))
#define bM4_USBFS_HCTSIZ9_DPID1 (*((volatile unsigned int *)(0x4380C678UL)))
#define bM4_USBFS_HCCHAR10_MPSIZ0 (*((volatile unsigned int *)(0x4380C800UL)))
#define bM4_USBFS_HCCHAR10_MPSIZ1 (*((volatile unsigned int *)(0x4380C804UL)))
#define bM4_USBFS_HCCHAR10_MPSIZ2 (*((volatile unsigned int *)(0x4380C808UL)))
#define bM4_USBFS_HCCHAR10_MPSIZ3 (*((volatile unsigned int *)(0x4380C80CUL)))
#define bM4_USBFS_HCCHAR10_MPSIZ4 (*((volatile unsigned int *)(0x4380C810UL)))
#define bM4_USBFS_HCCHAR10_MPSIZ5 (*((volatile unsigned int *)(0x4380C814UL)))
#define bM4_USBFS_HCCHAR10_MPSIZ6 (*((volatile unsigned int *)(0x4380C818UL)))
#define bM4_USBFS_HCCHAR10_MPSIZ7 (*((volatile unsigned int *)(0x4380C81CUL)))
#define bM4_USBFS_HCCHAR10_MPSIZ8 (*((volatile unsigned int *)(0x4380C820UL)))
#define bM4_USBFS_HCCHAR10_MPSIZ9 (*((volatile unsigned int *)(0x4380C824UL)))
#define bM4_USBFS_HCCHAR10_MPSIZ10 (*((volatile unsigned int *)(0x4380C828UL)))
#define bM4_USBFS_HCCHAR10_EPNUM0 (*((volatile unsigned int *)(0x4380C82CUL)))
#define bM4_USBFS_HCCHAR10_EPNUM1 (*((volatile unsigned int *)(0x4380C830UL)))
#define bM4_USBFS_HCCHAR10_EPNUM2 (*((volatile unsigned int *)(0x4380C834UL)))
#define bM4_USBFS_HCCHAR10_EPNUM3 (*((volatile unsigned int *)(0x4380C838UL)))
#define bM4_USBFS_HCCHAR10_EPDIR (*((volatile unsigned int *)(0x4380C83CUL)))
#define bM4_USBFS_HCCHAR10_LSDEV (*((volatile unsigned int *)(0x4380C844UL)))
#define bM4_USBFS_HCCHAR10_EPTYP0 (*((volatile unsigned int *)(0x4380C848UL)))
#define bM4_USBFS_HCCHAR10_EPTYP1 (*((volatile unsigned int *)(0x4380C84CUL)))
#define bM4_USBFS_HCCHAR10_DAD0 (*((volatile unsigned int *)(0x4380C858UL)))
#define bM4_USBFS_HCCHAR10_DAD1 (*((volatile unsigned int *)(0x4380C85CUL)))
#define bM4_USBFS_HCCHAR10_DAD2 (*((volatile unsigned int *)(0x4380C860UL)))
#define bM4_USBFS_HCCHAR10_DAD3 (*((volatile unsigned int *)(0x4380C864UL)))
#define bM4_USBFS_HCCHAR10_DAD4 (*((volatile unsigned int *)(0x4380C868UL)))
#define bM4_USBFS_HCCHAR10_DAD5 (*((volatile unsigned int *)(0x4380C86CUL)))
#define bM4_USBFS_HCCHAR10_DAD6 (*((volatile unsigned int *)(0x4380C870UL)))
#define bM4_USBFS_HCCHAR10_ODDFRM (*((volatile unsigned int *)(0x4380C874UL)))
#define bM4_USBFS_HCCHAR10_CHDIS (*((volatile unsigned int *)(0x4380C878UL)))
#define bM4_USBFS_HCCHAR10_CHENA (*((volatile unsigned int *)(0x4380C87CUL)))
#define bM4_USBFS_HCINT10_XFRC (*((volatile unsigned int *)(0x4380C900UL)))
#define bM4_USBFS_HCINT10_CHH (*((volatile unsigned int *)(0x4380C904UL)))
#define bM4_USBFS_HCINT10_STALL (*((volatile unsigned int *)(0x4380C90CUL)))
#define bM4_USBFS_HCINT10_NAK (*((volatile unsigned int *)(0x4380C910UL)))
#define bM4_USBFS_HCINT10_ACK (*((volatile unsigned int *)(0x4380C914UL)))
#define bM4_USBFS_HCINT10_TXERR (*((volatile unsigned int *)(0x4380C91CUL)))
#define bM4_USBFS_HCINT10_BBERR (*((volatile unsigned int *)(0x4380C920UL)))
#define bM4_USBFS_HCINT10_FRMOR (*((volatile unsigned int *)(0x4380C924UL)))
#define bM4_USBFS_HCINT10_DTERR (*((volatile unsigned int *)(0x4380C928UL)))
#define bM4_USBFS_HCINTMSK10_XFRCM (*((volatile unsigned int *)(0x4380C980UL)))
#define bM4_USBFS_HCINTMSK10_CHHM (*((volatile unsigned int *)(0x4380C984UL)))
#define bM4_USBFS_HCINTMSK10_STALLM (*((volatile unsigned int *)(0x4380C98CUL)))
#define bM4_USBFS_HCINTMSK10_NAKM (*((volatile unsigned int *)(0x4380C990UL)))
#define bM4_USBFS_HCINTMSK10_ACKM (*((volatile unsigned int *)(0x4380C994UL)))
#define bM4_USBFS_HCINTMSK10_TXERRM (*((volatile unsigned int *)(0x4380C99CUL)))
#define bM4_USBFS_HCINTMSK10_BBERRM (*((volatile unsigned int *)(0x4380C9A0UL)))
#define bM4_USBFS_HCINTMSK10_FRMORM (*((volatile unsigned int *)(0x4380C9A4UL)))
#define bM4_USBFS_HCINTMSK10_DTERRM (*((volatile unsigned int *)(0x4380C9A8UL)))
#define bM4_USBFS_HCTSIZ10_XFRSIZ0 (*((volatile unsigned int *)(0x4380CA00UL)))
#define bM4_USBFS_HCTSIZ10_XFRSIZ1 (*((volatile unsigned int *)(0x4380CA04UL)))
#define bM4_USBFS_HCTSIZ10_XFRSIZ2 (*((volatile unsigned int *)(0x4380CA08UL)))
#define bM4_USBFS_HCTSIZ10_XFRSIZ3 (*((volatile unsigned int *)(0x4380CA0CUL)))
#define bM4_USBFS_HCTSIZ10_XFRSIZ4 (*((volatile unsigned int *)(0x4380CA10UL)))
