MarlinFirmware/Marlin/Marlin/lib/h32_core/main/hdsc32core/common/hc32f46x.h
#define bM4_USBFS_DTXFSTS1_INEPTFSAV7 (*((volatile unsigned int *)(0x4381271CUL)))
#define bM4_USBFS_DTXFSTS1_INEPTFSAV8 (*((volatile unsigned int *)(0x43812720UL)))
#define bM4_USBFS_DTXFSTS1_INEPTFSAV9 (*((volatile unsigned int *)(0x43812724UL)))
#define bM4_USBFS_DTXFSTS1_INEPTFSAV10 (*((volatile unsigned int *)(0x43812728UL)))
#define bM4_USBFS_DTXFSTS1_INEPTFSAV11 (*((volatile unsigned int *)(0x4381272CUL)))
#define bM4_USBFS_DTXFSTS1_INEPTFSAV12 (*((volatile unsigned int *)(0x43812730UL)))
#define bM4_USBFS_DTXFSTS1_INEPTFSAV13 (*((volatile unsigned int *)(0x43812734UL)))
#define bM4_USBFS_DTXFSTS1_INEPTFSAV14 (*((volatile unsigned int *)(0x43812738UL)))
#define bM4_USBFS_DTXFSTS1_INEPTFSAV15 (*((volatile unsigned int *)(0x4381273CUL)))
#define bM4_USBFS_DIEPCTL2_MPSIZ0 (*((volatile unsigned int *)(0x43812800UL)))
#define bM4_USBFS_DIEPCTL2_MPSIZ1 (*((volatile unsigned int *)(0x43812804UL)))
#define bM4_USBFS_DIEPCTL2_MPSIZ2 (*((volatile unsigned int *)(0x43812808UL)))
#define bM4_USBFS_DIEPCTL2_MPSIZ3 (*((volatile unsigned int *)(0x4381280CUL)))
#define bM4_USBFS_DIEPCTL2_MPSIZ4 (*((volatile unsigned int *)(0x43812810UL)))
#define bM4_USBFS_DIEPCTL2_MPSIZ5 (*((volatile unsigned int *)(0x43812814UL)))
#define bM4_USBFS_DIEPCTL2_MPSIZ6 (*((volatile unsigned int *)(0x43812818UL)))
#define bM4_USBFS_DIEPCTL2_MPSIZ7 (*((volatile unsigned int *)(0x4381281CUL)))
#define bM4_USBFS_DIEPCTL2_MPSIZ8 (*((volatile unsigned int *)(0x43812820UL)))
#define bM4_USBFS_DIEPCTL2_MPSIZ9 (*((volatile unsigned int *)(0x43812824UL)))
#define bM4_USBFS_DIEPCTL2_MPSIZ10 (*((volatile unsigned int *)(0x43812828UL)))
#define bM4_USBFS_DIEPCTL2_USBAEP (*((volatile unsigned int *)(0x4381283CUL)))
#define bM4_USBFS_DIEPCTL2_EONUM_DPID (*((volatile unsigned int *)(0x43812840UL)))
#define bM4_USBFS_DIEPCTL2_NAKSTS (*((volatile unsigned int *)(0x43812844UL)))
#define bM4_USBFS_DIEPCTL2_EPTYP0 (*((volatile unsigned int *)(0x43812848UL)))
#define bM4_USBFS_DIEPCTL2_EPTYP1 (*((volatile unsigned int *)(0x4381284CUL)))
#define bM4_USBFS_DIEPCTL2_STALL (*((volatile unsigned int *)(0x43812854UL)))
#define bM4_USBFS_DIEPCTL2_TXFNUM0 (*((volatile unsigned int *)(0x43812858UL)))
#define bM4_USBFS_DIEPCTL2_TXFNUM1 (*((volatile unsigned int *)(0x4381285CUL)))
#define bM4_USBFS_DIEPCTL2_TXFNUM2 (*((volatile unsigned int *)(0x43812860UL)))
#define bM4_USBFS_DIEPCTL2_TXFNUM3 (*((volatile unsigned int *)(0x43812864UL)))
#define bM4_USBFS_DIEPCTL2_CNAK (*((volatile unsigned int *)(0x43812868UL)))
#define bM4_USBFS_DIEPCTL2_SNAK (*((volatile unsigned int *)(0x4381286CUL)))
#define bM4_USBFS_DIEPCTL2_SD0PID_SEVNFRM (*((volatile unsigned int *)(0x43812870UL)))
#define bM4_USBFS_DIEPCTL2_SODDFRM (*((volatile unsigned int *)(0x43812874UL)))
#define bM4_USBFS_DIEPCTL2_EPDIS (*((volatile unsigned int *)(0x43812878UL)))
#define bM4_USBFS_DIEPCTL2_EPENA (*((volatile unsigned int *)(0x4381287CUL)))
#define bM4_USBFS_DIEPINT2_XFRC (*((volatile unsigned int *)(0x43812900UL)))
#define bM4_USBFS_DIEPINT2_EPDISD (*((volatile unsigned int *)(0x43812904UL)))
#define bM4_USBFS_DIEPINT2_TOC (*((volatile unsigned int *)(0x4381290CUL)))
#define bM4_USBFS_DIEPINT2_TTXFE (*((volatile unsigned int *)(0x43812910UL)))
#define bM4_USBFS_DIEPINT2_NEPNE (*((volatile unsigned int *)(0x43812918UL)))
#define bM4_USBFS_DIEPINT2_TXFE (*((volatile unsigned int *)(0x4381291CUL)))
#define bM4_USBFS_DIEPTSIZ2_XFRSIZ0 (*((volatile unsigned int *)(0x43812A00UL)))
#define bM4_USBFS_DIEPTSIZ2_XFRSIZ1 (*((volatile unsigned int *)(0x43812A04UL)))
#define bM4_USBFS_DIEPTSIZ2_XFRSIZ2 (*((volatile unsigned int *)(0x43812A08UL)))
#define bM4_USBFS_DIEPTSIZ2_XFRSIZ3 (*((volatile unsigned int *)(0x43812A0CUL)))
#define bM4_USBFS_DIEPTSIZ2_XFRSIZ4 (*((volatile unsigned int *)(0x43812A10UL)))
#define bM4_USBFS_DIEPTSIZ2_XFRSIZ5 (*((volatile unsigned int *)(0x43812A14UL)))
#define bM4_USBFS_DIEPTSIZ2_XFRSIZ6 (*((volatile unsigned int *)(0x43812A18UL)))
#define bM4_USBFS_DIEPTSIZ2_XFRSIZ7 (*((volatile unsigned int *)(0x43812A1CUL)))
#define bM4_USBFS_DIEPTSIZ2_XFRSIZ8 (*((volatile unsigned int *)(0x43812A20UL)))
#define bM4_USBFS_DIEPTSIZ2_XFRSIZ9 (*((volatile unsigned int *)(0x43812A24UL)))
#define bM4_USBFS_DIEPTSIZ2_XFRSIZ10 (*((volatile unsigned int *)(0x43812A28UL)))
#define bM4_USBFS_DIEPTSIZ2_XFRSIZ11 (*((volatile unsigned int *)(0x43812A2CUL)))
#define bM4_USBFS_DIEPTSIZ2_XFRSIZ12 (*((volatile unsigned int *)(0x43812A30UL)))
#define bM4_USBFS_DIEPTSIZ2_XFRSIZ13 (*((volatile unsigned int *)(0x43812A34UL)))
#define bM4_USBFS_DIEPTSIZ2_XFRSIZ14 (*((volatile unsigned int *)(0x43812A38UL)))
#define bM4_USBFS_DIEPTSIZ2_XFRSIZ15 (*((volatile unsigned int *)(0x43812A3CUL)))
#define bM4_USBFS_DIEPTSIZ2_XFRSIZ16 (*((volatile unsigned int *)(0x43812A40UL)))
#define bM4_USBFS_DIEPTSIZ2_XFRSIZ17 (*((volatile unsigned int *)(0x43812A44UL)))
#define bM4_USBFS_DIEPTSIZ2_XFRSIZ18 (*((volatile unsigned int *)(0x43812A48UL)))
#define bM4_USBFS_DIEPTSIZ2_PKTCNT0 (*((volatile unsigned int *)(0x43812A4CUL)))
#define bM4_USBFS_DIEPTSIZ2_PKTCNT1 (*((volatile unsigned int *)(0x43812A50UL)))
#define bM4_USBFS_DIEPTSIZ2_PKTCNT2 (*((volatile unsigned int *)(0x43812A54UL)))
#define bM4_USBFS_DIEPTSIZ2_PKTCNT3 (*((volatile unsigned int *)(0x43812A58UL)))
#define bM4_USBFS_DIEPTSIZ2_PKTCNT4 (*((volatile unsigned int *)(0x43812A5CUL)))
#define bM4_USBFS_DIEPTSIZ2_PKTCNT5 (*((volatile unsigned int *)(0x43812A60UL)))
#define bM4_USBFS_DIEPTSIZ2_PKTCNT6 (*((volatile unsigned int *)(0x43812A64UL)))
#define bM4_USBFS_DIEPTSIZ2_PKTCNT7 (*((volatile unsigned int *)(0x43812A68UL)))
#define bM4_USBFS_DIEPTSIZ2_PKTCNT8 (*((volatile unsigned int *)(0x43812A6CUL)))
#define bM4_USBFS_DIEPTSIZ2_PKTCNT9 (*((volatile unsigned int *)(0x43812A70UL)))
#define bM4_USBFS_DIEPTSIZ2_MC0 (*((volatile unsigned int *)(0x43812A74UL)))
#define bM4_USBFS_DIEPTSIZ2_MC1 (*((volatile unsigned int *)(0x43812A78UL)))
#define bM4_USBFS_DTXFSTS2_INEPTFSAV0 (*((volatile unsigned int *)(0x43812B00UL)))
#define bM4_USBFS_DTXFSTS2_INEPTFSAV1 (*((volatile unsigned int *)(0x43812B04UL)))
#define bM4_USBFS_DTXFSTS2_INEPTFSAV2 (*((volatile unsigned int *)(0x43812B08UL)))
#define bM4_USBFS_DTXFSTS2_INEPTFSAV3 (*((volatile unsigned int *)(0x43812B0CUL)))
#define bM4_USBFS_DTXFSTS2_INEPTFSAV4 (*((volatile unsigned int *)(0x43812B10UL)))
#define bM4_USBFS_DTXFSTS2_INEPTFSAV5 (*((volatile unsigned int *)(0x43812B14UL)))
#define bM4_USBFS_DTXFSTS2_INEPTFSAV6 (*((volatile unsigned int *)(0x43812B18UL)))
#define bM4_USBFS_DTXFSTS2_INEPTFSAV7 (*((volatile unsigned int *)(0x43812B1CUL)))
#define bM4_USBFS_DTXFSTS2_INEPTFSAV8 (*((volatile unsigned int *)(0x43812B20UL)))
#define bM4_USBFS_DTXFSTS2_INEPTFSAV9 (*((volatile unsigned int *)(0x43812B24UL)))
#define bM4_USBFS_DTXFSTS2_INEPTFSAV10 (*((volatile unsigned int *)(0x43812B28UL)))
#define bM4_USBFS_DTXFSTS2_INEPTFSAV11 (*((volatile unsigned int *)(0x43812B2CUL)))
#define bM4_USBFS_DTXFSTS2_INEPTFSAV12 (*((volatile unsigned int *)(0x43812B30UL)))
#define bM4_USBFS_DTXFSTS2_INEPTFSAV13 (*((volatile unsigned int *)(0x43812B34UL)))
#define bM4_USBFS_DTXFSTS2_INEPTFSAV14 (*((volatile unsigned int *)(0x43812B38UL)))
#define bM4_USBFS_DTXFSTS2_INEPTFSAV15 (*((volatile unsigned int *)(0x43812B3CUL)))
#define bM4_USBFS_DIEPCTL3_MPSIZ0 (*((volatile unsigned int *)(0x43812C00UL)))
#define bM4_USBFS_DIEPCTL3_MPSIZ1 (*((volatile unsigned int *)(0x43812C04UL)))
#define bM4_USBFS_DIEPCTL3_MPSIZ2 (*((volatile unsigned int *)(0x43812C08UL)))
#define bM4_USBFS_DIEPCTL3_MPSIZ3 (*((volatile unsigned int *)(0x43812C0CUL)))
#define bM4_USBFS_DIEPCTL3_MPSIZ4 (*((volatile unsigned int *)(0x43812C10UL)))
#define bM4_USBFS_DIEPCTL3_MPSIZ5 (*((volatile unsigned int *)(0x43812C14UL)))
#define bM4_USBFS_DIEPCTL3_MPSIZ6 (*((volatile unsigned int *)(0x43812C18UL)))
#define bM4_USBFS_DIEPCTL3_MPSIZ7 (*((volatile unsigned int *)(0x43812C1CUL)))
#define bM4_USBFS_DIEPCTL3_MPSIZ8 (*((volatile unsigned int *)(0x43812C20UL)))
#define bM4_USBFS_DIEPCTL3_MPSIZ9 (*((volatile unsigned int *)(0x43812C24UL)))
#define bM4_USBFS_DIEPCTL3_MPSIZ10 (*((volatile unsigned int *)(0x43812C28UL)))
#define bM4_USBFS_DIEPCTL3_USBAEP (*((volatile unsigned int *)(0x43812C3CUL)))
#define bM4_USBFS_DIEPCTL3_EONUM_DPID (*((volatile unsigned int *)(0x43812C40UL)))
#define bM4_USBFS_DIEPCTL3_NAKSTS (*((volatile unsigned int *)(0x43812C44UL)))
#define bM4_USBFS_DIEPCTL3_EPTYP0 (*((volatile unsigned int *)(0x43812C48UL)))
#define bM4_USBFS_DIEPCTL3_EPTYP1 (*((volatile unsigned int *)(0x43812C4CUL)))
#define bM4_USBFS_DIEPCTL3_STALL (*((volatile unsigned int *)(0x43812C54UL)))
#define bM4_USBFS_DIEPCTL3_TXFNUM0 (*((volatile unsigned int *)(0x43812C58UL)))
#define bM4_USBFS_DIEPCTL3_TXFNUM1 (*((volatile unsigned int *)(0x43812C5CUL)))
#define bM4_USBFS_DIEPCTL3_TXFNUM2 (*((volatile unsigned int *)(0x43812C60UL)))
#define bM4_USBFS_DIEPCTL3_TXFNUM3 (*((volatile unsigned int *)(0x43812C64UL)))
#define bM4_USBFS_DIEPCTL3_CNAK (*((volatile unsigned int *)(0x43812C68UL)))
#define bM4_USBFS_DIEPCTL3_SNAK (*((volatile unsigned int *)(0x43812C6CUL)))
#define bM4_USBFS_DIEPCTL3_SD0PID_SEVNFRM (*((volatile unsigned int *)(0x43812C70UL)))
#define bM4_USBFS_DIEPCTL3_SODDFRM (*((volatile unsigned int *)(0x43812C74UL)))
#define bM4_USBFS_DIEPCTL3_EPDIS (*((volatile unsigned int *)(0x43812C78UL)))
#define bM4_USBFS_DIEPCTL3_EPENA (*((volatile unsigned int *)(0x43812C7CUL)))
#define bM4_USBFS_DIEPINT3_XFRC (*((volatile unsigned int *)(0x43812D00UL)))
#define bM4_USBFS_DIEPINT3_EPDISD (*((volatile unsigned int *)(0x43812D04UL)))
#define bM4_USBFS_DIEPINT3_TOC (*((volatile unsigned int *)(0x43812D0CUL)))
#define bM4_USBFS_DIEPINT3_TTXFE (*((volatile unsigned int *)(0x43812D10UL)))
#define bM4_USBFS_DIEPINT3_NEPNE (*((volatile unsigned int *)(0x43812D18UL)))
#define bM4_USBFS_DIEPINT3_TXFE (*((volatile unsigned int *)(0x43812D1CUL)))
#define bM4_USBFS_DIEPTSIZ3_XFRSIZ0 (*((volatile unsigned int *)(0x43812E00UL)))
#define bM4_USBFS_DIEPTSIZ3_XFRSIZ1 (*((volatile unsigned int *)(0x43812E04UL)))
#define bM4_USBFS_DIEPTSIZ3_XFRSIZ2 (*((volatile unsigned int *)(0x43812E08UL)))
#define bM4_USBFS_DIEPTSIZ3_XFRSIZ3 (*((volatile unsigned int *)(0x43812E0CUL)))
#define bM4_USBFS_DIEPTSIZ3_XFRSIZ4 (*((volatile unsigned int *)(0x43812E10UL)))
#define bM4_USBFS_DIEPTSIZ3_XFRSIZ5 (*((volatile unsigned int *)(0x43812E14UL)))
#define bM4_USBFS_DIEPTSIZ3_XFRSIZ6 (*((volatile unsigned int *)(0x43812E18UL)))
#define bM4_USBFS_DIEPTSIZ3_XFRSIZ7 (*((volatile unsigned int *)(0x43812E1CUL)))
#define bM4_USBFS_DIEPTSIZ3_XFRSIZ8 (*((volatile unsigned int *)(0x43812E20UL)))
#define bM4_USBFS_DIEPTSIZ3_XFRSIZ9 (*((volatile unsigned int *)(0x43812E24UL)))
#define bM4_USBFS_DIEPTSIZ3_XFRSIZ10 (*((volatile unsigned int *)(0x43812E28UL)))
#define bM4_USBFS_DIEPTSIZ3_XFRSIZ11 (*((volatile unsigned int *)(0x43812E2CUL)))
#define bM4_USBFS_DIEPTSIZ3_XFRSIZ12 (*((volatile unsigned int *)(0x43812E30UL)))
#define bM4_USBFS_DIEPTSIZ3_XFRSIZ13 (*((volatile unsigned int *)(0x43812E34UL)))
#define bM4_USBFS_DIEPTSIZ3_XFRSIZ14 (*((volatile unsigned int *)(0x43812E38UL)))
#define bM4_USBFS_DIEPTSIZ3_XFRSIZ15 (*((volatile unsigned int *)(0x43812E3CUL)))
#define bM4_USBFS_DIEPTSIZ3_XFRSIZ16 (*((volatile unsigned int *)(0x43812E40UL)))
#define bM4_USBFS_DIEPTSIZ3_XFRSIZ17 (*((volatile unsigned int *)(0x43812E44UL)))
#define bM4_USBFS_DIEPTSIZ3_XFRSIZ18 (*((volatile unsigned int *)(0x43812E48UL)))
#define bM4_USBFS_DIEPTSIZ3_PKTCNT0 (*((volatile unsigned int *)(0x43812E4CUL)))
#define bM4_USBFS_DIEPTSIZ3_PKTCNT1 (*((volatile unsigned int *)(0x43812E50UL)))
#define bM4_USBFS_DIEPTSIZ3_PKTCNT2 (*((volatile unsigned int *)(0x43812E54UL)))
#define bM4_USBFS_DIEPTSIZ3_PKTCNT3 (*((volatile unsigned int *)(0x43812E58UL)))
#define bM4_USBFS_DIEPTSIZ3_PKTCNT4 (*((volatile unsigned int *)(0x43812E5CUL)))
#define bM4_USBFS_DIEPTSIZ3_PKTCNT5 (*((volatile unsigned int *)(0x43812E60UL)))
#define bM4_USBFS_DIEPTSIZ3_PKTCNT6 (*((volatile unsigned int *)(0x43812E64UL)))
#define bM4_USBFS_DIEPTSIZ3_PKTCNT7 (*((volatile unsigned int *)(0x43812E68UL)))
#define bM4_USBFS_DIEPTSIZ3_PKTCNT8 (*((volatile unsigned int *)(0x43812E6CUL)))
#define bM4_USBFS_DIEPTSIZ3_PKTCNT9 (*((volatile unsigned int *)(0x43812E70UL)))
#define bM4_USBFS_DIEPTSIZ3_MC0 (*((volatile unsigned int *)(0x43812E74UL)))
#define bM4_USBFS_DIEPTSIZ3_MC1 (*((volatile unsigned int *)(0x43812E78UL)))
#define bM4_USBFS_DTXFSTS3_INEPTFSAV0 (*((volatile unsigned int *)(0x43812F00UL)))
#define bM4_USBFS_DTXFSTS3_INEPTFSAV1 (*((volatile unsigned int *)(0x43812F04UL)))
#define bM4_USBFS_DTXFSTS3_INEPTFSAV2 (*((volatile unsigned int *)(0x43812F08UL)))
#define bM4_USBFS_DTXFSTS3_INEPTFSAV3 (*((volatile unsigned int *)(0x43812F0CUL)))
#define bM4_USBFS_DTXFSTS3_INEPTFSAV4 (*((volatile unsigned int *)(0x43812F10UL)))
#define bM4_USBFS_DTXFSTS3_INEPTFSAV5 (*((volatile unsigned int *)(0x43812F14UL)))
#define bM4_USBFS_DTXFSTS3_INEPTFSAV6 (*((volatile unsigned int *)(0x43812F18UL)))
#define bM4_USBFS_DTXFSTS3_INEPTFSAV7 (*((volatile unsigned int *)(0x43812F1CUL)))
#define bM4_USBFS_DTXFSTS3_INEPTFSAV8 (*((volatile unsigned int *)(0x43812F20UL)))
#define bM4_USBFS_DTXFSTS3_INEPTFSAV9 (*((volatile unsigned int *)(0x43812F24UL)))
#define bM4_USBFS_DTXFSTS3_INEPTFSAV10 (*((volatile unsigned int *)(0x43812F28UL)))
#define bM4_USBFS_DTXFSTS3_INEPTFSAV11 (*((volatile unsigned int *)(0x43812F2CUL)))
#define bM4_USBFS_DTXFSTS3_INEPTFSAV12 (*((volatile unsigned int *)(0x43812F30UL)))
#define bM4_USBFS_DTXFSTS3_INEPTFSAV13 (*((volatile unsigned int *)(0x43812F34UL)))
#define bM4_USBFS_DTXFSTS3_INEPTFSAV14 (*((volatile unsigned int *)(0x43812F38UL)))
#define bM4_USBFS_DTXFSTS3_INEPTFSAV15 (*((volatile unsigned int *)(0x43812F3CUL)))
#define bM4_USBFS_DIEPCTL4_MPSIZ0 (*((volatile unsigned int *)(0x43813000UL)))
#define bM4_USBFS_DIEPCTL4_MPSIZ1 (*((volatile unsigned int *)(0x43813004UL)))
#define bM4_USBFS_DIEPCTL4_MPSIZ2 (*((volatile unsigned int *)(0x43813008UL)))
#define bM4_USBFS_DIEPCTL4_MPSIZ3 (*((volatile unsigned int *)(0x4381300CUL)))
#define bM4_USBFS_DIEPCTL4_MPSIZ4 (*((volatile unsigned int *)(0x43813010UL)))
#define bM4_USBFS_DIEPCTL4_MPSIZ5 (*((volatile unsigned int *)(0x43813014UL)))
#define bM4_USBFS_DIEPCTL4_MPSIZ6 (*((volatile unsigned int *)(0x43813018UL)))
#define bM4_USBFS_DIEPCTL4_MPSIZ7 (*((volatile unsigned int *)(0x4381301CUL)))
#define bM4_USBFS_DIEPCTL4_MPSIZ8 (*((volatile unsigned int *)(0x43813020UL)))
#define bM4_USBFS_DIEPCTL4_MPSIZ9 (*((volatile unsigned int *)(0x43813024UL)))
#define bM4_USBFS_DIEPCTL4_MPSIZ10 (*((volatile unsigned int *)(0x43813028UL)))
#define bM4_USBFS_DIEPCTL4_USBAEP (*((volatile unsigned int *)(0x4381303CUL)))
#define bM4_USBFS_DIEPCTL4_EONUM_DPID (*((volatile unsigned int *)(0x43813040UL)))
#define bM4_USBFS_DIEPCTL4_NAKSTS (*((volatile unsigned int *)(0x43813044UL)))
#define bM4_USBFS_DIEPCTL4_EPTYP0 (*((volatile unsigned int *)(0x43813048UL)))
#define bM4_USBFS_DIEPCTL4_EPTYP1 (*((volatile unsigned int *)(0x4381304CUL)))
#define bM4_USBFS_DIEPCTL4_STALL (*((volatile unsigned int *)(0x43813054UL)))
#define bM4_USBFS_DIEPCTL4_TXFNUM0 (*((volatile unsigned int *)(0x43813058UL)))
#define bM4_USBFS_DIEPCTL4_TXFNUM1 (*((volatile unsigned int *)(0x4381305CUL)))
#define bM4_USBFS_DIEPCTL4_TXFNUM2 (*((volatile unsigned int *)(0x43813060UL)))
#define bM4_USBFS_DIEPCTL4_TXFNUM3 (*((volatile unsigned int *)(0x43813064UL)))
#define bM4_USBFS_DIEPCTL4_CNAK (*((volatile unsigned int *)(0x43813068UL)))
#define bM4_USBFS_DIEPCTL4_SNAK (*((volatile unsigned int *)(0x4381306CUL)))
#define bM4_USBFS_DIEPCTL4_SD0PID_SEVNFRM (*((volatile unsigned int *)(0x43813070UL)))
#define bM4_USBFS_DIEPCTL4_SODDFRM (*((volatile unsigned int *)(0x43813074UL)))
#define bM4_USBFS_DIEPCTL4_EPDIS (*((volatile unsigned int *)(0x43813078UL)))
#define bM4_USBFS_DIEPCTL4_EPENA (*((volatile unsigned int *)(0x4381307CUL)))
#define bM4_USBFS_DIEPINT4_XFRC (*((volatile unsigned int *)(0x43813100UL)))
#define bM4_USBFS_DIEPINT4_EPDISD (*((volatile unsigned int *)(0x43813104UL)))
#define bM4_USBFS_DIEPINT4_TOC (*((volatile unsigned int *)(0x4381310CUL)))
#define bM4_USBFS_DIEPINT4_TTXFE (*((volatile unsigned int *)(0x43813110UL)))
#define bM4_USBFS_DIEPINT4_NEPNE (*((volatile unsigned int *)(0x43813118UL)))
#define bM4_USBFS_DIEPINT4_TXFE (*((volatile unsigned int *)(0x4381311CUL)))
#define bM4_USBFS_DIEPTSIZ4_XFRSIZ0 (*((volatile unsigned int *)(0x43813200UL)))
#define bM4_USBFS_DIEPTSIZ4_XFRSIZ1 (*((volatile unsigned int *)(0x43813204UL)))
#define bM4_USBFS_DIEPTSIZ4_XFRSIZ2 (*((volatile unsigned int *)(0x43813208UL)))
#define bM4_USBFS_DIEPTSIZ4_XFRSIZ3 (*((volatile unsigned int *)(0x4381320CUL)))
#define bM4_USBFS_DIEPTSIZ4_XFRSIZ4 (*((volatile unsigned int *)(0x43813210UL)))
#define bM4_USBFS_DIEPTSIZ4_XFRSIZ5 (*((volatile unsigned int *)(0x43813214UL)))
#define bM4_USBFS_DIEPTSIZ4_XFRSIZ6 (*((volatile unsigned int *)(0x43813218UL)))
#define bM4_USBFS_DIEPTSIZ4_XFRSIZ7 (*((volatile unsigned int *)(0x4381321CUL)))
#define bM4_USBFS_DIEPTSIZ4_XFRSIZ8 (*((volatile unsigned int *)(0x43813220UL)))
#define bM4_USBFS_DIEPTSIZ4_XFRSIZ9 (*((volatile unsigned int *)(0x43813224UL)))
#define bM4_USBFS_DIEPTSIZ4_XFRSIZ10 (*((volatile unsigned int *)(0x43813228UL)))
#define bM4_USBFS_DIEPTSIZ4_XFRSIZ11 (*((volatile unsigned int *)(0x4381322CUL)))
#define bM4_USBFS_DIEPTSIZ4_XFRSIZ12 (*((volatile unsigned int *)(0x43813230UL)))
#define bM4_USBFS_DIEPTSIZ4_XFRSIZ13 (*((volatile unsigned int *)(0x43813234UL)))
#define bM4_USBFS_DIEPTSIZ4_XFRSIZ14 (*((volatile unsigned int *)(0x43813238UL)))
#define bM4_USBFS_DIEPTSIZ4_XFRSIZ15 (*((volatile unsigned int *)(0x4381323CUL)))
#define bM4_USBFS_DIEPTSIZ4_XFRSIZ16 (*((volatile unsigned int *)(0x43813240UL)))
#define bM4_USBFS_DIEPTSIZ4_XFRSIZ17 (*((volatile unsigned int *)(0x43813244UL)))
#define bM4_USBFS_DIEPTSIZ4_XFRSIZ18 (*((volatile unsigned int *)(0x43813248UL)))
#define bM4_USBFS_DIEPTSIZ4_PKTCNT0 (*((volatile unsigned int *)(0x4381324CUL)))
#define bM4_USBFS_DIEPTSIZ4_PKTCNT1 (*((volatile unsigned int *)(0x43813250UL)))
#define bM4_USBFS_DIEPTSIZ4_PKTCNT2 (*((volatile unsigned int *)(0x43813254UL)))
#define bM4_USBFS_DIEPTSIZ4_PKTCNT3 (*((volatile unsigned int *)(0x43813258UL)))
#define bM4_USBFS_DIEPTSIZ4_PKTCNT4 (*((volatile unsigned int *)(0x4381325CUL)))
#define bM4_USBFS_DIEPTSIZ4_PKTCNT5 (*((volatile unsigned int *)(0x43813260UL)))
#define bM4_USBFS_DIEPTSIZ4_PKTCNT6 (*((volatile unsigned int *)(0x43813264UL)))
#define bM4_USBFS_DIEPTSIZ4_PKTCNT7 (*((volatile unsigned int *)(0x43813268UL)))
#define bM4_USBFS_DIEPTSIZ4_PKTCNT8 (*((volatile unsigned int *)(0x4381326CUL)))
#define bM4_USBFS_DIEPTSIZ4_PKTCNT9 (*((volatile unsigned int *)(0x43813270UL)))
#define bM4_USBFS_DIEPTSIZ4_MC0 (*((volatile unsigned int *)(0x43813274UL)))
#define bM4_USBFS_DIEPTSIZ4_MC1 (*((volatile unsigned int *)(0x43813278UL)))
#define bM4_USBFS_DTXFSTS4_INEPTFSAV0 (*((volatile unsigned int *)(0x43813300UL)))
#define bM4_USBFS_DTXFSTS4_INEPTFSAV1 (*((volatile unsigned int *)(0x43813304UL)))
#define bM4_USBFS_DTXFSTS4_INEPTFSAV2 (*((volatile unsigned int *)(0x43813308UL)))
#define bM4_USBFS_DTXFSTS4_INEPTFSAV3 (*((volatile unsigned int *)(0x4381330CUL)))
#define bM4_USBFS_DTXFSTS4_INEPTFSAV4 (*((volatile unsigned int *)(0x43813310UL)))
#define bM4_USBFS_DTXFSTS4_INEPTFSAV5 (*((volatile unsigned int *)(0x43813314UL)))
#define bM4_USBFS_DTXFSTS4_INEPTFSAV6 (*((volatile unsigned int *)(0x43813318UL)))
#define bM4_USBFS_DTXFSTS4_INEPTFSAV7 (*((volatile unsigned int *)(0x4381331CUL)))
#define bM4_USBFS_DTXFSTS4_INEPTFSAV8 (*((volatile unsigned int *)(0x43813320UL)))
#define bM4_USBFS_DTXFSTS4_INEPTFSAV9 (*((volatile unsigned int *)(0x43813324UL)))
#define bM4_USBFS_DTXFSTS4_INEPTFSAV10 (*((volatile unsigned int *)(0x43813328UL)))
#define bM4_USBFS_DTXFSTS4_INEPTFSAV11 (*((volatile unsigned int *)(0x4381332CUL)))
#define bM4_USBFS_DTXFSTS4_INEPTFSAV12 (*((volatile unsigned int *)(0x43813330UL)))
#define bM4_USBFS_DTXFSTS4_INEPTFSAV13 (*((volatile unsigned int *)(0x43813334UL)))
#define bM4_USBFS_DTXFSTS4_INEPTFSAV14 (*((volatile unsigned int *)(0x43813338UL)))
#define bM4_USBFS_DTXFSTS4_INEPTFSAV15 (*((volatile unsigned int *)(0x4381333CUL)))
#define bM4_USBFS_DIEPCTL5_MPSIZ0 (*((volatile unsigned int *)(0x43813400UL)))
#define bM4_USBFS_DIEPCTL5_MPSIZ1 (*((volatile unsigned int *)(0x43813404UL)))
#define bM4_USBFS_DIEPCTL5_MPSIZ2 (*((volatile unsigned int *)(0x43813408UL)))
#define bM4_USBFS_DIEPCTL5_MPSIZ3 (*((volatile unsigned int *)(0x4381340CUL)))
#define bM4_USBFS_DIEPCTL5_MPSIZ4 (*((volatile unsigned int *)(0x43813410UL)))
#define bM4_USBFS_DIEPCTL5_MPSIZ5 (*((volatile unsigned int *)(0x43813414UL)))
#define bM4_USBFS_DIEPCTL5_MPSIZ6 (*((volatile unsigned int *)(0x43813418UL)))
#define bM4_USBFS_DIEPCTL5_MPSIZ7 (*((volatile unsigned int *)(0x4381341CUL)))
#define bM4_USBFS_DIEPCTL5_MPSIZ8 (*((volatile unsigned int *)(0x43813420UL)))
#define bM4_USBFS_DIEPCTL5_MPSIZ9 (*((volatile unsigned int *)(0x43813424UL)))
#define bM4_USBFS_DIEPCTL5_MPSIZ10 (*((volatile unsigned int *)(0x43813428UL)))
#define bM4_USBFS_DIEPCTL5_USBAEP (*((volatile unsigned int *)(0x4381343CUL)))
#define bM4_USBFS_DIEPCTL5_EONUM_DPID (*((volatile unsigned int *)(0x43813440UL)))
#define bM4_USBFS_DIEPCTL5_NAKSTS (*((volatile unsigned int *)(0x43813444UL)))
#define bM4_USBFS_DIEPCTL5_EPTYP0 (*((volatile unsigned int *)(0x43813448UL)))
#define bM4_USBFS_DIEPCTL5_EPTYP1 (*((volatile unsigned int *)(0x4381344CUL)))
#define bM4_USBFS_DIEPCTL5_STALL (*((volatile unsigned int *)(0x43813454UL)))
#define bM4_USBFS_DIEPCTL5_TXFNUM0 (*((volatile unsigned int *)(0x43813458UL)))
#define bM4_USBFS_DIEPCTL5_TXFNUM1 (*((volatile unsigned int *)(0x4381345CUL)))
#define bM4_USBFS_DIEPCTL5_TXFNUM2 (*((volatile unsigned int *)(0x43813460UL)))
#define bM4_USBFS_DIEPCTL5_TXFNUM3 (*((volatile unsigned int *)(0x43813464UL)))
#define bM4_USBFS_DIEPCTL5_CNAK (*((volatile unsigned int *)(0x43813468UL)))
#define bM4_USBFS_DIEPCTL5_SNAK (*((volatile unsigned int *)(0x4381346CUL)))
#define bM4_USBFS_DIEPCTL5_SD0PID_SEVNFRM (*((volatile unsigned int *)(0x43813470UL)))
#define bM4_USBFS_DIEPCTL5_SODDFRM (*((volatile unsigned int *)(0x43813474UL)))
#define bM4_USBFS_DIEPCTL5_EPDIS (*((volatile unsigned int *)(0x43813478UL)))
#define bM4_USBFS_DIEPCTL5_EPENA (*((volatile unsigned int *)(0x4381347CUL)))
#define bM4_USBFS_DIEPINT5_XFRC (*((volatile unsigned int *)(0x43813500UL)))
#define bM4_USBFS_DIEPINT5_EPDISD (*((volatile unsigned int *)(0x43813504UL)))
#define bM4_USBFS_DIEPINT5_TOC (*((volatile unsigned int *)(0x4381350CUL)))
#define bM4_USBFS_DIEPINT5_TTXFE (*((volatile unsigned int *)(0x43813510UL)))
#define bM4_USBFS_DIEPINT5_NEPNE (*((volatile unsigned int *)(0x43813518UL)))
#define bM4_USBFS_DIEPINT5_TXFE (*((volatile unsigned int *)(0x4381351CUL)))
#define bM4_USBFS_DIEPTSIZ5_XFRSIZ0 (*((volatile unsigned int *)(0x43813600UL)))
#define bM4_USBFS_DIEPTSIZ5_XFRSIZ1 (*((volatile unsigned int *)(0x43813604UL)))
#define bM4_USBFS_DIEPTSIZ5_XFRSIZ2 (*((volatile unsigned int *)(0x43813608UL)))
#define bM4_USBFS_DIEPTSIZ5_XFRSIZ3 (*((volatile unsigned int *)(0x4381360CUL)))
#define bM4_USBFS_DIEPTSIZ5_XFRSIZ4 (*((volatile unsigned int *)(0x43813610UL)))
#define bM4_USBFS_DIEPTSIZ5_XFRSIZ5 (*((volatile unsigned int *)(0x43813614UL)))
#define bM4_USBFS_DIEPTSIZ5_XFRSIZ6 (*((volatile unsigned int *)(0x43813618UL)))
#define bM4_USBFS_DIEPTSIZ5_XFRSIZ7 (*((volatile unsigned int *)(0x4381361CUL)))
#define bM4_USBFS_DIEPTSIZ5_XFRSIZ8 (*((volatile unsigned int *)(0x43813620UL)))
#define bM4_USBFS_DIEPTSIZ5_XFRSIZ9 (*((volatile unsigned int *)(0x43813624UL)))
#define bM4_USBFS_DIEPTSIZ5_XFRSIZ10 (*((volatile unsigned int *)(0x43813628UL)))
#define bM4_USBFS_DIEPTSIZ5_XFRSIZ11 (*((volatile unsigned int *)(0x4381362CUL)))
#define bM4_USBFS_DIEPTSIZ5_XFRSIZ12 (*((volatile unsigned int *)(0x43813630UL)))
#define bM4_USBFS_DIEPTSIZ5_XFRSIZ13 (*((volatile unsigned int *)(0x43813634UL)))
#define bM4_USBFS_DIEPTSIZ5_XFRSIZ14 (*((volatile unsigned int *)(0x43813638UL)))
